{"id": "deductions_0", "text": "Disclaimer: The contents of this document are for informatio n purposes only. This aims to enable public to have a quick and an easy access to information and do not purport to be legal documents. Viewers are advised to verify the content from Government Acts/Rules/Notifications etc. Deductions/Allowances allowed to a salaried employee ‘Salary’ is the first head of income. The income taxable under this head shall be calculated on the due basis or the receipt basis, whichever occurs earlier. Taxable salary shall include taxable allowances, perquisites, retirement benefits, and profit in lieu of salary. Certain deductions are also allowed from salary income. Taxability of Allowances Allowances are additional components of salary that are regularly given to the employees to meet the expenditure for particular purposes. Allowances are generally fixed irrespective of actual expenditure and are taxable. Under the Act, it is taxable under Section 15 on a due or accrual basis, irrespective of whether it is paid in addition to or in lieu of salary. However, some exemptions are allowed by the Income-tax Act. Types of Allowances In accordance with the term of employment or condition of the workplace or statutory requirement, an employer may provide various allowances to the employees. An allowance is assumed to be taxable under the head ‘Salary’ unless it is specifically exempted from tax, fully or partly. The treatment of popular allowances shall be in accordance with the following provision. Fully Taxable Allowances Allowance Description Dearness Allowance Dearness Allowance is provided to an employee to compensate for the effect of rising prices and inflation. Overtime Allowance Allowance given to employees for working overtime. City Compensatory City Compensatory Allowance is paid by employers to their Allowance employees to compensate them for the high cost of living in metro cities. Transport Allowance to Transport allowance granted to an employee to meet his employee other than expenditure for the purpose of commuting between the place of blind/ deaf and dumb/ his residence and the place of his duty is fully taxable. However, orthopedically in the case of blind/deaf and dumb/ orthopedically handicapped handicapped employee employees, an exemption of up to Rs. 3,200 per month is provided. Medical Allowance, Tiffin Allowance, and Servant Allowance are also taxable under Section 15. Partially Taxable Allowances Description Exemption House Rent Allowance is paid by the Minimum of the following three amounts: employers to the employees to meet the cost HRA Actually Received of rented house taken by them. [Section Actual house rent paid minus 10% of salary 10(13A)] (See Note) [As amended by Finance Act, 2025] 50% of salary (if the residence is in Delhi, Mumbai, Kolkata, or Chennai), otherwise 40% of salary. Transport Allowance granted to an employee Lower of 70% of such transport allowance working in any transport system to meet his or Rs. 10,000 per month. personal expenditure during the performance of his duties for going from one place to another, provided he does not receive the daily allowance, Children Education Allowance - Granted to Up to Rs. 100 per month per child for a meet the tuition fees of a maximum of two maximum of 2 children children. Hostel Allowance - Granted to meet the Up to Rs. 300 per month per child for a Hostel expenditure of a maximum of two maximum of 2 Children. children Office Duty Allowances These allowances are exempt to the extent Travelling allowance of a minimum of actual allowance received or actual amount spent for the purpose of Conveyance allowance duties of employment. Daily allowance Helper allowance Research allowance Uniform allowance Special Compensatory Allowance (Hilly Varies from Rs. 300 per month to Rs. 7,000 Areas) (Subject to certain conditions and per month. locations) Border Area Allowance, or Remote Locality Varies from Rs. 200 per month to Rs. 1,300 Allowance, or Disturbed Area Allowance, or per month. Difficult Area Allowance (Subject to certain conditions and locations) Tribal Area or Special Compensatory or Up to Rs. 200 per month Scheduled Area or Agency Area Allowance (Subject to certain locations) Compensatory Field Area Allowance. Up to Rs. 2,600 per month (Subject to certain conditions and locations) Compensatory Modified Field Area Up to Rs. 1,000 per month Allowance. (Subject to certain conditions and locations) Counter Insurgency Allowance granted to the Up to Rs. 3,900 per month members of armed forces operating in areas away from their permanent locations. Underground Allowance granted to Up to Rs. 800 per month employees working in uncongenial, unnatural climates in underground mines High Altitude Allowance granted to the a) Up to Rs. 1,060 per month (for an armed forces operating in high-altitude areas altitude of 9,000 to 15,000 feet) b) Up to Rs. 1,600 per month (for an altitude above 15,000 feet) [As amended by Finance Act, 2025] Special Compensatory Highly Active Field Up to Rs. 4,200 per month Area Allowance granted to members of the armed forces Island Duty Allowance granted to members of Up to Rs. 3,250 per month the armed forces in Andaman and Nicobar and Lakshadweep group of Island Note: House Rent Allowance The exemption for House Rent Allowance (‘HRA’) shall be allowed if the residential accommodation occupied by the employee is not owned by him and he actually pays rent in respect of such residential accommodation. Thus, no exemption is allowed if the employee stays in an accommodation owned by him or where he does not pay any rent in respect of the accommodation. ‘Salary’ for this purpose shall be the aggregate of basic salary, dearness allowance (if it forms part of salary for retirement benefits), and commission paid to the employee. The exemption is allowed only for the period during which the rented house is occupied by the employee and not for any period after or before that. If rental expenditure is less than 10% of salary, no exemption shall be allowed to the employee for the HRA. Deductions from Salary [Section 16] Income-tax Act allows three deductions from the salary income, i.e., Standard Deduction, Deduction for Entertainment Allowance, and Deduction for Professional Tax. Standard Deduction is allowed to every employee whose income is taxable under the head salary. In contrast, the other two deductions are allowed subject to certain conditions. Standard Deduction This deduction is available to all employees drawing salary income, including retired employees drawing pension income. The Standard Deduction is absolute and unconditional, and the employee does not require to furnish any supporting evidence to claim this deduction. The deduction is the same for all employees with a ceiling of Rs. 50,000, irrespective of the salary drawn. However, with effect from 01-04-2025, the Finance (No. 2) Act, 2024 increased the amount of standard deduction from the existing Rs. 50,000 to Rs. 75,000 in a case where the assessee-employee computes the income tax under the new (default) tax regime prescribed under Section 115BAC(1A)(ii). Accordingly, this will apply to assessment year 2025-26. Entertainment Allowance The entertainment allowance received by an employee is a taxable allowance. If such entertainment allowance is received by a Government employee, a deduction is allowed to him while computing the taxable income under the head salary. However, no deduction is allowed under this provision to a taxpayer who is not an employee of any Central or State Government. The amount", "metadata": {"source": "deductions", "chunk_index": 0}}
{"id": "deductions_1", "text": "of deduction allowable to the Govt. employee for the Entertainment Allowance shall be lower of the following: Actual amount of entertainment allowance received during the previous year 20% of salary exclusive of any allowance, benefit, or other perquisites Rs. 5,000 [As amended by Finance Act, 2025] Professional tax Professional tax paid by the employee, by way of deduction from his salary, is allowed as a deduction from the taxable salary income. Even if paid in advance, the professional tax paid during the year is deductible from the salary income. If the employer pays the professional tax out of his pocket, without deducting it from the employee’s salary, then it shall be first included in the employee’s income as a perquisite. After that, a deduction on such professional tax is allowed from gross salary. Deduction allowed to salaried employee [Chapter VI-A] Section 80C Up to 1,50,000 (Subject to overall limit of Rs. 1,50,000 under Section 80C, Common investments or expenditures for which 80CCC and 80CCD(1)) the deduction under Section 80C is allowed are as under: 1. Payment for life insurance premium 2. Sum paid under a contract for a deferred annuity 3. Contributions to the Employees’ or Recognised Provident Fund 4. Contribution to Public Provident Fund Account 5. Contribution to an approved superannuation fund 6. Subscription to any notified security or notified deposit scheme (Sukanya Samriddhi Account Scheme) 7. Subscription to notified savings certificates 8. Contribution to notified unit-linked insurance plan 9. Tuition fees for the full-time education of any 2 children 10. Certain payments for the purchase/construction of residential house property 11. Notified annuity plan of LIC or other insurers 12. Investment in Equity Linked Saving Scheme 13. Term deposits for a fixed period of not less than 5 years with a scheduled bank 14. Deposit in Senior Citizen Savings Scheme 15. Contribution to Tier-II NPS account by central government’s employees. Section 80CCC Up to 1,50,000 (Subject to overall limit of Rs. 1,50,000 under Section 80C, Contribution to certain specified Pension Funds of 80CCC and 80CCD) LIC/other insurers (Subject to certain conditions). [As amended by Finance Act, 2025] Section 80CCD Amount contributed to a pension scheme or 10% or 14%, as the case Contribution to New Pension Scheme (NPS) may be, of salary/gross total income*, notified by the Central Government (Subject to whichever is less (subject to ceiling certain conditions). limit of Rs. 1,50,000 as provided under Section 80CCE) shall be allowed as deduction under section 80CCD(1). Additional deduction to the extent of Rs. 50,000 shall also be available to the assessee under section 80CCD(1B). The additional deduction is not subject to a ceiling limit of Rs. 1,50,000 as provided under Section 80CCE. Contribution made by the employer shall also be allowed as a deduction under section 80CCD(2) while computing the total income of the employee. However, the amount of deduction could not exceed 14% of the salary in case of central/state Govt. employees and 10% or 14%, as the case may be, in any other employees. *10% of salary in case of employees otherwise 20% of gross total income. Note: The benefit of additional deduction of upto Rs. 50,000 under section 80CCD(1B) is also available to sum deposited to the account of minor by parent or guardian (effective from AY 2026-27) Section 80CCH Whole of the amount paid/deposited Amount paid/deposited in Agniveer Corpus Fund by the assessee and contribution made by Central Government to such fund Section 80D For self, spouse, and dependent children: Up to Rs. 25,000 (Rs. Amount paid (in any mode other than cash) to LIC 50,000 if specified person is a senior or other insurers to effect or keep in force an citizen) insurance on the health of a specified person (self, spouse, dependent children or parents). An For parents: additional deduction of [As amended by Finance Act, 2025] individual can also make payment to the Central Rs. 25,000 shall be allowed (Rs. Government health scheme and/or on account of 50,000 if the parent is a senior preventive health check-up. citizen) Note: Deduction for preventive health check-up shall not exceed in aggregate Rs. 5,000. Payment on account of preventive health check-up may be made in cash. Within the overall limit, deduction shall also be allowed up to Rs. 50,000 towards medical expenditure incurred on the health of a specified person provided such person is a resident senior citizen and no amount has been paid to effect or to keep in force an insurance on the health of such person. Section 80DD Rs. 75,000 (Rs. 1,25,000 in case of severe disability) (a) Any expenditure incurred for the medical treatment (including nursing), training, and Note: rehabilitation of a dependent, being a person Dependant of individual means the with disability spouse, children, parents, brothers and (b) Any amount paid or deposited under an sisters of the individual or any of them. approved scheme framed in this behalf by the LIC or any other insurer or the Administrator or the specified company for the maintenance of a dependent, being a person with disability (Subject to certain conditions). Section 80DDB Up to Rs. 40,000 (Rs. 100,000 in case of senior citizen) Expenses actually paid for medical treatment of specified diseases and ailments for the assessee himself or wholly dependent spouse, children, parents, brothers and sisters (Subject to certain conditions). Section 80E The amount of interest paid during the initial year and 7 immediately succeeding Amount paid out of income chargeable to tax by assessment years (or until the above way of payment of interest on loan taken from interest is paid in full). financial institution/approved charitable institution for pursuing higher education (Subject to certain conditions). Section 80EE Deduction of up to Rs. 50,000 towards interest on loan. Interest payable on a loan taken up to Rs. 35 lakhs by the taxpayer from any financial institution, sanctioned during the FY 2016-17, for the purpose of acquisition of a residential house property [As amended by Finance Act, 2025] whose value does not exceed Rs. 50 lakhs. Note: On the date of sanction of loan, the taxpayer should not own any other residential house property. Section 80EEA Deduction of up to Rs. 1,50,000 towards interest on loan Interest payable on a loan taken by an individual, who is not eligible to claim deduction under section 80EE, from any financial institution during the period beginning from 01-04-2019 ending on 31-03-2022 for the purpose of acquisition of a residential house property whose stamp duty value does not exceed Rs. 45 lakhs. Section 80EEB Deduction of up to Rs. 1,50,000 towards interest on loan Interest payable on a loan taken by an individual from any financial institution during the period beginning from 01-04-2019 and ending on 31/03/2023 to purchase an electric vehicle. Section 80G 50% to 100% of donation made Donation to specified institutions or funds Note: No deduction shall be allowed in respect of donation in cash over Rs. 2,000. Section 80GG Minimum of the following shall be allowed as deduction: Rent paid for furnished/unfurnished residential accommodation (Subject to certain conditions) (a) Rent paid in excess of 10% of total income; (b) 25% of the Total Income; or (c) Rs. 5,000 per month. Total Income = Gross total income minus long-term capital gains, short-term capital", "metadata": {"source": "deductions", "chunk_index": 1}}
{"id": "deductions_2", "text": "gains under section 111A, deductions under sections 80C to 80U (other than 80GG) and income under Section 115A Section 80GGA 100% of the donation made Donation for scientific research or rural development Note: No deduction shall be allowed in respect of cash contribution over Rs. 2,000. Section 80GGC 100% of the donation made Donation to a political party or an electoral trust [As amended by Finance Act, 2025] Note: The amount contributed in cash shall not be eligible for deduction. Section 80TTA 100% of the amount of such income subject to maximum of Rs. 10,000 Interest on deposits in saving account with a banking company, a post office, a co-operative society engaged in banking business, etc. (Subject to certain conditions) Section 80TTB 100% of the amount of such income subject to the maximum amount of Rs. Interest on deposits with a banking company, a 50,000 post office, a co-operative society engaged in banking business, etc. (Subject to certain conditions) Section 80U Rs. 75,000 (Rs. 1,25,000 in case of severe disability) A resident individual who, at any time during the previous year, is certified by the medical authority to be a person with disability [As amended by Finance Act, 2025] MCQs on Deductions/Allowances allowed to salaried employees Q1. Transport allowance granted to an employee (except who is blind or deaf and dumb or orthopedically handicapped with disability of lower extremities) to meet his expenditure for the purpose of commuting between the place of his residence and the place of his duty is _________. (a) Fully Taxable (b) Exempt up to Rs. 3,200 per month (c) Exempt up to Rs. 1,600 per month (d) None of the above Correct answer: (a) Explanation: Transport allowance granted to an employee to meet his expenditure for the purpose of commuting between the place of his residence and the place of his duty is fully taxable. However, in the case of blind/deaf and dumb/ orthopedically handicapped employees, an exemption of up to Rs. 3,200 per month is provided. Q2. Medical allowance granted by an employer to the employee is fully taxable. (a) True (b) False Correct answer: (a) Explanation: Medical Allowance, Tiffin Allowance, and Servant Allowance granted by an employer to the employee is fully taxable. Q3. House Rent Allowance paid by the employers to the employees is exempt up to _________. (a) HRA Actually Received (b) Actual house rent paid minus 10% of salary (c) 50% of the salary (if the residence is in Delhi, Mumbai, Kolkata, or Chennai), otherwise 40% of the salary (d) Lower of (a), (b) and (c) Correct answer: (d) Explanation: House Rent Allowance paid by the employers to the employees is exempt up to the minimum of the following amounts: HRA Actually Received Actual house rent paid minus 10% of salary 50% of salary (if the residence is in Delhi, Mumbai, Kolkata, or Chennai), otherwise 40% of salary. Q4. Transport Allowance granted to an employee working in any transport system to meet his personal expenditure during the performance of his duties for going from one place to another is exempt up to _________. (a) 70% of such transport allowance (b) Rs. 10,000 per month (c) Lower of (a) or (b) (d) Higher of (a) or (b) Correct answer: (c) [As amended by Finance Act, 2025] Explanation: Transport Allowance granted to an employee working in any transport system to meet his personal expenditure during the performance of his duties for going from one place to another, provided he does not receive the daily allowance and is exempt up to Lower of 70% of such transport allowance or Rs. 10,000 per month. Q5. Which of the following allowances are exempt to the extent of a minimum of actual allowance received or actual amount spent for the purpose of duties of employment? (a) Travelling allowance (b) Research allowance (c) Uniform allowance (d) All of the above Correct answer: (d) Explanation: Office Duty Allowances are exempt to the extent of a minimum of actual allowance received or actual amount spent for the purpose of duties of employment. This includes Travelling allowance, Conveyance allowance, Daily allowance, Helper allowance, Research allowance and Uniform allowance. Q6. The entertainment allowance received by an employee (other than a government employee) is exempt up to ______. (a) Actual amount of entertainment allowance received (b) 20% of salary exclusive of any allowance, benefit, or other perquisite (c) Rs. 5,000 (d) None of the above Correct answer: (d) Explanation: The entertainment allowance received by an employee is a taxable allowance. If such entertainment allowance is received by a Government employee, a deduction is allowed to him while computing the taxable income under the head salary. The amount of deduction allowable to the Govt. employee for the Entertainment Allowance shall be lower of the following: Actual amount of entertainment allowance received during the previous year 20% of salary exclusive of any allowance, benefit, or other perquisite Rs. 5,000 Q7. Which of the following payments are covered for the deduction under Section 80C? (a) Life insurance premium (b) Contribution to Public Provident Fund Account (c) Tuition fees (d) All of the above Correct answer: (d) Explanation: Deduction under Section 80C can be claimed for all of the above-mentioned payments including Life insurance premium, Contribution to Public Provident Fund Account, and Tuition fees (excluding development fees, donations, etc.) paid by an individual to any university, college, school, or other educational institution situated in India, for the full-time education of any 2 of his/her children. [As amended by Finance Act, 2025] Q8. What is the maximum amount allowed under Section 80D for the payment made by an individual for the health insurance premium of the parents (senior citizen)? (a) Rs. 25,000 (b) Rs. 50,000 (c) Rs. 1,00,000 (d) Rs. 5,000 Correct answer: (b) Explanation: An individual can claim a maximum deduction of Rs. 50,000 under section 80D where payment is made in respect of medical insurance premium on the health of his parents (if the parent is a senior citizen) otherwise Rs. 25,000 shall be allowed as deduction. [As amended by Finance Act, 2025]", "metadata": {"source": "deductions", "chunk_index": 2}}
