{"id": "gst_9_2025_0", "text": "76 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] MINISTRY OF FINANCE (Department of Revenue) NOTIFICATION New Delhi, the 17th September, 2025 NO. 9/2025-Central Tax (Rate) `G.S.R. 641(E).—In exercise of the powers conferred by sub-section (1) of section 9 and sub-section (5) of section 15 of the Central Goods and Services Tax Act, 2017 (12 of 2017), and in supersession of the notification of the Government of India in the Ministry of Finance (Department of Revenue), No. 01/2017-Central Tax (Rate), dated the 28th June, 2017 published in the Gazette of India, Extraordinary, Part II, Section 3, Sub-section (i), vide number G.S.R. 673(E), dated the 28th June, 2017, except as respects things done or omitted to be done before such supersession, the Central Government, on the recommendations of the Council, hereby notifies the rate of central tax of- (i) 2.5 per cent. in respect of goods specified in Schedule I; (ii) 9 per cent. in respect of goods specified in Schedule II; (iii) 20 per cent. in respect of goods specified in Schedule III; (iv) 1.5 per cent. in respect of goods specified in Schedule IV; (v) 0.125 per cent. in respect of goods specified in Schedule V; (vi) 0.75 per cent. in respect of goods specified in Schedule VI, and (vii) 14 per cent. in respect of goods specified in Schedule VII, appended to this notification (hereinafter referred to as the said Schedules), that shall be levied on intra-State supplies of goods, the description of which is specified in the corresponding entry in column (3) of the said Schedules, falling under the tariff item, sub-heading, heading or Chapter, as the case may be, as specified in the corresponding entry in column (2) of the said Schedules. Schedule I – 2.5% S. No. Chapter/Heading/Sub- Description of goods heading/Tariff item (1) (2) (3) 1. 0101 21 00, 0101 29 Live horses 2. 0202, 0203, 0204, 0205, 0206, All goods, other than fresh or chilled, pre-packaged and labelled 0207, 0208, 0209, 0210 3. 0303, 0304, 0305, 0306, 0307, All goods, other than fresh or chilled, pre-packaged and labelled 0308, 0309 4. 0402 Milk and cream, concentrated or containing added sugar or other sweetening matter, including condensed milk [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 77 5. 0403 Yoghurt; Cream, kephir and other fermented or acidified milk and cream, whether or not concentrated or containing added sugar or other sweetening matter or flavored or containing added fruit, nuts or cocoa; Pre-packaged and labelled Curd, Lassi and Butter milk 6. 0404 Whey, whether or not concentrated or containing added sugar or other sweetening matter; products consisting of natural milk constituents, whether or not containing added sugar or other sweetening matter, not elsewhere specified or included 7. 0405 Butter and other fats and oils derived from milk, including ghee; dairy spreads 8. 0406 Cheese, other than chena or paneer 9. 0408 Birds' eggs, not in shell, and egg yolks, fresh, dried, cooked by steaming or by boiling in water, moulded, frozen or otherwise preserved, whether or not containing added sugar or other sweetening matter. 10. 0409 Natural honey, pre-packaged and labelled 11. 0410 Insects and other edible products of animal origin, not elsewhere specified or included 12. 0502 Pigs', hogs' or boars' bristles and hair; badger hair and other brush making hair; waste of such bristles or hair. 13. 0504 All goods, other than fresh or chilled, pre-packaged and labelled 14. 0505 Skins and other parts of birds, with their feathers or down, feathers and parts of feathers (whether or not with trimmed edges) and down, not further worked than cleaned, disinfected or treated for preservation; powder and waste of feathers or parts of feathers 15. 0507 (Except 050790) Ivory, tortoise-shell, whalebone and whalebone hair, horns, unworked or simply prepared but not cut to shape; powder and waste of these products. 16. 0508 Coral and similar materials, unworked or simply prepared but not otherwise worked; shells of molluscs, crustaceans or echinoderms and cuttle-bone, unworked or simply prepared but not cut to shape, powder and waste thereof. 17. 0510 Ambergris, castoreum, civet and musk; cantharides; bile, whether or not dried; glands and other animal products used in the preparation of pharmaceutical products, fresh, chilled, frozen or otherwise provisionally preserved. 18. 0511 Animal products not elsewhere specified or included; dead animals of Chapter 1 or 3, unfit for human consumption, other than semen including frozen semen. 19. 07 Herb, bark, dry plant, dry root, commonly known as jaribooti and dry flower 20. 0713 Dried leguminous vegetables, shelled, whether or not skinned or split pre-packaged and labelled; Guar gum refined split 21. 0714 Manioc, arrowroot, salep, Jerusalem artichokes, sweet potatoes and similar roots and tubers with high starch or inulin content, frozen, whether or not sliced or in the form of pellets, pre-packaged and labelled 22. 0801 Cashew nuts, whether or not shelled or peeled, desiccated coconuts; Brazil nuts, dried, whether or not Shelled or Peeled 23. 0802 Dried areca nuts, whether or not shelled or peeled; Other nuts, dried, whether or not shelled or peeled, such as Almonds, Hazelnuts or filberts (Corylus spp.), Chestnuts (Castanea spp.), Pistachios, Macadamia nuts, Kola nuts (Cola spp.), Pine nuts, chestnuts (singhada), Walnuts, whether or not shelled 78 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 24. 0802, 0813 Chestnuts (singhada), dried whether or not shelled or peeled 25. 08 Dried makhana, whether or not shelled or peeled pre-packaged and labelled 26. 0804 Dates (soft or hard), figs, pineapples, avocados, guavas, mangoes and mangosteens, dried 27. 0805 Citrus fruit, such as Oranges, Mandarins (including tangerines and satsumas); clementines, wilkings and similar citrus hybrids, Grapefruit, including pomelos, Lemons (Citrus limon, Citrus limonum) and limes (Citrus aurantifolia, Citrus latifolia), dried 28. 0806 Grapes, dried, and raisins 29. 0811 Fruit and nuts, uncooked or cooked by steaming or boiling in water, frozen, whether or not containing added sugar or other sweetening matter 30. 0812 Fruit and nuts, provisionally preserved (for example, by sulphur dioxide gas, in brine, in sulphur water or in other preservative solutions), but unsuitable in that state for immediate consumption 31. 0813 Fruit, dried, other than that of headings 0801 to 0806; mixtures of nuts or dried fruits of Chapter 8 [other than dried tamarind] 32. 0814 Peel of citrus fruit or melons (including watermelons), frozen, dried or provisionally preserved in brine, in sulphur water or in other preservative solutions 33. 0901 Coffee roasted, whether or not decaffeinated; coffee husks and skins; coffee substitutes containing coffee in any proportion [other than coffee beans not roasted] 34. 0902 Tea, whether or not flavoured [other than unprocessed green leaves of tea] 35. 0903 Maté 36. 0904 Pepper of the genus Piper; dried or crushed or ground fruits of the genus Capsicum or of the genus Pimenta 37. 0905 Vanilla 38. 0906 Cinnamon and cinnamon-tree flowers 39. 0907 Cloves (whole fruit, cloves and stems) 40. 0908 Nutmeg, mace and cardamoms 41. 0909 Seeds of anise, badian, fennel, coriander, cumin or caraway; juniper berries [other than of seed quality] 42. 0910 [other than 0910 11 10, Ginger other than fresh ginger, saffron, turmeric (curcuma) other 0910 30 10] than fresh turmeric, thyme, bay leaves, curry and other spices 43. 1001 Wheat and meslin,", "metadata": {"source": "gst_9_2025", "chunk_index": 0}}
{"id": "gst_9_2025_1", "text": "pre-packaged and labelled 44. 1002 Rye, pre-packaged and labelled 45. 1003 Barley, pre-packaged and labelled 46. 1004 Oats, pre-packaged and labelled 47. 1005 Maize (corn), pre-packaged and labelled 48. 1006 Rice, pre-packaged and labelled 49. 1007 Grain sorghum, pre-packaged and labelled 50. 1008 Buckwheat, millet and canary seed; other cereals such as Jawar, Bajra, Ragi, pre-packaged and labelled 51. 1101 Wheat or meslin flour, pre-packaged and labelled 52. 1102 Cereal flours other than of wheat or meslin i.e. maize (corn) flour, Rye flour, etc., pre-packaged and labelled 53. 1103 Cereal groats, meal and pellets, including suji and dalia, pre- packaged and labelled 54. 1104 Cereal grains otherwise worked (for example, rolled, flaked, pearled, sliced or kibbled), except rice of heading 1006; germ of cereals, whole, rolled, flaked or ground (other than hulled cereal grains) 55. 1105 Flour, meal, powder, flakes, granules and pellets of potatoes, pre- packaged and labelled 56. 1106 Flour, meal and powder of the dried leguminous vegetables of heading 0713 (pulses) [other than guar meal (HS 1106 10 10) and guar gum refined split ( HS 0713)], of sago or of roots or tubers of [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 79 heading 0714 or of the products of Chapter 8, pre-packaged and labelled 57. 1107 Malt, whether or not roasted 58. 1108 Starches; inulin 59. 1109 00 00 Wheat gluten, whether or not dried 60. 12 All goods other than of seed quality 61. 1201 Soya beans, whether or not broken other than of seed quality. 62. 1202 Ground-nuts, not roasted or otherwise cooked, whether or not shelled or broken other than of seed quality. 63. 1203 Copra 64. 1204 Linseed, whether or not broken other than of seed quality. 65. 1205 Rape or colza seeds, whether or not broken other than of seed quality. 66. 1206 Sunflower seeds, whether or not broken other than of seed quality 67. 1207 Other oil seeds and oleaginous fruits (i.e. Palm nuts and kernels, cotton seeds, Castor oil seeds, Sesamum seeds, Mustard seeds, Safflower (Carthamus tinctorius) seeds, Melon seeds, Poppy seeds, Ajams, Mango kernel, Niger seed, Kokam) whether or not broken, other than of seed quality 68. 1208 Flour and meals of oil seeds or oleaginous fruits, other than those of mustard 69. 1209 Tamarind seeds meant for any use other than sowing 70. 1210 20 00 Hop cones, ground, powdered or in the form of pellets; lupulin 71. 1211 Plants and parts of plants (including seeds and fruits), of a kind used primarily in perfumery, in pharmacy or for insecticidal, fungicidal or similar purpose, frozen or dried, whether or not cut, crushed or powdered 72. 1212 Locust beans, seaweeds and other algae, sugar beet and sugar cane, frozen or dried, whether or not ground; fruit stones and kernels and other vegetable products (including unroasted chicory roots of the variety Cichorium intybus sativum) of a kind used primarily for human consumption, not elsewhere specified or included 73. 1301 Natural gums, resins, gum-resins and oleoresins (for example, balsams) [other than lac and shellac]; Compounded asafoetida commonly known as heeng 74. 1302 Vegetable saps and extracts; pectic substances, pectinates and pectates; agar-agar and other mucilages and thickeners, whether or not modified, derived from vegetable products including tamarind kernel powder 75. 1401 Vegetable materials of a kind used primarily for plaiting (for example, bamboos, rattans, reeds, rushes, osier, raffia, cleaned, bleached or dyed cereal straw, and lime bark) 76. 1404 [other than 1404 90 40, Vegetable products not elsewhere specified or included such as, 1404 90 60] Cotton linters, Soap nuts, Hard seeds, pips, hulls and nuts, of a kind used primarily for carving, Rudraksha seeds, bidi wrapper leaves(tendu), Indian katha [other than betel leaves, coconut shell unworked] 77. 1404 or 3305 Mehendi paste in cones 78. 1501 Pig fats (including lard) and poultry fat, other than that of heading 0209 or 1503 79. 1502 Fats of bovine animals, sheep or goats, other than those of heading 1503 80. 1503 Lard stearin, lard oil, oleo stearin, oleo-oil and tallow oil, not emulsified or mixed or otherwise prepared 81. 1504 Fats and oils and their fractions, of fish or marine mammals, whether or not refined, but not chemically modified 82. 1505 Wool grease and fatty substances derived therefrom (including lanolin) 83. 1506 Other animal fats and oils and their fractions, whether or not refined, but not chemically modified 84. 1507 Soya-bean oil and its fractions, whether or not refined, but not 80 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] chemically modified 85. 1508 Ground-nut oil and its fractions, whether or not refined, but not chemically modified 86. 1509 Olive oil and its fractions, whether or not refined, but not chemically modified 87. 1510 Other oils and their fractions, obtained solely from olives, whether or not refined, but not chemically modified, including blends of these oils or fractions with oils or fractions of heading 1509 88. 1511 Palm oil and its fractions, whether or not refined, but not chemically modified. 89. 1512 Sunflower-seed, safflower or cotton-seed oil and fractions thereof, whether or not refined, but not chemically modified 90. 1513 Coconut (copra), palm kernel or babassu oil and fractions thereof, whether or not refined, but not chemically modified 91. 1514 Rape, colza or mustard oil and fractions thereof, whether or not refined, but not chemically modified 92. 1515 Other fixed vegetable or microbial fats and oils (including jojoba oil) and their fractions, whether or not refined, but not chemically modified 93. 1516 Vegetable fats and oils and their fractions, partly or wholly hydrogenated, inter-esterified, re-esterified or elaidinised, whether or not refined, but not further prepared 94. 1516 Animal or microbial fats and animal or microbial oils and their fractions, partly or wholly hydrogenated, inter-esterified, re- esterified or elaidinised, whether or not refined, but not further prepared 95. 1517 Margarine, linoxyn; Edible mixtures or preparations of animal, vegetable or microbial fats or oils or of fractions of different fats or oils of this Chapter, other than edible fats or oils or their fractions of heading 1516 96. 1518 Animal, vegetable or microbial fats and oils their fractions, boiled, oxidised, dehydrated, sulphurised, blown, polymerised by heat in vacuum or in inert gas or otherwise chemically modified, excluding those of heading 1516; inedible mixtures or preparations of animal, vegetable or microbial fats or oils or of fractions of different fats or oils of this Chapter, not elsewhere specified or included 97. 1520 00 00 Glycerol, crude; glycerol waters and glycerol lyes 98. 1521 Vegetable waxes (other than triglycerides), Beeswax, other insect waxes and spermaceti, whether or not refined or coloured 99. 1522 Degras, residues resulting from the treatment of fatty substances or animal or vegetable waxes 100. 1601 Sausages and similar products, of meat, meat offal, blood or insects; food preparations based on these products 101. 1602 Other prepared or preserved meat, meat offal, blood or insects 102. 1603 Extracts and juices of meat, fish or crustaceans, molluscs or other aquatic invertebrates 103. 1604 Prepared or preserved fish; caviar and caviar substitutes prepared from fish eggs 104. 1605 Crustaceans, molluscs and other aquatic invertebrates prepared or preserved 105. 1701 Cane or beet sugar and chemically pure sucrose, in solid form including refined", "metadata": {"source": "gst_9_2025", "chunk_index": 1}}
{"id": "gst_9_2025_2", "text": "sugar containing added flavouring or colouring matter, sugar cubes [other than jaggery of all types, khandsari sugar, rab] 106. 1701 or1702 Jaggery of all types including Cane Jaggery (gur), Palmyra Jaggery, Khandsari Sugar, Rab, pre-packaged and labelled 107. 1702 or 1704 Palmyra sugar, mishri, batasha, bura, sakar, khadi sakar, harda, sakariya, gatta, kuliya, elaichidana, lukumdana, chikkis like puffed rice chikki, peanut chikki, sesame chikki, til chikki, til patti, til revdi, sugar makhana, groundnut sweets, gajak, khaja, khajuli, anarsa [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 81 108. 1702 Other sugars, including chemically pure lactose, maltose, glucose and fructose, in solid form; sugar syrups not containing added flavouring or colouring matter; caramel 109. 1703 Molasses 110. 1704 Sugar confectionary (including white chocolate), not containing cocoa, sugar boiled confectionary 111. 1801 Cocoa beans whole or broken, raw or roasted 112. 1802 Cocoa shells, husks, skins and other cocoa waste 113. 1803 Cocoa paste whether or not de-fatted 114. 1804 Cocoa butter, fat and oil 115. 1805 Cocoa powder, not containing added sugar or sweetening matter 116. 1806 Chocolates and other food preparations containing cocoa 117. 1901 20 00 Mixes and doughs for the preparation of bread, pastry and other baker's wares 118. 1901 Food preparation of millet flour, in powder form, containing at least 70% millets by weight, pre-packaged and labelled; Malt extract, food preparations of flour, groats, meal, starch or malt extract, not containing cocoa or containing less than 40% by weight of cocoa calculated on a totally defatted basis, not elsewhere specified or included; food preparations of goods of heading 0401 to 0404, not containing cocoa or containing less than 5% by weight of cocoa calculated on a totally defatted basis not elsewhere specified or included 119. 1902 Seviyan (vermicelli); Pasta, whether or not cooked or stuffed (with meat or other substances) or otherwise prepared, such as spaghetti, macaroni, noodles, lasagne, gnocchi, ravioli, cannelloni; couscous, whether or not prepared 120. 1903 Tapioca and substitutes therefor prepared from starch, in the form of flakes, grains, pearls, siftings or in similar forms (sabudana) 121. 1904 Puffed rice, commonly known as Muri, flattened or beaten rice, commonly known as chira, parched rice, commonly known as khoi, parched paddy or rice coated with sugar or gur, commonly known as murki, pre-packaged and labelled 122. 1904 All goods i.e. Corn flakes, bulgar wheat, prepared foods obtained from cereal flakes (other than puffed rice, commonly known as muri, flattened or beaten rice, commonly known as chira, parched rice, commonly known as khoi, parched paddy or rice coated with sugar or gur, commonly known as murki); Fortified Rice Kernel (FRK) 123. 1905 Pastry, cakes, biscuits and other bakers’ wares, whether or not containing cocoa; communion wafers, empty cachets of a kind suitable for pharmaceutical use, sealing wafers, rice paper and similar products; Un-fried or un-cooked snack pellets, by whatever name called, manufactured through process of extrusion; Extruded or expanded products, savoury or salted 124. 1905 40 00 Rusks, toasted bread and similar toasted products 125. 2001 Vegetables, fruit, nuts and other edible parts of plants, prepared or preserved by vinegar or acetic acid 82 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 126. 2002 Tomatoes prepared or preserved otherwise than by vinegar or acetic acid 127. 2003 Mushrooms and truffles, prepared or preserved otherwise than by vinegar or acetic acid 128. 2004 Other vegetables prepared or preserved otherwise than by vinegar or acetic acid, frozen, other than products of heading 2006 129. 2005 Other vegetables prepared or preserved otherwise than by vinegar or acetic acid, not frozen, other than products of heading 2006 130. 2006 Vegetables, fruit, nuts, fruit-peel and other parts of plants, preserved by sugar (drained, glacé or crystallised) 131. 2007 Jams, fruit jellies, marmalades, fruit or nut purée and fruit or nut pastes, obtained by cooking, whether or not containing added sugar or other sweetening matter 132. 2008 Fruit, nuts and other edible parts of plants, otherwise prepared or preserved, whether or not containing added sugar or other sweetening matter or spirit, not elsewhere specified or included; such as Ground-nuts, Cashew nut, roasted, salted or roasted and salted, Other roasted nuts and seeds, squash of Mango, Lemon, Orange, Pineapple or other fruits 133. 2009 Fruit or nut juices (including grape must) and vegetable juices, unfermented and not containing added spirit, whether or not containing added sugar or other sweetening matter 134. 2009 89 90 Tender coconut water, pre-packaged and labelled 135. 2101 11, 2101 12 00 Extracts, essences and concentrates of coffee, and preparations with a basis of these extracts, essences or concentrates or with a basis of coffee 136. 2101 20 All goods i.e Extracts, essences and concentrates of tea or mate, and preparations with a basis of these extracts, essences or concentrates or with a basis of tea or mate 137. 2101 30 Roasted chicory and other roasted coffee substitutes, and extracts, essences and concentrates thereof 138. 2102 Yeasts (active and inactive); other single cell micro-organisms, dead (but not including vaccines of heading 3002); prepared baking powders 139. 2103 All goods, including sauces and preparations therefor, mixed condiments and mixed seasonings; mustard flour and meal and prepared mustard including Curry paste, mayonnaise and salad dressings 140. 2104 Soups and broths and preparations therefor; homogenised composite food preparations 141. 2105 00 00 Ice cream and other edible ice, whether or not containing cocoa 142. 2106 Texturised vegetable proteins (soya bari), Bari made of pulses including mungodi and batters; Roasted Gram idli/dosa batter, chutney powder; Sweetmeats 143. Namkeens, bhujia, mixture, chabena and similar edible preparations 2106 90 in ready for consumption form, whether or not pre-packaged and labelled 144. 2106 90 91 Diabetic foods 145. 2106 Food preparations not elsewhere specified or included [other than (other than 21069020) pan masala] 146. 2201 Waters, including natural or artificial mineral waters and aerated waters, not containing added sugar or other sweetening matter nor flavoured 147. 2201 90 10 Ice and snow 148. 2202 99 Plant-based milk drinks, ready for direct consumption as beverages 149. 2202 99 10 Soya milk drinks, whether or not sweetened or flavoured 150. 2202 99 20 Fruit pulp or fruit juice based drinks [other than Carbonated Beverages of Fruit Drink or Carbonated Beverages with Fruit Juice] 151. 2202 99 30 Beverages containing milk [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 83 152. 2207 Ethyl alcohol supplied to Oil Marketing Companies or Petroleum refineries for blending with motor spirit (petrol) 153. 2301 Flours, meals and pellets, of meat or meat offal, of fish or of crustaceans, molluscs or other aquatic invertebrates, unfit for human consumption; greaves 154. 2302 Bran, sharps and other residues, whether or not in the form of pellets, derived from the sifting, milling or other working of cereals or of leguminous plants [other than aquatic feed including shrimp feed and prawn feed, poultry feed and cattle feed, including grass, hay and straw, supplement and additives, husk of pulses including chilka, concentrates including chuni or churi, khanda, wheat bran, de- oiled cake] 155. 2302 Rice bran (other than de-oiled rice bran) 156. 2303 Residues of starch manufacture and similar residues, beet-pulp, bagasse and other waste of sugar manufacture, brewing or distilling dregs and waste, whether or", "metadata": {"source": "gst_9_2025", "chunk_index": 2}}
{"id": "gst_9_2025_3", "text": "not in the form of pellets 157. 2304 Oil-cake and other solid residues, whether or not ground or in the form of pellets, resulting from the extraction of soyabean oil 158. 2305 Oil-cake and other solid residues, whether or not ground or in the form of pellets, resulting from the extraction of ground-nut oil 159. 2306 Oil-cake and other solid residues, whether or not ground or in the form of pellets, resulting from the extraction of vegetable or microbial fats or oils, other than those of heading 2304 or 2305 other than cottonseed oil cake and de-oiled rice bran 160. 2307 Wine lees; argol 161. 2309 Fish soluble paste 162. 2401 Tobacco leave 163. 2502 Unroasted iron pyrites 164. 2503 Sulphur of all kinds, other than sublimed sulphur, precipitated sulphur and colloidal sulphur 165. 2504 Natural graphite 166. 2505 Natural sands of all kinds, whether or not coloured, other than metal bearing sands of Chapter 26 167. 2506 Quartz (other than natural sands); quartzite, whether or not roughly trimmed or merely cut, by sawing or otherwise, into blocks or slabs of a rectangular (including square) shape 168. 2507 Kaolin and other kaolinic clays, whether or not calcined 169. 2508 Other clays (not including expanded clays of heading 6806), andalusite, kyanite and sillimanite, whether or not calcined; mullite; chamotte or dinas earths 170. 2509 Chalk 171. 2510 Natural calcium phosphates, natural aluminium calcium phosphates and phosphatic chalk 172. 2511 Natural barium sulphate (barytes); natural barium carbonate (witherite), whether or not calcined, other than barium oxide of heading 2816 173. 2512 Siliceous fossil meals (for example, kieselguhr, tripolite and diatomite) and similar siliceous earths, whether or not calcined, of an apparent specific gravity of 1 or less 174. 2513 Pumice stone; emery; natural corundum, natural garnet and other natural abrasives, whether or not heat-treated 175. 2514 Slate, whether or not roughly trimmed or merely cut, by sawing or otherwise, into blocks or slabs of a rectangular (including square) shape 176. 2515 [Except 2515 12 20, 2515 Ecaussine and other calcareous monumental or building stone (other 12 90] or 6802 than marble and travertine), alabaster, other than mirror polished stone which is ready to use 177. 2515 11 00 Marble and travertine, crude or roughly trimmed 178. 2515 12 10 Marble and travertine blocks 179. 2516 [Except 2516 11 00, Porphyry, basalt, sandstone and other monumental or building stone, 25161200] whether or not roughly trimmed or merely cut, by sawing or 84 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] otherwise, into blocks or slabs of a rectangular (including square) shape 180. 2516 11 00 Granite crude or roughly trimmed 181. 2516 Granite blocks 182. 2517 Pebbles, gravel, broken or crushed stone, of a kind commonly used for concrete aggregates, for road metalling or for railway or other ballast, shingle and flint, whether or not heat-treated; macadam of slag, dross or similar industrial waste, whether or not incorporating the materials cited in the first part of the heading; tarred macadam; granules, chippings and powder, of stones heading 2515 or 2516 whether or not heat-treated 183. 2518 Dolomite, whether or not calcined or sintered, including dolomite roughly trimmed or merely cut, by sawing or otherwise, into blocks or slabs of a rectangular (including square) shape 184. 2519 Natural magnesium carbonate (magnesite); fused magnesia; dead- burned (sintered) magnesia, whether or not containing small quantities of other oxides added before sintering; other magnesium oxide, whether or not pure 185. 2520 Gypsum; anhydrite; plasters (consisting of calcined gypsum or calcium sulphate) whether or not coloured, with or without small quantities of accelerators or retarders 186. 2521 Limestone flux; limestone and other calcareous stone, of a kind used for the manufacture of lime or cement. 187. 2522 Quicklime, slaked lime and hydraulic lime, other than calcium oxide and hydroxide of heading 2825 188. 2524 Asbestos 189. 2525 Mica, including splitting; mica waste. 190. 2526 Natural steatite, whether or not roughly trimmed or merely cut, by sawing or otherwise, into blocks or slabs of a rectangular (including square) shape; talc. 191. 2528 Natural borates and concentrates thereof (whether or not calcined), but not including borates separated from natural brine; natural boric acid containing not more than 85% of H3BO3 (calculated on dry weight) 192. 2529 Feldspar; leucite, nepheline and nepheline syenite; fluorspar 193. 2530 Mineral substances not elsewhere specified or included 194. 2611 Tungsten ores and concentrates 195. 2612 Uranium or thorium ores and concentrates 196. 2613 Molybdenum ores and concentrates 197. 2614 Titanium ores and concentrates 198. 2615 Niobium, tantalum, vanadium or zirconium ores and concentrates 199. 2616 Precious metal ores and concentrates 200. 2617 Other ores and concentrates 201. 2618 Granulated slag (slag sand) from the manufacture of iron or steel 202. 2619 Linz-Donawitz (LD) Slag 203. 2621 Fly Ash 204. 27 Bio-gas 205. 2704 Coke and semi coke of coal, of lignite or of peat, whether or not agglomerated; retort carbon 206. 2705 Coal gas, water gas, producer gas and similar gases, other than petroleum gases and other gaseous hydrocarbons 207. 2710 (a) Kerosene oil PDS, (b) The following bunker fuels for use in ships or vessels, namely, i. IFO 180 CST ii. IFO 380 CST iii. Marine Fuel 0.5% (FO) 208. 2711 12 00, 2711 13 00, 2711 Liquefied Propane and Butane mixture, Liquefied Propane, 19 10 Liquefied Butane and Liquefied Petroleum Gases (LPG) for supply to non-domestic exempted category (NDEC) customers by the Indian Oil Corporation Limited, Hindustan Petroleum Corporation Limited or Bharat Petroleum Corporation Limited [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 85 209. 2711 12 00 2711 13 00, 2711 Liquefied Propane and Butane mixture, Liquefied Propane, 19 10 Liquefied Butane and Liquefied Petroleum Gases (LPG) for supply to household domestic consumers 210. 28 Thorium oxalate, Enriched KBF4 (enriched potassium fluroborate), Enriched elemental boron, Nuclear fuel 211. 28 Anaesthetics, Potassium Iodate, Iodine, Steam 212. 2804 40 10 Medical grade oxygen 213. 2805 11 Nuclear grade sodium 214. 2807 Sulphuric Acid 215. 2808 Nitric acid 216. 2809 Fertilizer grade phosphoric acid 217. 2814 Ammonia 218. 2845 Heavy water and other nuclear fuels 219. 2847 Medicinal grade hydrogen peroxide 220. 2853 Compressed air 221. 28 or 38 Micronutrients, which are covered under serial number 1(g) of Schedule 1, Part (A) of the Fertilizer Control Order, 1985 and are manufactured by the manufacturers which are registered under the Fertilizer Control Order, 1985 222. 29 or 3808 93 Gibberellic acid 223. 2906 11 10 Natural Menthol 224. 2906 11 10, 30, 3301 Following goods from Natural Menthol namely:- a. Menthol and menthol crystals, b. Peppermint (Mentha Oil), c. Fractionated / de-terpenated mentha oil (DTMO) d. De-mentholised oil (DMO), e. Spearmint oil f. Mentha piperita oil 225. 30 Insulin, Cyclosporin, Desferrioxamine injection or deferiprone, Oral re-hydration salts 226. 30 or any Chapter All Drugs and medicines including their salts and esters and diagnostic test kits; formulations manufactured from bulk drugs [other than those specified at nil at S. No. 113 of notification No. 10/2025-Central Tax (Rate) dated 17th September, 2025] 227. 30 Diagnostic kits for detection of all types of hepatitis 228. 30 Medicaments (including veterinary medicaments) used in bio-chemic systems 229. 30 Medicaments (including those used in Ayurvedic, Unani, Siddha, Homeopathic or Bio-chemic", "metadata": {"source": "gst_9_2025", "chunk_index": 3}}
{"id": "gst_9_2025_4", "text": "systems), manufactured exclusively in accordance with the formulae described in the authoritative books specified in the First Schedule to the Drugs and Cosmetics Act, 1940 (23 of 1940) or Homeopathic Pharmacopoeia of India or the United States of America or the United Kingdom or the German Homeopathic Pharmacopoeia, as the case may be, and sold under the name as specified in such books or pharmacopoeia 230. 3001 Glands and other organs for organo-therapeutic uses, dried, whether or not powdered; extracts of glands or other organs or of their secretions for organo-therapeutic uses; heparin and its salts; other human or animal substances prepared for therapeutic or prophylactic uses, not elsewhere specified or included 231. 3002 Animal blood prepared for therapeutic, prophylactic or diagnostic uses; antisera and other blood fractions and modified immunological products, whether or not obtained by means of biotechnological processes; toxins, cultures of micro-organisms (excluding yeasts) and similar products; cell cultures whether or not modified 232. 3002, 3006 Animal or Human Blood Vaccines 233. 3003 Medicaments (excluding goods of heading 3002, 3005 or 3006) consisting of two or more constituents which have been mixed together for therapeutic or prophylactic uses, not put up in measured doses or in forms or packings for retail sale, including Ayurvedic, Unani, Siddha, homoeopathic or Bio-chemic systems medicaments 86 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 234. 3004 Medicaments (excluding goods of heading 3002, 3005 or 3006) consisting of mixed or unmixed products for therapeutic or prophylactic uses, put up in measured doses (including those in the form of transdermal administration systems) or in forms or packings for retail sale, including Ayurvedic, Unani, homoeopathic siddha or Bio-chemic systems medicaments, put up for retail sale 235. 3005 Wadding, gauze, bandages and similar articles (for example, dressings, adhesive plasters, poultices), impregnated or coated with pharmaceutical substances or put up in forms or packings for retail sale for medical, surgical, dental or veterinary purposes 236. 3006 Pharmaceutical goods specified in Note 4 to this Chapter i.e. Sterile surgical catgut, similar sterile suture materials (including sterile absorbable surgical or dental yarns) and sterile tissue adhesives for surgical wound closure; sterile laminaria and sterile laminaria tents; sterile absorbable surgical or dental haemostatics; sterile surgical or dental adhesion barriers, whether or not absorbable; Waste pharmaceuticals (other than contraceptives); Ostomy appliances including pouch or flange, stoma adhesive paste, barrier cream, irrigator kit, sleeves, belt, micro-pore tapes 237. 3101 All goods i.e. animal or vegetable fertilisers or organic fertilisers pre- packaged and labelled 238. 3102 Mineral or chemical fertilisers, nitrogenous, other than those which are clearly not to be used as fertilizers 239. 3103 Mineral or chemical fertilisers, phosphatic, other than those which are clearly not to be used as fertilizers 240. 3104 Mineral or chemical fertilisers, potassic, other than those which are clearly not to be used as fertilizers 241. 3105 Mineral or chemical fertilisers containing two or three of the fertilising elements nitrogen, phosphorus and potassium; other fertilisers; goods of this Chapter in tablets or similar forms or in packages of a gross weight not exceeding 10 kg; other than those which are clearly not to be used as fertilizers 242. 32 Wattle extract, quebracho extract, chestnut extract 243. 3202 Enzymatic preparations for pre-tanning 244. 3304 Talcum powder, Face powder 245. 3305 Hair oil, shampoo 246. 3306 Toothpaste 247. 3306 10 10 Tooth powder 248. 3306 20 00 Yarn used to clean between the teeth (Dental floss) 249. 3307 Shaving cream, shaving lotion, aftershave lotion 250. 3307 41 00 Agarbatti, lobhan, dhoop batti, dhoop, sambraani 251. 3401 Toilet Soap (other than industrial soap) in the form of bars, cakes, moulded pieces or shapes 252. 3402 Sulphonated castor oil, fish oil or sperm oil 253. 3406 Candles, tapers and the like 254. 3503 Gelatin (including gelatin in rectangular (including square) sheets, whether or not surface-worked or coloured) and gelatin derivatives; isinglass; other glues of animal origin, excluding casein glues of heading 3501 255. 3505 Dextrins and other modified starches (for example, pregelatinised or esterified starches); glues based on starches, or on dextrins or other modified starches 256. 3605 00 10 All goods 257. 3701 Photographic plates and film for x-ray for medical use 258. 3705 Photographic plates and films, exposed and developed, other than cinematographic film 259. 3706 Photographic plates and films, exposed and developed, whether or not incorporating sound track or consisting only of sound track, other than feature films 260. 3808 The following Bio-pesticides, namely - 1 Bacillus thuringiensis var. israelensis [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 87 2 Bacillus thuringiensis var. kurstaki 3 Bacillus thuringiensis var. galleriae 4 Bacillus sphaericus 5 Trichoderma viride 6 Trichoderma harzianum 7 Pseudomonas fluoresens 8 Beauveriabassiana 9 NPV of Helicoverpaarmigera 10 NPV of Spodopteralitura 11 Neem based pesticides 12 Cymbopogan 261. 3816 Dolomite ramming mix 262. 3818 Silicon wafers 263. 3822 All diagnostic kits or reagents including certified reference materials 264. 3826 Bio-diesel supplied to Oil Marketing Companies for blending with High Speed Diesel 265. 3926 Feeding bottles, Plastic beads 266. 4001 Natural rubber, balata, gutta-percha, guayule, chicle and similar natural gums, in primary forms or in plates, sheets or strip 267. 4004 00 00 Waste, parings or scrap of rubber (other than hard rubber) 268. 4007 Latex Rubber Thread 269. 4011 Rear Tractor tyres and rear tractor tyre tubes 270. 4011 30 00 New pneumatic tyres, of rubber of a kind used on aircraft 271. 4011 70 00 Tyre for tractors 272. 4011, 4013 Pneumatic tyres or inner tubes, of rubber, of a kind used on/in bicycles, cycle-rickshaws and three wheeled powered cycle rickshaws 273. 4013 90 49 Tube for tractor tyres 274. 4014 Nipples of feeding bottles 275. 4015 Surgical rubber gloves or medical examination rubber gloves 276. 4016 Rubber bands 277. 4017 Waste or scrap of hard rubber 278. 4101 Raw hides and skins of bovine (including buffalo) or equine animals (fresh, or salted, dried, limed, pickled or otherwise preserved, but not tanned, parchment-dressed or further prepared), whether or not dehaired or split 279. 4102 Raw skins of sheep or lambs (fresh, or salted, dried, limed, pickled or otherwise preserved, but not tanned, parchment-dressed or further prepared), whether or not with wool on or split 280. 4103 Other raw hides and skins (fresh, or salted, dried, limed, pickled or otherwise preserved, but not tanned, parchment-dressed or further prepared), whether or not dehaired or split 281. 4104 Tanned or crust hides and skins of bovine (including buffalo) or equine animals, without hair on, whether or not split, but not further prepared 282. 4105 Tanned or crust skins of sheep or lambs, without wool on, whether or not split, but not further prepared 283. 4106 Tanned or crust hides and skins of other animals, without wool or hair on, whether or not split, but not further prepared 284. 4107 Leather further prepared after tanning or crusting, including parchment-dressed leather, of bovine (including buffalo) or equine animals, without hair on, whether or not split, other than leather of heading 4114 285. 4112 Leather further prepared after tanning or crusting, including parchment-dressed leather, of sheep or lamb, without wool on, whether or not split, other than leather of heading 4114 286. 4113 Leather further prepared after tanning or crusting,", "metadata": {"source": "gst_9_2025", "chunk_index": 4}}
{"id": "gst_9_2025_5", "text": "including parchment-dressed leather, of other animals, without wool or hair on, whether or not split, other than leather of heading 4114 287. 4114 Chamois (including combination chamois) leather; patent leather and patent laminated leather; metallised leather 88 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 288. 4115 Composition leather with a basis of leather or leather fibre, in slabs, sheets or strip, whether or not in rolls; parings and other waste of leather or of composition leather, not suitable for the manufacture of leather articles; leather dust, powder and flour 289. 4202 22 20 Hand bags and shopping bags, of cotton 290. 4202 22 30 Hand bags and shopping bags, of jute 291. 4203 Gloves specially designed for use in sports 292. 44 or any The following goods, namely: — Chapter b. Cement Bonded Particle Board; c. Jute Particle Board; d. Rice Husk Board; e. Glass-fibre Reinforced Gypsum Board (GRG) f. Sisal-fibre Boards; g. Bagasse Board; and h. Cotton Stalk Particle Board i. Particle/fibre board manufactured from agricultural crop res idues 293. 44, 68, 83 Idols of wood, stone [including marble] and metals [other than those made of precious metals] 294. 4401 Wood in chips or particles; sawdust and wood waste and scrap, whether or not agglomerated in logs, briquettes, pellets or similar forms 295. 4404 Hoopwood; split poles; piles, pickets and stakes of wood, pointed but not sawn lengthwise; wooden sticks, roughly trimmed but not turned, bent or otherwise worked, suitable for the manufacture of walking- sticks, umbrellas, tool handles or the like 296. 4405 Wood wool; wood flour 297. 4406 Railway or tramway sleepers (cross-ties) of wood 298. 4408 Sheets for veneering (including those obtained by slicing laminated wood), for plywood or for similar laminated wood and other wood, sawn lengthwise, sliced or peeled, whether or not planed, sanded, spliced or end-jointed, of a thickness not exceeding 6 mm [for match splints] 299. 4409 Bamboo flooring 300. 4415 Packing cases, boxes, crates, drums and similar packings, of wood; cable-drums of wood; pallets, box pallets and other load boards, of wood; pallet collars of wood 301. 4416 Casks, barrels, vats, tubs and other coopers’ products and parts thereof, of wood, including staves 302. 4417 Tools, tool bodies, tool handles, broom or brush bodies and handles, of wood; boot or shoe lasts and trees, of wood 303. 4418 Bamboo wood building joinery 304. 4419 Tableware and Kitchenware of wood 305. 4420 Wood marquetry and inlaid wood; caskets and cases for jewellery or cutlery, and similar articles, of wood; statuettes and other ornaments, of wood; wooden articles of furniture not falling in Chapter 94 306. 4421 Other articles of wood; such as clothes hangers, Spools, cops, bobbins, sewing thread reels and the like of turned wood for various textile machinery, Match splints, Pencil slats, Parts of wood, namely oars, paddles and rudders for ships, boats and other similar floating structures, Parts of domestic decorative articles used as tableware and kitchenware [other than Wood paving blocks, articles of densified wood not elsewhere included or specified, Parts of domestic decorative articles used as tableware and kitchenware] 307. 4501 Natural cork, raw or simply prepared 308. 4502 00 00 Natural cork, debacked or roughly squared, or in rectangular (including square) blocks, plates, sheets or strip (including sharp- edged blanks for corks or stoppers) 309. 4503 Articles of natural cork such as Corks and Stoppers, Shuttlecock cork bottom 310. 4504 Agglomerated cork (with or without a binding substance) and articles [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 89 of agglomerated cork 311. 4601, 4602 Manufactures of straw, of esparto or of other plaiting materials; basketware and wickerwork 312. 4701 Mechanical wood pulp 313. 4703 Chemical wood pulp, soda or sulphate, other than dissolving grades 314. 4704 Chemical wood pulp, sulphite, other than dissolving grades 315. 4705 Wood pulp obtained by a combination of mechanical and chemical pulping processes 316. 4706 Pulps of fibres derived from recovered (waste and scrap) paper or paperboard or of other fibrous cellulosic material 317. 4707 Recovered waste or scrap of paper or paperboard 318. 48 Paper splints for matches, whether or not waxed, Asphaltic roofing sheets 319. 39, 48 Paper Sacks/Bags and bio-degradable bags 320. 4801 Newsprint, in rolls or sheets 321. 4817 30 Boxes, pouches, wallets and writing compendiums, of paper or paperboard, containing an assortment of paper stationery 322. 4819 10, 4819 20 Cartons, boxes and cases of, - (a) Corrugated paper or paper boards; or (b) Non-corrugated paper or paper board 323. 4823 Paper pulp moulded trays; Kites, Paper mache articles 324. 4901 Brochures, leaflets and similar printed matter, whether or not in single sheets 325. 5004 to 5006 Silk yarn 326. 5007 Woven fabrics of silk or of silk waste 327. 5104 Garneted stock of wool or of fine or coarse animal hair, shoddy wool 328. 5105 Wool and fine or coarse animal hair, carded or combed 329. 5106 to 5110 Yarn of wool or of animal hair 330. 5111 to 5113 Woven fabrics of wool or of animal hair 331. 5201 to 5203 Cotton and Cotton waste 332. 5204 Cotton sewing thread, whether or not put up for retail sale 333. 5205 to 5207 Cotton yarn [other than khadi yarn] 334. 5208 to 5212 Woven fabrics of cotton 335. 5301 All goods i.e. flax, raw or processed but not spun; flax tow and waste (including yarn waste and garneted stock) 336. 5302 True hemp (Cannabis sativa L), raw or processed but not spun; tow and waste of true hemp (including yarn waste and garneted stock) 337. 5303 All goods i.e. textile bast fibres [other than jute fibres, raw or processed but not spun]; tow and waste of these fibres (including yarn waste and garneted stock) 338. 5305 to 5308 All goods [other than coconut coir fibre] including yarn of flax, jute, other textile bast fibres, other vegetable textile fibres; paper yarn including coir pith compost pre-packaged and labelled 339. 5309 to 5311 Woven fabrics of other vegetable textile fibres, paper yarn 340. 5401 Sewing thread of manmade filaments, whether or not put up for retail sale 341. 5402, 5403, 5404, 5405, 5406 All goods including synthetic or artificial filament yarns 342. 5407, 5408 Woven fabrics of manmade textile materials 343. 5501, 5502 Synthetic or artificial filament tow 344. 5503, 5504, 5506, 5507 Synthetic or artificial staple fibres 345. 5505 Waste of manmade fibres 346. 5508 Sewing thread of manmade staple fibres, whether or not put up for retail sale 347. 5509, 5510, 5511 Yarn of manmade staple fibres 348. 5512 to 5516 Woven fabrics of manmade staple fibres 349. 5601 Wadding of textile materials and articles thereof; such as Absorbent cotton wool except cigarette filter rods 350. 5602 Felt, whether or not impregnated, coated, covered or laminated 351. 5603 Nonwovens, whether or not impregnated, coated, covered or laminated 90 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 352. 5604 Rubber thread and cord, textile covered; textile yarn, and strip and the like of heading 5404 or 5405, impregnated, coated, covered or sheathed with rubber or plastics 353. 5605 Metallised yarn, whether or not gimped, being textile yarn, or strip or the like of heading 5404 or 5405, combined with metal in", "metadata": {"source": "gst_9_2025", "chunk_index": 5}}
{"id": "gst_9_2025_6", "text": "the form of thread, strip or powder or covered with metal, including real zari thread (gold) and silver thread combined with textile thread, imitation zari thread or yarn known by any name in trade parlance 354. 5606 Gimped yarn, and strip and the like of heading 5404 or 5405, gimped (other than those of heading 5605 and gimped horsehair yarn); chenille yarn (including flock chenille yarn); loop wale-yarn 355. 5607 Twine, cordage, ropes and cables, whether or not plaited or braided and whether or not impregnated, coated, covered or sheathed with rubber or plastics including jute twine, coir cordage or ropes 356. 5608 Knotted netting of twine, cordage or rope; made up fishing nets and other made up nets, of textile materials 357. 5609 Articles of yarn, strip or the like of heading 5404 or 5405, twine, cordage, rope or cables, not elsewhere specified or included, products of coir 358. 5701 Carpets and other textile floor coverings, knotted, whether or not made up 359. 5702 Carpets and other textile floor coverings, woven, not tufted or flocked, whether or not made up, including ―Kelem‖, ―Schumacks‖, ―Karamanie‖ and similar hand-woven rugs 360. 5703 Carpets and other textile floor coverings (including Turf), tufted, whether or not made up 361. 5704 Carpets and other textile floor coverings, of felt, not tufted or flocked, whether or not made up 362. 5705 Other carpets and other textile floor coverings, whether or not made up; such as Mats and mattings including Bath Mats, where cotton predominates by weight, of Handloom, Cotton Rugs of handloom 363. 5702, 5703, 5705 Coir mats, matting, floor covering and handloom durries 364. 5801 All goods 365. 5802 Terry towelling and similar woven terry fabrics, other than narrow fabrics of heading 5806; tufted textile fabrics, other than products of heading 5703 366. 5803 Gauze, other than narrow fabrics of heading 5806 367. 5804 Tulles and other net fabrics, not including woven, knitted or crocheted fabrics; lace in the piece, in strips or in motifs, other than fabrics of headings 6002 to 6006 368. 5805 Hand-woven tapestries of the type Gobelins, Flanders, Aubusson, Beauvais and the like, and needle-worked tapestries (for example, petit point, cross stitch), whether or not made up 369. 5806 Narrow woven fabrics, other than goods of heading 5807; narrow fabrics consisting of warp without weft assembled by means of an adhesive (bolducs) 370. 5807 Labels, badges and similar articles of textile materials, in the piece, in strips or cut to shape or size, not embroidered 371. 5808 Braids in the piece; ornamental trimmings in the piece, without embroidery, other than knitted or crocheted; tassels, pompons and similar articles; saree fall 372. 5809 Woven fabrics of metal thread and woven fabrics of metallised yarn of heading 5605, of a kind used in apparel, as furnishing fabrics or for similar purposes, not elsewhere specified or included; such as Zari borders 373. 5809, 5810 Embroidery or zari articles, that is to say,- imi, zari, kasab, salma, dabka, chumki, gota, sitara, naqsi, kora, glass beads, badla, gizai 374. 5810 Embroidery in the piece, in strips or in motifs, Embroidered badges, motifs and the like 375. 5811 Quilted textile products in the piece, composed of one or more layers [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 91 of textile materials assembled with padding by stitching or otherwise, other than embroidery of heading 5810 376. 5901 Textile fabrics coated with gum or amylaceous substances, of a kind used for the outer covers of books or the like; tracing cloth; prepared painting canvas; buckram and similar stiffened textile fabrics of a kind used for hat foundations 377. 5902 Tyre cord fabric of high tenacity yarn of nylon or other polyamides, polyesters or viscose rayon 378. 5903 Textile fabrics impregnated, coated, covered or laminated with plastics, other than those of heading 5902 379. 5904 Linoleum, whether or not cut to shape; floor coverings consisting of a coating or covering applied on a textile backing, whether or not cut to shape 380. 5905 Textile wall coverings 381. 5906 Rubberised textile fabrics, other than those of heading 5902 382. 5907 Textile fabrics otherwise impregnated, coated or covered; painted canvas being theatrical scenery, studio back-cloths or the like 383. 5908 Textile wicks, woven, plaited or knitted, for lamps, stoves, lighters, candles or the like; incandescent gas mantles and tubular knitted gas mantle fabric therefor, whether or not impregnated 384. 5909 Textile hose piping and similar textile tubing, with or without lining, armour or accessories of other materials 385. 5910 Transmission or conveyor belts or belting, of textile material, whether or not impregnated, coated, covered or laminated with plastics, or reinforced with metal or other material 386. 5911 Textile products and articles, for technical uses, specified in Note 7 to this Chapter; such as Textile fabrics, felt and felt-lined woven fabrics, coated, covered or laminated with rubber, leather or other material, of a kind used for card clothing, and similar fabrics of a kind used for other technical purposes, including narrow fabrics made of velvet impregnated with rubber, for covering weaving spindles (weaving beams); Bolting cloth, whether or not made up; Felt for cotton textile industries, woven; Woven textiles felt, whether or not impregnated or coated, of a kind commonly used in other machines; Cotton fabrics and articles used in machinery and plant; Jute fabrics and articles used in machinery or plant; Textile fabrics of metalised yarn of a kind commonly used in paper making or other machinery; Straining cloth of a kind used in oil presses or the like, including that of human hair; Paper maker's felt, woven; Gaskets, washers, polishing discs and other machinery parts of textile articles 387. 60 Knitted or crocheted fabrics [All goods] 388. 61 Article of apparel and clothing accessories, knitted or crocheted, of sale value not exceeding Rs 2500 per piece 389. 62 Articles of apparel and clothing accessories, not knitted or crocheted, of sale value not exceeding Rs. 2500 per piece 390. 63 [other than 6305 32 00, Other made up textile articles, sets, of sale value not exceeding Rs. 6305 33 00, 6309] 2500 per piece 391. 6309 or 6310 Worn clothing and other worn articles; rags 392. 64 Footwear of sale value not exceeding Rs.2500 per pair 393. 6501 Textile caps 394. 6505 Hats (knitted/crocheted) or made up from lace or other textile fabrics 395. 6601 Umbrellas and sun umbrellas (including walking-stick umbrellas, garden umbrellas and similar umbrellas) 396. 6602 Whips, riding-crops and the like 397. 6602 00 00 Walking-sticks including seat sticks 398. 6603 Parts, trimmings and accessories of articles of heading 6601 or 6602 399. 6701 Skins and other parts of birds with their feathers or down, feathers, parts of feathers, down and articles thereof (other than goods of heading 0505 and worked quills and scapes) 400. 68 Sand lime bricks or Stone inlay work 401. 6802 Statues, statuettes, pedestals; high or low reliefs, crosses, figures of 92 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] animals, bowls, vases, cups, cachou boxes, writing sets, ashtrays, paper weights, artificial fruit and foliage, etc.; other ornamental goods essentially of stone 402. 6909 Pots, jars and similar articles of a kind used for the conveyance and packing of goods of", "metadata": {"source": "gst_9_2025", "chunk_index": 6}}
{"id": "gst_9_2025_7", "text": "ceramic 403. 6911 Tableware, kitchenware, other household articles and toilet articles, of porcelain or china 404. 6912 Tableware, kitchenware, other household articles and toilet articles, other than of porcelain or china 405. 6913 Statues and other ornamental articles 406. 7001 Cullet or other waste or scrap of glass 407. 7015 10 Glasses for corrective spectacles and flint buttons 408. 7018 Glass beads 409. 7020 Globes for lamps and lanterns, Founts for kerosene wick lamps, Glass chimneys for lamps and lanterns 410. 7310 or 7326 Mathematical boxes, geometry boxes and colour boxes 411. 7310, 7323, 7612, or 7615 Milk cans made of Iron, Steel, or Aluminium 412. 7317 Animal shoe nails 413. 7319 Sewing needles 414. 7321 Kerosene burners, kerosene stoves and wood burning stoves of iron or steel 415. 7321 or 8516 Solar cookers 416. 7323 Table, kitchen or other household articles of iron & steel; Utensils 417. 7418 Table, kitchen or other household articles of copper; Utensils 418. 7419 80 30 Brass Kerosene Pressure Stove 419. 7615 Table, kitchen or other household articles of aluminium; Utensils 420. 8306 Bells, gongs and the like, non-electric, of base metal; statuettes and other ornaments, of base metal; photograph, picture or similar frames, of base metal; mirrors of base metal; metal bidriware 421. 8401 Fuel elements (cartridges), non-irradiated, for nuclear reactors 422. 8407 10 00, 8411 Aircraft engines 423. 8408 Fixed Speed Diesel Engines of power not exceeding 15HP 424. 8408 20 20 Agricultural Diesel Engine of cylinder capacity exceeding 250 cc for Tractor 425. 8413, 8413 91 Hand pumps and parts thereof 426. 8413 81 90 Hydraulic Pumps for tractors 427. 8414 20 20 Other hand pumps 428. 8419 12 Solar water heater and system 429. 8420 Hand operated rubber roller 430. 8424 Nozzles for drip irrigation equipment or nozzles for sprinklers 431. 8424 Sprinklers; drip irrigation system including laterals; mechanical sprayers 432. 8432 Agricultural, horticultural or forestry machinery for soil preparation or cultivation; lawn or sports-ground rollers; Parts [8432 90] 433. 8433 Harvesting or threshing machinery, including straw or fodder balers; grass or hay mowers; parts thereof 434. 8436 Other agricultural, horticultural, forestry, poultry-keeping or bee- keeping machinery, including germination plant fitted with mechanical or thermal equipment; poultry incubators and brooders; parts thereof 435. 8452 Sewing machines, other than book-sewing machine of heading 8440; furniture, bases and covers specially designed for sewing machines; sewing machines needles and parts of sewing machines 436. 8479 Composting Machines 437. 84, 85 or 94 Following renewable energy devices and parts for their manufacture:- (a) Bio-gas plant; (b) Solar power-based devices; [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 93 (c) Solar power generator; (d) Wind mills, Wind Operated Electricity Generator (WOEG); (e) Waste to energy plants / devices; (f) Solar lantern / solar lamp; (g) Ocean waves/tidal waves energy devices/plants; (h) Photo voltaic cells, whether or not assembled in modules or made up into panels. Explanation:- If the goods specified in this entry are supplied, by a supplier, along with supplies of other goods and services, one of which being a taxable service specified in the entry at S. No. 38 of the Table mentioned in the notification No. 11/2017-Central Tax (Rate), dated 28th June, 2017 [G.S.R. 690(E)], the value of supply of goods for the purposes of this entry shall be deemed as seventy per cent. of the gross consideration charged for all such supplies, and the remaining thirty per cent. of the gross consideration charged shall be deemed as value of the said taxable service 438. 8504 Charger or charging station for Electrically operated vehicles 439. 8525 60 Two-way radio (Walkie talkie) used by defence, police and paramilitary forces etc. 440. 87 Fuel Cell Motor Vehicles including hydrogen vehicles based on fuel cell technology 441. 87 Electrically operated vehicles, including two and three wheeled electric vehicles. Explanation.- For the purposes of this entry, ―Electrically operated vehicles‖ means vehicles which are run solely on electrical energy derived from an external source or from one or more electrical batteries fitted to such road vehicles and shall include E- bicycles. 442. 8701 Tractors (except road tractors for semi-trailers of engine capacity more than 1800 cc) 443. 8708 Following parts of tractors namely: a. Rear Tractor wheel rim, b. tractor centre housing, c. tractor housing transmission, d. tractor support front axle 444. 8708 10 10 Bumpers and parts thereof for tractors 445. 8708 30 00 Brakes assembly and its parts thereof for tractors 446. 8708 40 00 Gear boxes and parts thereof for tractors 447. 8708 50 00 Transaxles and its parts thereof for tractors 448. 8708 70 00 Road wheels and parts and accessories thereof for tractors 449. 8708 91 00 (i) Radiator assembly for tractors and parts thereof (ii) Cooling system for tractor engine and parts thereof 450. 8708 92 00 Silencer assembly for tractors and parts thereof 451. 8708 93 00 Clutch assembly and its parts thereof for tractors 452. 8708 94 00 Steering wheels and its parts thereof for tractor 453. 8708 99 00 Hydraulic and its parts thereof for tractors 454. 8708 99 00 Fender, Hood, Wrapper, Grill, Side Panel, Extension Plates, Fuel Tank and parts thereof for tractors. 455. 8710 Tanks and other armoured fighting vehicles, motorised, whether or not fitted with weapons, and parts of such vehicles 456. 8712 Bicycles and other cycles (including delivery tricycles), not motorised 457. 8713 Carriages for disabled persons, whether or not motorised or otherwise mechanically propelled 458. 8714 Parts and accessories of bicycles and other cycles (including delivery tricycles), not motorised, of heading 8712 459. 8714 20 Parts and accessories of carriage for disabled persons 460. 8716 20 00 Self-loading or self-unloading trailers for agricultural purposes 461. 8716 80 Hand propelled vehicles (e.g. hand carts, rickshaws and the like); animal drawn vehicles 462. 88 or Any other Chapter Scientific and technical instruments, apparatus, equipment, accessories, parts, components, spares, tools, mock ups and modules, 94 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] raw material and consumables required for launch vehicles and satellites and payloads 463. 8802 Other aircraft (for example, helicopters, aeroplanes), other than for personal use 464. 8806 Unmanned aircraft 465. 8807 Parts of goods of heading 8802 or 8806 466. 8901 Cruise ships, excursion boats, ferry-boats, cargo ships, barges and similar vessels for the transport of persons or goods 467. 8902 Fishing vessels; factory ships and other vessels for processing or preserving fishery products 468. 8904 Tugs and pusher craft 469. 8905 Light-vessels, fire-floats, dredgers, floating cranes and other vessels the navigability of which is subsidiary to their main function; floating docks; floating or submersible drilling or production platforms 470. 8906 Other vessels, including warships and lifeboats other than rowing boats 471. 8907 Other floating structures (for example, rafts, tanks, coffer-dams, landing-stages, buoys and beacons) 472. Any chapter Parts of goods of headings 8901, 8902, 8904, 8905, 8906, 8907 473. 90 Coronary stents and coronary stent systems for use with cardiac catheters 474. 90 or any other Chapter Artificial kidney 475. 90 or any other Chapter Blood glucose monitoring system (Glucometer) and test strips 476. 90 or any other Chapter Patent Ductus Arteriosus / Atrial Septal Defect occlusion device 477. 90 or any other Chapter Parts of the following goods,", "metadata": {"source": "gst_9_2025", "chunk_index": 7}}
{"id": "gst_9_2025_8", "text": "namely: - (i) Crutches; (ii) Wheel chairs; (iii)Walking frames; (iv)Tricycles; (v)Braillers; and (vi) Artificial limbs 478. 90 or any other Chapter Assistive devices, rehabilitation aids and other goods for disabled, specified in List 1 appended to this Schedule 479. 90 or 84 Disposable sterilized dialyzer or micro barrier of artificial kidney 480. 9001 Contact lenses; Spectacle lenses 481. 9003 Frames and mountings for spectacles, goggles or the like, and parts thereof 482. 9004 Spectacles, corrective (including goggles for correcting vision) 483. 9018 Instruments and appliances used in medical, surgical, dental or veterinary sciences, including scientigraphic apparatus, other electro- medical apparatus and sight-testing instruments 484. 9019 Mechano-therapy appliances; massage apparatus; psychological aptitude-testing apparatus; ozone therapy, oxygen therapy, aerosol therapy, artificial respiration or other therapeutic respiration apparatus 485. 9020 Other breathing appliances and gas masks, excluding protective masks having neither mechanical parts nor replaceable filters 486. 9021 Orthopaedic appliances, such as crutches, surgical belts, and trusses; Splints and other fracture appliances; artificial parts of the body; other appliances which are worn or carried, or implanted in the body, to compensate for a defect or disability; intraocular lens [other than hearing aids] 487. 9022 Apparatus based on the use of X-rays or of alpha, beta or gamma radiations, for medical, surgical, dental or veterinary uses, including radiography or radiotherapy apparatus, X-ray tubes and other X-ray generators, high tension generators, control panels and desks, screens, examinations or treatment tables, chairs and the like 488. 9025 Thermometers for medical, surgical, dental or veterinary usage 489. 9027 Instruments and apparatus for medical, surgical, dental or veterinary uses, for physical or chemical analysis 490. 9403 Furniture wholly made of bamboo, cane or rattan 491. 9404 Coir products (except coir mattresses) 492. 9404 Products wholly made of quilted textile materials not exceeding Rs 2500 per piece [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 95 493. 9404 Cotton quilts of sale value not exceeding Rs. 2500 per piece 494. 9401 10 00 Aircraft seats 495. 9405 Hurricane lanterns, Kerosene lamp / pressure lantern, petromax, glass chimney, and parts thereof 496. 9503 Toy balloons made of natural rubber latex 497. 9503 Toys like tricycles, scooters, pedal cars etc. (including parts and accessories thereof) [other than electronic toys] 498. 9504 Playing cards, chess board, carom board and other board games, like ludo, etc. (other than Video game consoles and Machines) 499. 9506 Sports goods other than articles and equipment for general physical exercise 500. 9507 Fishing hooks 501. 9507 Fishing rods, and other line fishing tackle; fish landing nets, butterfly nets and similar nets; decoy birds (other than those of heading 9208 or 9705) and similar hunting or shooting requisites 502. 9601 Worked ivory, bone, tortoise shell, horn, antlers, corals, mother of pearl, and other animal carving material and articles of these materials, articles of coral (including articles obtained by moulding) 503. 9603 [other than 9603 10 00] Broomsticks (other than brooms consisting of twigs or other vegetable materials bound together, with or without handles) 504. 9603 21 00 Tooth brushes including dental-plate brushes 505. 9607 Slide fasteners and parts thereof 506. 9615 Combs, hair-slides and the like; hairpins, curling pins, curling grips, hair-curlers and the like, other than those of heading 8516, and parts thereof 507. 9619 00 30, 9619 00 40, or All goods 9619 00 90 508. 9701 Paintings, drawings and pastels, executed entirely by hand, other than drawings of heading 4906 and other than hand-painted or hand-decorated manufactured articles; collages, mosaics and similar decorative plaques 509. 9702 Original engravings, prints and lithographs 510. 9703 Original sculptures and statuary, in any material 511. 9704 Postage or revenue stamps, stamp-postmarks, first-day covers, postal stationery (stamped paper), and the like, used or unused, other than those of heading 4907 512. 9705 Collections and collectors' pieces of zoological, botanical, mineralogical, anatomical, historical, archaeological, paleontological, ethnographic or numismatic interest including numismatic coins 513. 9706 Antiques of an age exceeding one hundred years 514. 9804 All drugs or medicines including their salts and esters and diagnostic test kits and formulations intended for personal use [other than those specified at nil at S No. 113 of Notification No. 10/2025-Central Tax (Rate) dated 17th September, 2025] 515. Any chapter Rosaries, prayer beads or Hawan samagri 516. Any chapter Biomass briquettes or solid bio fuel pellets List 1 [See S. No. 478 of the Schedule I] (A) (1) Braille writers and braille writing instruments (2) Hand writing equipment Braille Frames, Slates, Writing Guides, Script Writing Guides, Styli, Braille Erasers (3) Canes, Electronic aids like the Sonic Guide (4) Optical, Environmental Sensors (5) Arithmetic aids like the Taylor Frame (arithmetic and algebra types), Cubarythm, Speaking or Braille calculator (6) Geometrical aids like combined Graph and Mathematical Demonstration Board, Braille Protractors, Scales, Compasses and Spar Wheels (7) Electronic measuring equipment, such as calipers, micrometers, comparators, gauges, gauge 96 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] blocks Levels, Rules, Rulers and Yardsticks (8) Drafting, Drawing aids, tactile displays (9) Specially adapted clocks and watches (B) (1) Wheel chairs falling under heading No. 87.13 of the First Schedule (2) Retro fitment kits for vehicles used by the disabled (C) Artificial electronic larynx and spares thereof (D) Artificial electronic ear (Cochlear implant) (E) (1) Talking books (in the form of cassettes, discs or other sound reproductions) and large-print books, braille embossers, talking calculators, talking thermometers (2) Equipment for the mechanical or the computerized production of braille and recorded material such as braille computer terminals and displays, electronic braille, transfer and pressing machines and stereo typing machines (3) Braille paper (4) All tangible appliances including articles, instruments, apparatus, specially designed for use by the blind (5) Aids for improving mobility of the blind such as electronic orientation and obstacle detection appliance and white canes (6) Technical aids for education, rehabilitation, vocational training and employment of the blind such as Braille typewriters, braille watches, teaching and learning aids, games and other instruments and vocational aids specifically adapted for use of the blind (7) Assistive listening devices, audiometers (8) External catheters, special jelly cushions to prevent bed sores, stair lift, urine collection bags (9) Instruments and implants for severely physically handicapped patients and joints replacement and spinal instruments and implants including bone cement. Schedule II – 9 % S. No. Chapter/Heading/Sub- Description of goods Heading/Tariff item (1) (2) (3) 1. 1702 Artificial honey, whether or not mixed with natural honey 2. 2207 Ethyl alcohol and other spirits, denatured, of any strength [other than ethyl alcohol supplied to Oil Marketing Companies or petroleum refineries for blending with motor spirit (petrol)] 3. 22071012 Spirits for industrial use 4. 2209 Vinegar and substitutes for vinegar obtained from acetic acid 5. 24041200 Products containing nicotine and intended for inhalation without combustion 6. 24049100, 24049200, Products for oral application or transdermal application or for 24049900 application otherwise than orally or transdermally, containing nicotine and intended to assist tobacco use cessation 7. 2515 12 20, 2515 12 90 Marble and travertine, other than blocks 8. 2516 12 00 Granite, other than blocks 9. 2523 Portland cement, aluminous cement, slag cement, super sulphate cement and similar hydraulic cements, whether or not coloured or in the form of clinkers 10. 2601 Iron ores and concentrates, including roasted iron", "metadata": {"source": "gst_9_2025", "chunk_index": 8}}
{"id": "gst_9_2025_9", "text": "pyrites 11. 2602 Manganese ores and concentrates, including ferruginous manganese ores and concentrates with a manganese content of 20% or more, calculated on the dry weight. 12. 2603 Copper ores and concentrates 13. 2604 Nickel ores and concentrates 14. 2605 Cobalt ores and concentrates 15. 2606 Aluminium ores and concentrates 16. 2607 Lead ores and concentrates 17. 2608 Zinc ores and concentrates 18. 2609 Tin ores and concentrates 19. 2610 Chromium ores and concentrates 20. 2619 Slag, dross (other than granulated slag), scalings and other waste from the manufacture of iron or steel, other than Linz-Donawitz (LD) slag 21. 2620 Slag, ash and residues (other than from the manufacture of iron or steel) [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 97 containing metals, arsenic or their compounds 22. 2621 Other slag and ash, including seaweed ash (kelp); ash and residues from the incineration of municipal waste [other than fly ash] 23. 2701 Coal; briquettes, ovoids and similar solid fuels manufactured from coal 24. 2702 Lignite, whether or not agglomerated, excluding jet 25. 2703 Peat (including peat litter), whether or not agglomerated 26. 2706 Tar distilled from coal, from lignite or from peat and other mineral tars, whether or not dehydrated or partially distilled, including reconstituted tars 27. 2707 Oils and other products of the distillation of high temperature coal tar; similar products in which the weight of the aromatic constituents exceeds that of the non-aromatic constituents, such as Benzole (benzene), Toluole (toluene), Xylole (xylenes), Naphthelene 28. 2708 Pitch and pitch coke, obtained from coal tar or from other mineral tars 29. 2710 Petroleum oils and oils obtained from bituminous minerals, other than petroleum crude; preparations not elsewhere specified or included, containing by weight 70% or more of petroleum oils or of oils obtained from bituminous minerals, these oils being the basic constituents of the preparations; waste oils; Avgas (other than kerosene PDS, petrol, diesel and ATF which are not in GST) 30. 2711 Petroleum gases and other gaseous hydrocarbons, such as Propane, Butanes, Ethylene, propylene, butylene and butadiene [Other than Liquefied Propane and Butane mixture, Liquefied Propane, Liquefied Butane and Liquefied Petroleum Gases (LPG) for supply to household domestic consumers or to non-domestic exempted category (NDEC) customers by the Indian Oil Corporation Limited, Hindustan petroleum Corporation Limited or Bharat Petroleum Corporation Limited] 31. 2712 Petroleum jelly; paraffin wax, micro-crystalline petroleum wax, slack wax, ozokerite, lignite wax, peat wax, other mineral waxes, and similar products obtained by synthesis or by other processes, whether or not coloured 32. 2713 Petroleum coke, petroleum bitumen and other residues of petroleum oils or of oils obtained from bituminous minerals 33. 2714 Bitumen and asphalt, natural; bituminous or oil shale and tar sands; asphaltites and asphaltic rocks 34. 2715 Bituminous mixtures based on natural asphalt, on natural bitumen, on petroleum bitumen, on mineral tar or on mineral tar pitch (for example, bituminous mastics, cut-backs) 35. 28 All inorganic chemicals [other than those specified in notification No.10/2025- Central Tax (Rate) dated 17th September 2025 or other Schedules of this notification] 36. 29 All organic chemicals other than giberellic acid 37. 2906 11 90 Goods other than Natural Menthol 38. 29061190, 30, 3301 Following goods made from other than natural menthol, namely:- a. Menthol and menthol crystals, b. Peppermint (Mentha Oil) c. Fractionated / de-terpenated mentha oil (DTMO) d. De-mentholised oil (DMO) e. Spearmint oil f. Mentha piperita oil 39. 3102 Mineral or chemical fertilisers, nitrogenous, which are clearly not to be used as fertilizers 40. 3103 Mineral or chemical fertilisers, phosphatic, which are clearly not to be used as fertilizers 41. 3104 Mineral or chemical fertilisers, potassic, which are clearly not to be used as fertilizers 42. 3105 Mineral or chemical fertilisers containing two or three of the fertilising elements nitrogen, phosphorus and potassium; other fertilisers; goods of this Chapter in tablets or similar forms or in packages of a gross weight not exceeding 10 kg, which are clearly not to be used as fertilizers 43. 3201 Tanning extracts of vegetable origin; tannins and their salts, ethers, 98 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] esters and other derivatives (other than Wattle extract, quebracho extract, chestnut extract) 44. 3202 Synthetic organic tanning substances; inorganic tanning substances; tanning preparations, whether or not containing natural tanning substances (other than Enzymatic preparations for pre-tanning) 45. 3203 Colouring matter of vegetable or animal origin (including dyeing extracts but excluding animal black), whether or not chemically defined; preparations as specified in Note 3 to this Chapter based on colouring matter of vegetable or animal origin 46. 3204 Synthetic organic colouring matter, whether or not chemically defined; preparations as specified in Note 3 to this Chapter based on synthetic organic colouring matter; synthetic organic products of a kind used as fluorescent brightening agents or as luminophores, whether or not chemically defined 47. 3205 Colour lakes; preparations as specified in Note 3 to this Chapter based on colour lakes 48. 3206 Other colouring matter; preparations as specified in Note 3 to this Chapter, other than those of heading 32.03, 32.04 or 32.05; inorganic products of a kind used as luminophores, whether or not chemically defined 49. 3207 Prepared pigments, prepared opacifiers and prepared colours, vitrifiable enamels and glazes, engobes (slips), liquid lustres and similar preparations of a kind used in the ceramic, enamelling or glass industry; glass frit and other glass, in the form of powder, granules or flakes 50. 3208 Paints and varnishes (including enamels and lacquers) based on synthetic polymers or chemically modified natural polymers, dispersed or dissolved in a non-aqueous medium; solutions as defined in Note 4 to this Chapter 51. 3209 Paints and varnishes (including enamels and lacquers) based on synthetic polymers or chemically modified natural polymers, dispersed or dissolved in an aqueous medium 52. 3210 Other paints and varnishes (including enamels, lacquers and distempers); prepared water pigments of a kind used for finishing leather 53. 3211 00 00 Prepared driers 54. 3212 Pigments (including metallic powders and flakes) dispersed in non- aqueous media, in liquid or paste form, of a kind used in the manufacture of paints (including enamels); stamping foils; dyes and other colouring matter put up in forms or packings for retail sale 55. 3213 Artists’, students’ or signboard painters’ colours, modifying tints, amusement colours and the like, in tablets, tubes, jars, bottles, pans or in similar forms or packings 56. 3214 Glaziers’ putty, grafting putty, resin cements, caulking compounds and other mastics; painters’ fillings; non- refractory surfacing preparations for facades, indoor walls, floors, ceilings or the like 57. 3215 All Goods, including printing ink, writing or drawing ink and other inks, whether or not concentrated or solid, fountain pen ink, ball pen ink 58. 3301 Essential oils (terpeneless or not), including concretes and absolutes; resinoids; extracted oleoresins; concentrates of essential oils in fats, in fixed oils, in waxes or the like, obtained by enfleurage or maceration; terpenic by-products of the deterpenation of essential oils; aqueous distillates and aqueous solutions of essential oils such as essential oils of citrus fruit, essential oils other than those of citrus fruit such as eucalyptus oil, etc., flavouring essences all types (including those for liquors), attars of all kinds in fixed oil bases 59. 3302 Mixtures of", "metadata": {"source": "gst_9_2025", "chunk_index": 9}}
{"id": "gst_9_2025_10", "text": "odoriferous substances and mixtures (including alcoholic solutions) with a basis of one or more of these substances, of a kind used as raw materials in industry; other preparations based on odoriferous substances, of a kind used for the manufacture of beverages such as synthetic perfumery compounds [other than natural menthol and goods made from natural menthol i.e menthol and menthol crystals, Peppermint (Mentha Oil), Fractionated / de-terpenated mentha oil [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 99 (DTMO), De-mentholised oil (DMO), Spearmint oil, Mentha piperita oil] 60. 3303 Perfumes and toilet waters 61. 3304 Beauty or make-up preparations and preparations for the care of the skin (other than medicaments) including sunscreen or sun tan preparations; manicure or pedicure preparations [other than kajal, kumkum, bindi, sindur, alta, talcum powder and face powder] 62. 3305 Preparations for use on the hair [other than mehendi paste in cones, hair oil, shampoo] 63. 3306 Preparations for oral or dental hygiene, including denture fixative pastes and powders in individual retail packages [other than tooth powder, tooth paste and yarn used to clean between the teeth (dental floss)] 64. 3307 Pre-shave, shaving or after-shave preparations, personal deodorants, bath preparations, depilatories and other perfumery, cosmetic or toilet preparations, not elsewhere specified or included; prepared room deodorisers, whether or not perfumed or having disinfectant properties [other than shaving cream, shaving lotion and aftershave lotion] 65. 3307 41 00 Odoriferous preparations which operate by burning [other than agarbattis, lobhan, dhoop batti, dhoop, sambhrani] 66. 3401 Soap; organic surface-active products and preparations for use as soap, in the form of cakes, moulded pieces or shapes, whether or not containing soap[other than toilet soap in the form of bars, cakes, moulded pieces or shapes]; organic surface active products and preparations for washing the skin, in the form of liquid or cream and put up for retail sale, whether or not containing soap; paper, wadding, felt and nonwovens, impregnated, coated or covered with soap or detergent 67. 3402 Organic surface-active agents (other than soap); surface-active preparations, washing preparations (including auxiliary washing preparations) and cleaning preparations, whether or not containing soap, other than those of heading 3401 [other than Sulphonated castor oil, fish oil or sperm oil] 68. 3403 Lubricating preparations (including cutting-oil preparations, bolt or nut release preparations, anti-rust or anti-corrosion preparations and mould release preparations, based on lubricants) and preparations of a kind used for the oil or grease treatment of textile materials, leather, furskins or other materials, but excluding preparations containing, as basic constituents, 70% or more by weight of petroleum oils or of oils obtained from bituminous minerals 69. 3404 Artificial waxes and prepared waxes 70. 3405 Polishes and creams, for footwear, furniture, floors, coachwork, glass or metal, scouring pastes and powders and similar preparations (whether or not in the form of paper, wadding, felt, nonwovens, cellular plastics or cellular rubber, impregnated, coated or covered with such preparations), excluding waxes of heading 3404 71. 3407 Modelling pastes, including those put up for children's amusement; Preparations known as ―dental wax‖ or as ―dental impression compounds‖, put up in sets, in packings for retail sale or in plates, horseshoe shapes, sticks or similar forms; other preparations for use in dentistry, with a basis of plaster (of calcined gypsum or calcium sulphate) 72. 3501 Casein, caseinates and other casein derivatives; casein glues 73. 3502 Albumins (including concentrates of two or more whey proteins, containing by weight more than 80% whey proteins, calculated on the dry matter), albuminates and other albumin derivatives 74. 3504 Peptones and their derivatives; other protein substances and their derivatives, not elsewhere specified or included; hide powder, whether or not chromed; including Isolated soya protein 75. 3506 Prepared glues and other prepared adhesives, not elsewhere specified or included; products suitable for use as glues or adhesives, put up for retail sale as glues or adhesives, not exceeding a net weight of 1 kg 76. 3507 Enzymes, prepared enzymes 100 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 77. 3601 Propellant powders 78. 3602 Prepared explosives, other than propellant powders, such as industrial explosives 79. 3603 Safety fuses; detonating cords; percussion or detonating caps; igniters; electric detonators 80. 3604 Fireworks, signalling flares, rain rockets, fog signals and other pyrotechnic articles 81. 3606 Ferro-cerium and other pyrophoric alloys in all forms; articles of combustible materials as specified in Note 2 to this Chapter; such as liquid or liquefied-gas fuels in containers of a kind used for filling or refilling cigarette or similar lighters 82. 3701 Photographic plates and film in the flat, sensitised, unexposed, of any material other than paper, paperboard or textiles; instant print film in the flat, sensitised, unexposed, whether or not in packs; such as Instant print film, Cinematographic film (other than for x-ray for Medical use) 83. 3702 Photographic film in rolls, sensitised, unexposed, of any material other than paper, paperboard or textiles; instant print film in rolls, sensitised, unexposed 84. 3703 Photographic paper, paperboard and textiles, sensitised, unexposed 85. 3704 Photographic plates, film, paper, paperboard and textiles, exposed but not developed 86. 3706 Cinematographic film, exposed and developed, whether or not incorporating sound track or consisting only of sound track 87. 3707 Chemical preparations for photographic uses (other than varnishes, glues, adhesives and similar preparations); unmixed products for photographic uses, put up in measured portions or put up for retail sale in a form ready for use 88. 3801 Artificial graphite; colloidal or semi-colloidal graphite; preparations based on graphite or other carbon in the form of pastes, blocks, plates or other semi-manufactures 89. 3802 Activated carbon; activated natural mineral products; animal black, including spent animal black 90. 3803 00 00 Tall oil, whether or not refined 91. 3804 Residual lyes from the manufacture of wood pulp, whether or not concentrated, desugared or chemically treated, including lignin sulphonates, but excluding tall oil of heading 3803 92. 3805 Gum, wood or sulphate turpentine and other terpenic oils produced by the distillation or other treatment of coniferous woods; crude dipentene; sulphite turpentine and other crude para-cymene; pine oil containing alpha-terpineol as the main constituent 93. 3806 Rosin and resin acids, and derivatives thereof; rosin spirit and rosin oils; run gums 94. 3807 Wood tar; wood tar oils; wood creosote; wood naphtha; vegetable pitch; brewers' pitch and similar preparations based on rosin, resin acids or on vegetable pitch 95. 3808 Insecticides, rodenticides, fungicides, herbicides, anti-sprouting products and plant-growth regulators, disinfectants and similar products [other than bio-pesticides mentioned against S. No. 260 of Schedule –I] 96. 3809 Finishing agents, dye carriers to accelerate the dyeing or fixing of dyestuffs and other products and preparations (for example, dressings and mordants), of a kind used in the textile, paper, leather or like industries, not elsewhere specified or included 97. 3810 Pickling preparations for metal surfaces; fluxes and other auxiliary preparations for soldering, brazing or welding; soldering, brazing or welding powders and pastes consisting of metal and other materials; preparations of a kind used as cores or coatings for welding electrodes or rods 98. 3811 Anti-knock preparations, oxidation inhibitors, gum inhibitors, viscosity improvers, anti-corrosive preparations and other prepared additives, for mineral oils (including gasoline) or for other liquids used for the same purposes as mineral oils [भाग II—खण् ड 3(i)] भारत", "metadata": {"source": "gst_9_2025", "chunk_index": 10}}
{"id": "gst_9_2025_11", "text": "का राजपत्र : ऄसाधारण 101 99. 3812 Prepared rubber accelerators; compound plasticisers for rubber or plastics, not elsewhere specified or included; anti-oxidising preparations and other compound stabilisers for rubber or plastics such as vulcanizing agents for rubber 100. 3813 Preparations and charges for fire-extinguishers; charged fire extinguishing grenades 101. 3814 Organic composite solvents and thinners, not elsewhere specified or included; prepared paint or varnish removers 102. 3815 Reaction initiators, reaction accelerators and catalytic preparations, not elsewhere specified or included 103. 3816 Refractory cements, mortars, concretes and similar compositions, other than products of heading 3801 [other than dolomite ramming mix] 104. 3817 Mixed alkylbenzenes and mixed alkylnaphthalenes, other than those of heading 2707 or 2902 105. 3818 Chemical elements doped for use in electronics, in the form of discs, wafers or similar forms; chemical compounds doped for use in electronics [other than silicon wafers] 106. 3819 Hydraulic brake fluids and other prepared liquids for hydraulic transmission, not containing or containing less than 70% by weight of petroleum oils or oils obtained from bituminous minerals 107. 3820 Anti-freezing preparations and prepared de-icing fluids 108. 3821 Prepared culture media for development or maintenance of micro- organisms (including viruses and the like) or of plant, human or animal cells 109. 3823 Industrial monocarboxylic fatty acids, acid oils from refining; industrial fatty alcohols 110. 3824 Prepared binders for foundry moulds or cores; chemical products and preparations of the chemical or allied industries (including those consisting of mixtures of natural products), not elsewhere specified or included 111. 3825 Residual products of the chemical or allied industries, not elsewhere specified or included [except municipal waste; sewage sludge; other wastes specified in Note 6 to this Chapter.] 112. 3826 Biodiesel (other than biodiesel supplied to Oil Marketing Companies for blending with High Speed Diesel) 113. 3827 Mixtures containing halogenated derivatives of methane, ethane or propane, not elsewhere specified or included 114. 3901 to 3913 All goods i.e. polymers; Polyacetals, other polyethers, epoxide resins, polycarbonates, alkyd resins, polyallyl esters, other polyesters; polyamides; Amino-resins, phenolic resins and polyurethanes; silicones; Petroleum resins, coumarone-indene resins, polyterpenes, polysulphides, polysulphones and other products specified in Note 3 to this Chapter, not elsewhere specified or included; Cellulose and its chemical derivatives, not elsewhere specified or included; Natural polymers (for example, alginic acid) and modified natural polymers (for example, hardened proteins, chemical derivatives of natural rubber), not elsewhere specified or included; in primary forms 115. 3914 Ion exchangers based on polymers of headings 3901 to 3913, in primary forms 116. 3915 Waste, Parings and Scrap, of Plastics 117. 3916 Monofilament of which any cross-sectional dimension exceeds 1 mm, rods, sticks and profile shapes, whether or not surface-worked but not otherwise worked, of plastics 118. 3917 Tubes, pipes and hoses, and fittings therefor, of plastics 119. 3918 Floor coverings of plastics, whether or not self-adhesive, in rolls or in the form of tiles; wall or ceiling coverings of plastics, as defined in Note 9 to this Chapter 120. 3919 Self-adhesive plates, sheets, film, foil, tape, strip and other flat shapes, of plastics, whether or not in rolls 121. 3920 Other plates, sheets, film, foil and strip, of plastics, non-cellular and not reinforced, laminated, supported or similarly combined with other 102 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] materials 122. 3921 Other plates, sheets, film, foil and strip, of plastics 123. 3922 Baths, shower-baths, sinks, wash-basins, bidets, lavatory pans, seats and covers, flushing cisterns and similar sanitary ware of plastics 124. 3923 Articles for the conveyance or packing of goods, of plastics; stoppers, lids, caps and other closures, of plastics 125. 3924 Tableware, kitchenware, other household articles and hygienic or toilet articles, of plastics 126. 3925 Builders’ ware of plastics, not elsewhere specified or included 127. 3926 Other articles of plastics and articles of other materials of headings 3901 to 3914 [other than bangles of plastic, plastic beads and feeding bottles] 128. 4002 Synthetic rubber and factice derived from oils, in primary forms or in plates, sheets or strip; mixtures of any product of heading 4001 with any product of this heading, in primary forms or in plates, sheets or strip; such as Latex, styrene butadiene rubber, butadiene rubber (BR), Isobutene-isoprene (butyl) rubber (IIR), Ethylene-propylene-Non- conjugated diene rubber (EPDM) 129. 4003 Reclaimed rubber in primary forms or in plates, sheets or strip 130. 4004 Powders and granules obtained from waste, parings and scrap of rubber (other than hard rubber) 131. 4005 Compounded rubber, unvulcanised, in primary forms or in plates, sheets or strip 132. 4006 Other forms (for example, rods, tubes and profile shapes) and articles (for example, discs and rings), of unvulcanised rubber 133. 4007 Vulcanised rubber thread and cord, other than latex rubber thread 134. 4008 Plates, sheets, strip, rods and profile shapes, of vulcanised rubber other than hard rubber 135. 4009 Tubes, pipes and hoses, of vulcanised rubber other than hard rubber, with or without their fittings (for example, joints, elbows, flanges) 136. 4010 Conveyor or transmission belts or belting, of vulcanised rubber 137. 4011 New pneumatic tyres, of rubber (other than of a kind used on/in bicycles, cycle-rickshaws and three wheeled powered cycle rickshaws; rear tractor tyres; and of a kind used on aircraft) 138. 4012 Retreaded or used pneumatic tyres of rubber; solid or cushion tyres, tyre treads and tyre flaps, of rubber 139. 4013 Inner tubes of rubber (other than of a kind used on/in bicycles, cycle- rickshaws and three wheeled powered cycle rickshaws; and Rear Tractor tyre tubes) 140. 4014 Hygienic or pharmaceutical articles (including teats), of vulcanised rubber other than hard rubber, with or without fittings of hard rubber; such as Hot water bottles, Ice bags [other than Sheath contraceptives, Rubber contraceptives, male (condoms), Rubber contraceptives, female (diaphragms), such as cervical caps] 141. 4015 Articles of apparel and clothing accessories (including gloves, mittens and mitts), for all purposes, of vulcanised rubber other than hard rubber [other than Surgical gloves] 142. 4016 Other articles of vulcanised rubber other than hard rubber [other than erasers, rubber bands] 143. 4017 Hard rubber (for example ebonite) in all forms, other than waste and scrap; articles of hard rubber 144. 4201 Saddlery and harness for any animal (including traces, leads, knee pads, muzzles, saddle cloths, saddle bags, dog coats and the like), of any material 145. 4202 Trunks, suit-cases, vanity-cases, executive-cases, brief-cases, school satchels, spectacle cases, binocular cases, camera cases, musical instrument cases, gun cases, holsters and similar containers; travelling bags, insulated food or beverages bags, toilet bags, rucksacks, handbags, shopping bags, wallets, purses, map-cases, cigarette-cases, tobacco- pouches, tool bags, sports bags, bottle-cases, jewellery boxes, powder- boxes, cutlery cases and similar containers, of leather, of sheeting of plastics, of textile materials, of vulcanised fibre or of paperboard, or [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 103 wholly or mainly covered with such materials or with paper [other than handbags and shopping bags, of cotton or jute] 146. 4203 Articles of apparel and clothing accessories, of leather or of composition leather [other than gloves specially designed for use in sports] 147. 4205 Other articles of leather or of composition leather 148. 4206 Articles of gut (other than silk-worm gut), of goldbeater's skin, of bladders or of tendons 149. 4301 Raw furskins (including", "metadata": {"source": "gst_9_2025", "chunk_index": 11}}
{"id": "gst_9_2025_12", "text": "heads, tails, paws and other pieces or cuttings, suitable for furriers' use), other than raw hides and skins of heading 4101, 4102 or 4103. 150. 4302 Tanned or dressed furskins (including heads, tails, paws and other pieces or cuttings), unassembled, or assembled (without the addition of other materials) other than those of heading 4303 151. 4303 Articles of apparel, clothing accessories and other articles of furskin 152. 4304 Artificial fur and articles thereof 153. 4403 Wood in the rough 154. 4407 Wood sawn or chipped 155. 4408 Sheets for veneering (including those obtained by slicing laminated wood), for plywood or for similar laminated wood and other wood, sawn lengthwise, sliced or peeled, whether or not planed, sanded, spliced or end-jointed, of a thickness not exceeding 6 mm [other than for match splints] 156. 4409 Wood (including strips and friezes for parquet flooring, not assembled) continuously shaped (tongued, grooved, rebated, chamfered, v-jointed, beaded, moulded, rounded or the like) along any of its edges or faces, whether or not planed, sanded or end-jointed [other than bamboo flooring] 157. 4410 Particle board, Oriented Strand Board and similar board (for example, wafer board) of wood or other ligneous materials, whether or not agglomerated with resins or other organic binding substances, other than specified boards 158. 4411 Fibre board of wood or other ligneous materials, whether or not bonded with resins or other organic substances, other than specified boards 159. 4412 Plywood, veneered panels and similar laminated wood 160. 4413 Densified wood, in blocks, plates, strips, or profile shapes 161. 4414 Wooden frames for paintings, photographs, mirrors or similar objects 162. 4418 Builders’ joinery and carpentry of wood, including cellular wood panels, assembled flooring panels, shingles and shakes [other than bamboo wood building joinery] 163. 4421 Wood paving blocks, articles of densified wood not elsewhere included or specified, Parts of domestic decorative articles used as tableware and kitchenware 164. 44 or any Chapter Resin bonded bamboo mat board, with or without veneer in between; Bamboo flooring tiles 165. 4501 Waste cork; crushed, granulated or ground cork 166. 4702 Chemical wood pulp, dissolving grades 167. 4802 Uncoated paper and paperboard, of a kind used for writing, printing or other graphic purposes, and non-perforated punch-cards and punch tape paper, in rolls or rectangular (including square) sheets, of any size, other than paper of heading 4801 or 4803; [other than uncoated paper and paperboard for exercise book, graph book, laboratory note book and notebooks only] 168. 4803 Toilet or facial tissue stock, towel or napkin stock and similar paper of a kind used for household or sanitary purposes, cellulose wadding and webs of cellulose fibres, whether or not creped, crinkled, embossed, perforated, surface-coloured, surface-decorated or printed, in rolls or sheets 169. 4804 Uncoated kraft paper and paperboard, in rolls or sheets, other than that of heading 4802 or 4803 170. 4805 Other uncoated paper and paperboard, in rolls or sheets, not further worked or processed than as specified in Note 3 to this Chapter 104 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 171. 4806 Vegetable parchment, tracing papers and other glazed transparent or translucent papers, in rolls or sheets 172. 4806 20 00 Greaseproof papers 173. 4806 40 10 Glassine papers 174. 4807 Composite paper and paperboard (made by sticking flat layers of paper or paperboard together with an adhesive), not surface-coated or impregnated, whether or not internally reinforced, in rolls or sheets 175. 4808 Paper and paperboard, corrugated (with or without glued flat surface sheets), creped, crinkled, embossed or perforated, in rolls or sheets, other than paper of the kind described in heading 4803 176. 4809 Carbon paper, self-copy paper and other copying or transfer papers (including coated or impregnated paper for duplicator stencils or offset plates), whether or not printed, in rolls or sheets 177. 4810 Paper and paperboard, coated on one or both sides with kaolin (China clay) or other inorganic substances, with or without a binder, and with no other coating, whether or not surface-coloured, surface-decorated or printed, in rolls or rectangular (including square) sheets of any size 178. 4811 Paper, paperboard, cellulose wadding and webs of cellulose fibres, coated, impregnated, covered, surface-coloured, surface-decorated or printed, in rolls or rectangular (including square) sheets, of any size, other than goods of the kind described in heading 4803, 4809 or 4810 179. 4812 Filter blocks, slabs and plates, of paper pulp 180. 4813 Cigarette paper, whether or not cut to size or in the form of booklets or tubes 181. 4814 Wall paper and similar wall coverings; window transparencies of paper 182. 4816 Carbon paper, self-copy paper and other copying or transfer papers (other than those of heading 4809), duplicator stencils and offset plates, of paper, whether or not put up in boxes 183. 4817 [Except 4817 30] Envelopes, letter cards, plain postcards and correspondence cards, of paper or paperboard; [other than boxes, pouches, wallets and writing compendiums, of paper or paperboard, containing an assortment of paper stationery including writing blocks] 184. 4818 Toilet paper and similar paper, cellulose wadding or webs of cellulose fibres, of a kind used for household or sanitary purposes, in rolls of a width not exceeding 36 cm, or cut to size or shape; handkerchiefs, cleansing tissues, towels, table cloths, serviettes, napkins for babies, tampons, bed sheets and similar household, sanitary or hospital articles, articles of apparel and clothing accessories, or paper pulp, paper, cellulose wadding or webs of cellulose fibres 185. 4819 (except 4819 10, 4819 All Goods (other than Cartons, boxes and cases of, – 20) (a) corrugated paper or paper board; or (b) non-corrugated paper or paper board) 186. 4820 Registers, account books, order books, receipt books, letter pads, memorandum pads, diaries and similar articles, blotting-pads, binders (loose-leaf or other), folders, file covers, manifold business forms, interleaved carbon sets and other articles of stationary, of paper or paperboard; and book covers, of paper or paperboard [other than note books and exercise books] 187. 4821 Paper or paperboard labels of all kinds, whether or not printed 188. 4822 Bobbins, spools, cops and similar supports of paper pulp, paper or paperboard (whether or not perforated or hardened) 189. 4823 Other paper, paperboard, cellulose wadding and webs of cellulose fibres, cut to size or shape; other articles of paper pulp, paper, paperboard, cellulose wadding or webs of cellulose fibres [other than paper pulp moulded trays, Braille paper, Kites, Paper mache articles] 190. 4906 00 00 Plans and drawings for architectural, engineering, industrial, commercial, topographical or similar purposes, being originals drawn by hand; hand-written texts; photographic reproductions on sensitised paper and carbon copies of the foregoing 191. 4907 Unused postage, revenue or similar stamps of current or new issue in the country in which they have, or will have, a recognised face value; [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 105 stamp-impressed paper; banknotes; cheque forms; stock, share or bond certificates and similar documents of title (other than Duty Credit Scrips); Cheques, loose or in book form 192. 4908 Transfers (decalcomanias). 193. 4909 Printed or illustrated postcards; printed cards bearing personal greetings, messages or announcements, whether or not illustrated, with or without envelopes or trimmings. 194. 4910 Calendars of any kind, printed, including calendar blocks. 195. 4911 Other", "metadata": {"source": "gst_9_2025", "chunk_index": 12}}
{"id": "gst_9_2025_13", "text": "printed matter, including printed pictures and photographs; such as Trade advertising material, Commercial catalogues and the like, printed Posters, Commercial catalogues, Printed inlay cards, Pictures, designs and photographs, Plan and drawings for architectural engineering, industrial, commercial, topographical or similar purposes reproduced with the aid of computer or any other devices. 196. 5601 22 00 Cigarette Filter rods 197. 61 Articles of apparel and clothing accessories, knitted or crocheted, of sale value exceeding Rs. 2500 per piece 198. 62 Articles of apparel and clothing accessories, not knitted or crocheted, of sale value exceeding Rs. 2500 per piece 199. 63 [other than 6309] Other made-up textile articles, sets of sale value exceeding Rs. 2500 per piece [other than worn clothing and other worn articles; rags] 200. 3923 or 6305 Woven and non-woven bags and sacks of polyethylene or polypropylene strips or the like, whether or not laminated, of a kind used for packing of goods 201. 6305 32 00 Flexible intermediate bulk containers 202. 6401 Waterproof footwear with outer soles and uppers of rubber or of plastics, the uppers of which are neither fixed to the sole nor assembled by stitching, riveting, nailing, screwing, plugging or similar processes 203. 6402 Other footwear with outer soles and uppers of rubber or plastics 204. 6403 Footwear with outer soles of rubber, plastics, leather or composition leather and uppers of leather 205. 6404 Footwear with outer soles of rubber, plastics, leather or composition leather and uppers of textile materials 206. 6405 Other footwear 207. 6406 Parts of footwear (including uppers whether or not attached to soles other than outer soles); removable in-soles, heel cushions and similar articles; gaiters, leggings and similar articles, and parts thereof 208. 6501 Hat-forms, hat bodies and hoods of felt, neither blocked to shape nor with made brims; plateaux and manchons (including slit manchons), of felt [other than textile caps] 209. 6502 Hat-shapes, plaited or made by assembling strips of any material, neither blocked to shape, nor with made brims, nor lined, nor trimmed 210. 6504 00 00 Hats and other headgear, plaited or made by assembling strips of any material, whether or not lined or trimmed 211. 6505 Other headgear, knitted or crocheted, or made up from lace, felt or other textile fabric, in the piece (but not in strips), whether or not lined or trimmed; hair-nets of any material, whether or not lined or trimmed 212. 6506 Other headgear, whether or not lined or trimmed 213. 6507 Head-bands, linings, covers, hat foundations, hat frames, peaks and chinstraps, for headgear 214. 6702 Artificial flowers, foliage and fruit and parts thereof; articles made of artificial flowers, foliage or fruit 215. 6703 Wool or other animal hair or other textile materials, prepared for use in making wigs or the like 216. 6704 Wigs, false beards, eyebrows and eyelashes, switches and the like, of human or animal hair or of textile materials; articles of human hair not elsewhere specified or included 217. 6801 Setts, curbstones and flagstones, of natural stone (except slate) 218. 6802 Worked monumental or building stone (except slate) and articles thereof, other than goods of heading 6801; mosaic cubes and the like, of natural stone (including slate), whether or not on a backing; artificially 106 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] coloured granules, chippings and power, of natural stone (including slate) [other than statues, statuettes, pedestals; high or low reliefs, crosses, figures of animals, bowls, vases, cups, cachou boxes, writing sets, ashtrays, paper weights, artificial fruit and foliage, etc.; other ornamental goods essentially of stone][except the items covered in Sl. No. 176 in Schedule I] 219. 6803 Worked slate and articles of slate or of agglomerated slate 220. 6804 Millstones, grindstones, grinding wheels and the like, without frameworks, for grinding, sharpening, polishing, trueing or cutting, hand sharpening or polishing stones, and parts thereof, of natural stone, of agglomerated natural or artificial abrasives, or of ceramics, with or without parts of other materials 221. 6805 Natural or artificial abrasive powder or grain, on a base of textile material, of paper, of paperboard or of other materials, whether or not cut to shape or sewn or otherwise made up 222. 6806 Slag wool, rock wool and similar mineral wools; exfoliated vermiculite, expanded clays, foamed slag and similar expanded mineral materials; mixtures and articles of heat-insulating, sound-insulating or sound- absorbing mineral materials, other than those of heading 6811 or 6812 or chapter 69 223. 6807 Articles of asphalt or of similar material (for example, petroleum bitumen or coal tar pitch) 224. 6808 Panels, boards, tiles, blocks and similar articles of vegetable fibre, of straw or of shavings, chips, particles, sawdust or other waste, of wood, agglomerated with cement, plaster or other mineral binders 225. 6809 Articles of plaster or of compositions based on plaster; such as Boards, sheets, panels, tiles and similar articles, not ornamented 226. 6810 Articles of cement, of concrete or of artificial stone, whether or not reinforced 227. 6811 Articles of asbestos-cement, of cellulose fibre-cement or the like 228. 6812 Fabricated asbestos fibres; mixtures with a basis of asbestos or with a basis of asbestos and magnesium carbonate; articles of such mixtures or of asbestos (for example, thread, woven fabric, clothing, headgear, footwear, gaskets), whether or not reinforced, other than goods of heading 6811 or 6813 229. 6813 Friction material and articles thereof (for example, sheets, rolls, strips, segments, discs, washers, pads), not mounted, for brakes, for clutches or the like, with a basis of asbestos, of other mineral substances or of cellulose, whether or not combined with textiles or other materials 230. 6814 Worked mica and articles of mica, including agglomerated or reconstituted mica, whether or not on a support of paper, paperboard or other materials 231. 6815 Articles of stone or of other mineral substances (including carbon fibres, articles of carbon fibres and articles of peat), not elsewhere specified or included [other than Fly ash bricks Fly ash aggregates; Fly ash blocks] 232. 6901 Blocks, tiles and other ceramic goods of siliceous fossil meals (for example, kieselguhr, tripolite or diatomite) or of similar siliceous earths 233. 6902 Refractory bricks, blocks, tiles and similar refractory ceramic constructional goods, other than those of siliceous fossil meals or similar siliceous earths 234. 6903 Other refractory ceramic goods (for example, retorts, crucibles, muffles, nozzles, plugs, supports, cupels, tubes, pipes, sheaths and rods), other than those of siliceous fossil meals or of similar siliceous earths 235. 6904 Ceramic flooring blocks, support or filler tiles and the like 236. 6905 Chimney-pots, cowls, chimney liners, architectural ornaments and other ceramic constructional goods 237. 6906 Ceramic pipes, conduits, guttering and pipe fittings 238. 6907 Ceramic flags and paving, hearth or wall tiles; ceramic mosaic cubes and the like, whether or not on a backing; finishing ceramics 239. 6909 Ceramic wares for laboratory, chemical or other technical uses; ceramic troughs, tubs and similar receptacles of a kind used in agriculture; [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 107 ceramic pots, jars and similar articles of a kind used for the conveyance or packing of goods 240. 6910 Ceramic sinks, wash basins, wash basin pedestals, baths, bidets, water closet pans, flushing cisterns, urinals and similar sanitary fixtures 241. 6914 Other ceramic articles 242.", "metadata": {"source": "gst_9_2025", "chunk_index": 13}}
{"id": "gst_9_2025_14", "text": "7002 Glass in balls (other than microspheres of heading 70.18), rods or tubes, unworked 243. 7003 Cast glass and rolled glass, in sheets or profiles, whether or not having an absorbent, reflecting or non-reflecting layer, but not otherwise worked 244. 7004 Drawn glass and blown glass, in sheets, whether or not having an absorbent, reflecting or non-reflecting layer, but not otherwise worked 245. 7005 Float glass and surface ground or polished glass, in sheets, whether or not having an absorbent, reflecting or non-reflecting layer, but not otherwise worked 246. 7006 00 00 Glass of heading 7003, 7004 or 7005, bent, edge-worked, engraved, drilled, enamelled or otherwise worked, but not framed or fitted with other materials 247. 7007 Safety glass, consisting of toughened (tempered) or laminated glass 248. 7008 Multiple-walled insulating units of glass 249. 7009 Glass mirrors, whether or not framed, including rear-view mirrors 250. 7010 Carboys, bottles, flasks, jars, pots, phials, ampoules and other containers, of glass, of a kind used for the conveyance or packing of goods; preserving jars of glass; stoppers, lids and other closures, of glass 251. 7011 Glass envelopes (including bulbs and tubes), open, and glass parts thereof, without fittings, for electric lamps and light sources, cathode ray tube or the like 252. 7013 Glassware of a kind used for table, kitchen, toilet, office, indoor decoration or similar purposes (other than that of heading 7010 or 7018) 253. 7014 Signalling glassware and optical elements of glass (other than those of heading 7015), not optically worked 254. 7015 Clock or watch glasses and similar glasses, glasses for non-corrective spectacles, curved, bent, hollowed or the like, not optically worked; hollow glass spheres and their segments, for the manufacture of such glasses 255. 7016 Paving blocks, slabs, bricks, squares, tiles and other articles of pressed or moulded glass, whether or not wired, of a kind used for building or construction purposes; glass cubes and other glass small wares, whether or not on a backing, for mosaics or similar decorative purposes; leaded lights and the like; multi-cellular or foam glass in blocks, panels, plates, shells or similar forms 256. 7017 Laboratory, hygienic or pharmaceutical glassware, whether or not graduated or calibrated 257. 7018 Imitation pearls, imitation precious or semi-precious stones and similar glass smallwares, and articles thereof other than imitation jewellery; glass eyes other than prosthetic articles; statuettes and other ornaments of lamp-worked glass, other than imitation jewellery; glass microspheres not exceeding 1 mm in diameter 258. 7019 Glass fibres (including glass wool) and articles thereof (for example, yarn, rovings, woven fabrics) 259. 7020 Other articles of glass [other than Globes for lamps and lanterns, Founts for kerosene wick lamps, Glass chimneys for lamps and lanterns] 260. 7201 Pig iron and spiegeleisen in pigs, blocks or other primary forms 261. 7202 Ferro-alloys 262. 7203 Ferrous products obtained by direct reduction of iron ore and other spongy ferrous products, in lumps, pellets or similar forms; iron having a minimum purity by weight of 99.94%, in lumps, pellets or similar forms 263. 7204 Ferrous waste and scrap; remelting scrap ingots of iron or steel 264. 7205 Granules and powders, of pig iron, spiegeleisen, iron or steel 265. 7206 Iron and non-alloy steel in ingots or other primary forms (excluding iron 108 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] of heading 7203) 266. 7207 Semi-finished products of iron or non-alloy steel 267. 7208 to 7212 All flat-rolled products of iron or non-alloy steel 268. 7213 to 7215 All bars and rods, of iron or non-alloy steel 269. 7216 Angles, shapes and sections of iron or non-alloy steel 270. 7217 Wire of iron or non-alloy steel 271. 7218 Stainless steel in ingots or other primary forms; semi-finished products of stainless steel 272. 7219, 7220 All flat-rolled products of stainless steel 273. 7221, 7222 All bars and rods, of stainless steel 274. 7223 Wire of stainless steel 275. 7224 Other alloy steel in ingots or other primary forms; semi-finished products of other alloy steel 276. 7225, 7226 All flat-rolled products of other alloy steel 277. 7227, 7228 All bars and rods of other alloy steel. 278. 7229 Wire of other alloy steel 279. 7301 Sheet piling of iron or steel, whether or not drilled, punched or made from assembled elements; welded angles, shapes and sections, of iron or steel 280. 7302 Railway or tramway track construction material of iron or steel, the following: rails, check-rails and rack rails, switch blades, crossing frogs, point rods and other crossing pieces, sleepers (cross-ties), fish-plates, chairs, chair wedges, sole plates (base plates), rail clips bedplates, ties and other material specialized for jointing or fixing rails 281. 7303 Tubes, pipes and hollow profiles, of cast iron 282. 7304 Tubes, pipes and hollow profiles, seamless, of iron (other than cast iron) or steel 283. 7305 Other tubes and pipes (for example, welded, riveted or similarly closed), having circular cross-sections, the external diameter of which exceeds 406.4 mm, of iron or steel 284. 7306 Other tubes, pipes and hollow profiles (for example, open seam or welded, riveted or similarly closed), of iron or steel 285. 7307 Tube or pipe fittings (for example, couplings, elbows, sleeves), of iron or steel 286. 7308 Structures (excluding prefabricated buildings of heading 94.06) and parts of structures (for example, bridges and bridge-sections, lock-gates, towers, lattice masts, roofs, roofing frame-works, doors and windows and their frames and thresholds for doors, and shutters, balustrades, pillars, and columns), of iron or steel; plates, rods, angles, shapes, section, tubes and the like, prepared for using structures, of iron or steel [other than transmission towers] 287. 7309 Reservoirs, tanks, vats and similar containers for any material (other than compressed or liquefied gas), of iron or steel, of a capacity exceeding 300 l, whether or not lined or heat-insulated, but not fitted with mechanical or thermal equipment 288. 7310 Tanks, casks, drums, cans, boxes and similar containers, for any material (other than compressed or liquefied gas), of iron or steel, of a capacity not exceeding 300 l, whether or not lined or heat-insulated, but not fitted with mechanical or thermal equipment, other than Milk cans made of Iron or Steel 289. 7311 Containers for compressed or liquefied gas, of iron or steel 290. 7312 Stranded wire, ropes, cables, plaited bands, slings and the like, of iron or steel, not electrically insulated 291. 7313 Barbed wire of iron or steel; twisted hoop or single flat wire, barbed or not, and loosely twisted double wire, of a kind used for fencing, of iron or steel 292. 7314 Cloth (including endless bands), grill, netting and fencing, of iron or steel wire; expanded metal of iron or steel 293. 7315 Chain and parts thereof, of iron or steel falling under 7315 20, 7315 81, 7315 82, 7315 89, 7315 90 294. 7316 Anchors, grapnels and parts thereof, of iron or steel [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 109 295. 7317 Nails, tacks, drawing pins, corrugated nails, staples (other than those of heading 8305) and similar articles, of iron or steel, whether or not with heads of other material, but excluding such articles with heads of copper 296. 7318 Screws, bolts, nuts, coach screws, screw hooks, rivets, cotters, cotter- pins, washers (including", "metadata": {"source": "gst_9_2025", "chunk_index": 14}}
{"id": "gst_9_2025_15", "text": "spring washers) and similar articles, of iron or steel 297. 7319 Knitting needles, bodkins, crochet hooks, embroidery stilettos and similar articles, for use in the hand, of iron or steel; safety pins and other pins of iron or steel, not elsewhere specified or included 298. 7320 Springs and leaves for springs, of iron and steel 299. 7321 Stoves, ranges, grates, cookers (including those with subsidiary boilers for central heating), barbecues, braziers, gas-rings, plate warmers and similar non-electric domestic appliances, and parts thereof, of iron or steel [other than Kerosene burners, kerosene stoves, wood burning stoves of iron or steel, and solar cookers] 300. 7322 Radiators for central heating, not electrically heated, and parts thereof, of iron or steel; air heaters and hot air distributors (including distributors which can also distribute fresh or conditioned air), not electrically heated, incorporating a motor-driven fan or blower, and parts thereof, of iron or steel 301. 7323 Iron or steel wool; pot scourers and scouring or polishing pads, gloves and the like, of iron or steel (other than Milk cans made of Iron or Steel) 302. 7323 9410 Ghamella 303. 7324 Sanitary ware and parts thereof, of iron and steel 304. 7325 Other cast articles of iron or steel 305. 7326 Other articles of iron or steel 306. 7401 Copper mattes; cement copper (precipitated copper) 307. 7402 Unrefined copper; copper anodes for electrolytic refining 308. 7403 Refined copper and copper alloys, unwrought 309. 7404 Copper waste and scrap 310. 7405 Master alloys of copper 311. 7406 Copper powders and flakes 312. 7407 Copper bars, rods and profiles 313. 7408 Copper wire 314. 7409 Copper plates, sheets and strip, of a thickness exceeding 0.15 mm 315. 7410 Copper foils 316. 7411 Copper tubes and pipes 317. 7412 Copper tube or pipe fittings (for example, couplings, elbows, sleeves) 318. 7413 Stranded wires and cables 319. 7415 Nails, tacks, drawing pins, staples (other than those of heading 83.05) and similar articles, of copper or of iron or steel with heads of copper; screws, bolts, nuts, screw hooks, rivets, cotters, cotter-pins, washers (including spring washers) and similar articles, of copper 320. 7418 All goods (other than table, kitchen or other household articles of copper; Utensils) 321. 7419 Other articles of copper (other than Brass Kerosene Pressure Stove) 322. 7501 Nickel mattes, nickel oxide sinters and other intermediate products of nickel metallurgy 323. 7502 Unwrought nickel 324. 7503 Nickel waste and scrap 325. 7504 Nickel powders and flakes 326. 7505 Nickel bars, rods, profiles and wire 327. 7506 Nickel plates, sheets, strip and foil 328. 7507 Nickel tubes, pipes and tube or pipe fittings (for example, couplings, elbows, sleeves) 329. 7508 Other articles of nickel 330. 7601 Unwrought Aluminium 331. 7602 Aluminium waste and scrap 332. 7603 Aluminium powders and flakes 333. 7604 Aluminium bars, rods and profiles 110 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 334. 7605 Aluminium wire 335. 7606 Aluminium plates, sheets and strip, of a thickness exceeding 0.2 mm 336. 7607 Aluminium foil (whether or not printed or backed with paper, paperboard, plastics or similar backing materials) of a thickness (excluding any backing) not exceeding 0.2 mm 337. 7608 Aluminium tubes and pipes 338. 7609 Aluminium tube or pipe fittings (for example, couplings, elbows, sleeves) 339. 7610 Aluminium structures (excluding prefabricated buildings of heading 9406) and parts of structures (for example, bridges and bridge-sections, towers, lattice masts, roofs, roofing frameworks, balustrades, pillars and columns); aluminium plates, rods, profiles, tubes and the like, prepared for use in structures 340. 7611 Aluminium reservoirs, tanks, vats and similar containers, for any material (other than compressed or liquefied gas), of a capacity exceeding 300 l, whether or not lined or heat-insulated, but not fitted with mechanical or thermal equipment 341. 7612 Aluminium casks, drums, cans, boxes, etc., other than Milk cans made of Aluminium 342. 7613 Aluminium containers for compressed or liquefied gas 343. 7614 Stranded wires, cables, plaited bands and the like, of aluminium, not electrically insulated 344. 7615 All goods (other than table, kitchen or other household articles, of aluminium; Utensils, Milk cans made of Aluminium) 345. 7616 Other articles of aluminium 346. 7801 Unwrought lead 347. 7802 Lead waste and scrap 348. 7804 Lead plates, sheets, strip and foil; lead powders and flakes 349. 7806 Other articles of lead (including sanitary fixtures and Indian lead seals) 350. 7901 Unwrought zinc 351. 7902 Zinc waste and scrap 352. 7903 Zinc dust, powders and flakes 353. 7904 Zinc bars, rods, profiles and wire 354. 7905 Zinc plates, sheets, strip and foil 355. 7907 Other articles of zinc including sanitary fixtures 356. 8001 Unwrought tin 357. 8002 Tin waste and scrap 358. 8003 Tin bars, rods, profiles and wire 359. 8007 Other articles of tin 360. 8101 to 8112 Other base metals, namely, Tungsten, Molybdenum, Tantalum, Magnesium, Cobalt mattes, and other intermediate products of cobalt metallurgy, Bismuth, Cadmium, Titanium, Zirconium, Antimony, Manganese, Beryllium, chromium, germanium, vanadium, gallium, hafnium, indium, niobium (columbium), rhenium and thallium, and articles thereof, including waste and scrap 361. 8113 Cermets and articles thereof, including waste and scrap 362. 8202 Hand saws; blades for saws of all kinds (including slitting, slotting or toothless saw blades) 363. 8203 Files, rasps, pliers (including cutting pliers), pincers, tweezers, metal cutting shears, pipe-cutters, bolt croppers, perforating punches and similar hand tools 364. 8204 Hand-operated spanners and wrenches (including torque meter wrenches but not including tap wrenches); interchangeable spanner sockets, with or without handles 365. 8205 Hand tools (including glaziers' diamonds), not elsewhere specified or included; blow lamps; vices, clamps and the like, other than accessories for and parts of, machine-tools or water-jet cutting machines; anvils; portable forges; hand or pedal-operated grinding wheels with frameworks 366. 8206 Tools of two or more of the headings 8202 to 8205, put up in sets for [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 111 retail sale 367. 8207 Interchangeable tools for hand tools, whether or not power-operated, or for machine-tools (for example, for pressing, stamping, punching, tapping, threading, drilling, boring, broaching, milling, turning or screw driving), including dies for drawing or extruding metal, and rock drilling or earth boring tools 368. 8208 Knives and cutting blades, for machines or for mechanical appliances 369. 8209 Plates, sticks, tips and the like for tools, unmounted, of cermets 370. 8210 00 00 Hand-operated mechanical appliances, weighing 10 kg or less, used in the preparation, conditioning or serving of food or drink 371. 8211 Knives with cutting blades, serrated or not (including pruning knives), other than knives of heading 8208, and blades therefor 372. 8212 Razors and razor blades (including razor blade blanks in strips) 373. 8213 00 00 Scissors, tailors' shears and similar shears, and blades therefor 374. 8214 Other articles of cutlery (for example, hair clippers, butchers' or kitchen cleavers, choppers and mincing knives); manicure or pedicure sets and instruments including nail files [other than pencil sharpeners] 375. 8215 Spoons, forks, ladles, skimmers, cake-servers, fish-knives, butter-knives, sugar tongs and similar kitchen or tableware 376. 8301 Padlocks and locks (key, combination or electrically operated), of base metal; clasps and frames with clasps, incorporating locks, of base metal; keys for any of the foregoing articles, of base metal 377. 8302 Base metal mountings, fittings and", "metadata": {"source": "gst_9_2025", "chunk_index": 15}}
{"id": "gst_9_2025_16", "text": "similar articles suitable for furniture, doors, staircases, windows, blinds, coachwork, saddlery, trunks, chests, caskets or the like; base metal hat-racks, hat-pegs, brackets and similar fixtures; castors with mountings of base metal; automatic door closers of base metal 378. 8303 Armoured or reinforced safes, strong-boxes and doors and safe deposit lockers for strong-rooms, cash or deed boxes and the like, of base metal 379. 8304 Filing cabinets, card-index cabinets, paper trays, paper rests, pen trays, office-stamp stands and similar office or desk equipment, of base metal, other than office furniture of heading 9403 380. 8305 Fittings for loose-leaf binders or files, letter clips, letter corners, paper clips, indexing tags and similar office articles, of base metal; staples in strips (for example, for offices, upholstery, packaging), of base metal 381. 8307 Flexible tubing of base metal, with or without fittings 382. 8308 Clasps, frames with clasps, buckles, buckle-clasps, hooks, eyes, eyelets and the like, of base metal, of a kind used for clothing or clothing accessories, footwear, jewellery, wrist watches, books, awnings, leather goods, travel goods or saddlery or for other made up articles; tubular or bifurcated rivets, of base metal; beads and spangles, of base metal 383. 8309 Stoppers, caps and lids (including crown corks, screw caps and pouring stoppers), capsules for bottles, threaded bungs, bung covers, seals and other packing accessories, of base metal 384. 8310 Sign-plates, name-plates, address-plates and similar plates, numbers, letters and other symbols, of base metal, excluding those of heading 9405 385. 8311 Wire, rods, tubes, plates, electrodes and similar products, of base metal or of metal carbides, coated or cored with flux material, of a kind used for soldering, brazing, welding or deposition of metal or of metal carbides; wire and rods, of agglomerated base metal powder, used for metal spraying 386. 84 Parts suitable for use solely or principally with fixed Speed Diesel Engines of power not exceeding 15HP 387. 84 or 85 Parts suitable for use solely or principally with power driven pumps primarily designed for handling water, namely, centrifugal pumps (horizontal and vertical), deep tube-well turbine pumps, submersible pumps, axial flow and mixed flow vertical pumps 388. 8401 Nuclear reactors; machinery and apparatus for isotopes separation 389. 8402 Steam or other vapour generating boilers (other than central heating hot water boilers capable also of producing low pressure steam); super- 112 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] heated water boilers 390. 8403 Central heating boilers other than those of heading 8402 391. 8404 Auxiliary plant for use with boilers of heading 8402 or 8403 (for example, economisers, super-heaters, soot removers, gas recoverers); condensers for steam or other vapour power units 392. 8405 Producer gas or water gas generators, with or without their purifiers; acetylene gas generators and similar water process gas generators, with or without their purifiers 393. 8406 Steam turbines and other vapour turbines 394. 8407 Spark-ignition reciprocating or rotary internal combustion piston engine [other than aircraft engines] 395. 8408 Compression-ignition internal combustion piston engines (diesel or semi-diesel engines) 396. 8409 Parts suitable for use solely or principally with the engines of heading 8407 or 8408 397. 8410 Hydraulic turbines, water wheels, and regulators therefor 398. 8411 Turbo-jets, turbo-propellers and other gas turbines [other than aircraft engines] 399. 8412 Other engines and motors (Reaction engines other than turbo jets, Hydraulic power engines and motors, Pneumatic power engines and motors, other parts) [other than wind turbine or engine] 400. 8413 (a) Concrete pumps [8413 40 00]; (b) other rotary positive displacement pumps [8413 60]; (c) Power driven pumps primarily designed for handling water, namely, centrifugal pumps (horizontal and vertical), deep tube-well turbine pumps, submersible pumps, axial flow and mixed flow vertical pumps]; Pumps for dispensing fuel or lubricants of the type used in filling stations or garages [8413 11], Fuel, lubricating or cooling medium pumps for internal combustion piston engines [8413 30] 401. 8414 Air or vacuum pumps, air or other gas compressors and fans; ventilating or recycling hoods incorporating a fan, whether or not fitted with filters; Gas-tight biological safety cabinets, whether or not fitted with filters[other than bicycle pumps, other hand pumps and parts of air or vacuum pumps and compressors of bicycle pumps] 402. 8414 20 10 Bicycles pumps 403. 8414 90 12 Parts of air or vacuum pumps and compressors of bicycle pumps 404. 8415 Air-conditioning machines, comprising a motor-driven fan and elements for changing the temperature and humidity, including those machines in which the humidity cannot be separately regulated 405. 8416 Furnace burners for liquid fuel, for pulverised solid fuel or for gas; mechanical stokers, including their mechanical grates, mechanical ash dischargers and similar appliances 406. 8417 Industrial or laboratory furnaces and ovens, including incinerators, non- electric 407. 8418 Refrigerators, freezers and other refrigerating or freezing equipment, electric or other; heat pumps other than air conditioning machines of heading 8415 408. 8419 [other than 8419 12] Machinery, plant or laboratory equipment, whether or not electrically heated (excluding furnaces, ovens and other equipment of heading 8514), for the treatment of materials by a process involving a change of temperature such as heating, cooking, roasting, distilling, rectifying, sterilising, pasteurising, steaming, drying, evaporating, vaporising, condensing or cooling, other than machinery or plant of a kind used for domestic purposes; instantaneous or storage water heaters, non-electric [other than Solar water heater and system] 409. 8420 Calendering or other rolling machines, other than for metals or glass, and cylinders therefor [other than Hand operated rubber roller] 410. 8421 Centrifuges, including centrifugal dryers; filtering or purifying machinery and apparatus, for liquids or gases 411. 8422 Dish washing machines, household [8422 11 00] and other [8422 19 00]; Machinery for cleaning or drying bottles or other containers; machinery [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 113 for filling, closing, sealing or labelling bottles, cans, boxes, bags or other containers; machinery for capsuling bottles, jars, tubes and similar containers; other packing or wrapping machinery (including heat-shrink wrapping machinery); machinery for aerating beverages 412. 8423 Weighing machinery (excluding balances of a sensitivity of 5 centigrams or better), including weight operated counting or checking machines; weighing machine weights of all kinds 413. 8424 Mechanical appliances (whether or not hand-operated) for projecting, dispersing or spraying liquids or powders; fire extinguishers, whether or not charged; spray guns and similar appliances; steam or sand blasting machines and similar jet projecting machines [other than sprinklers; drip irrigation systems including laterals; mechanical sprayer; nozzles for drip irrigation equipment or nozzles for sprinklers] 414. 8425 Pulley tackle and hoists other than skip hoists; winches and capstans; jacks 415. 8426 Ship’s derricks; cranes including cable cranes; mobile lifting frames, straddle carriers and works trucks fitted with a crane 416. 8427 Fork-lift trucks; other works trucks fitted with lifting or handling equipment 417. 8428 Other lifting, handling, loading or unloading machinery (for example, lifts, escalators, conveyors, teleferics) 418. 8429 Self-propelled bulldozers, angledozers, graders, levellers, scrapers, mechanical shovels, excavators, shovel loaders, tamping machines and road rollers 419. 8430 Other moving, grading, levelling, scraping, excavating, tamping, compacting, extracting or boring machinery, for earth, minerals or ores; piledrivers and pile-extractors; snow-ploughs and snow-blowers 420. 8431 Parts suitable for use solely or principally with the machinery of headings 8425 to 8430 421. 8433 Machines for", "metadata": {"source": "gst_9_2025", "chunk_index": 16}}
{"id": "gst_9_2025_17", "text": "cleaning, sorting or grading eggs, fruit or other agricultural produce, other than machinery of heading 8437; parts thereof [8433 90 00] 422. 8434 Milking machines and dairy machinery 423. 8435 Presses, crushers and similar machinery used in the manufacture of wine, cider, fruit juices or similar beverages 424. 8437 Machines for cleaning, sorting or grading, seed, grain or dried leguminous vegetables; machinery used in milling industry or for the working of cereals or dried leguminous vegetables other than farm type machinery and parts thereof 425. 8438 Machinery, not specified or included elsewhere in this Chapter, for the industrial preparation or manufacture of food or drink, other than machinery for the extraction or preparation of animal or fixed vegetable or microbial fats or oils 426. 8439 Machinery for making pulp of fibrous cellulosic material or for making or finishing paper or paperboard 427. 8440 Book-binding machinery, including book-sewing machines 428. 8441 Other machinery for making up paper pulp, paper or paperboard, including cutting machines of all kinds 429. 8442 Machinery, apparatus and equipment (other than the machines of headings 8456 to 8465) for preparing or making plates, printing components; plates, cylinders and lithographic stones, prepared for printing purposes (for example, planed, grained or polished) 430. 8443 Printing machinery used for printing by means of plates, cylinders and other printing components of heading 8442; other printers, copying machines and facsimile machines, whether or not combined; parts and accessories thereof 431. 8444 Machines for extruding, drawing, texturing or cutting man-made textile materials 432. 8445 Machines for preparing textile fibres; spinning, doubling or twisting machines and other machinery for producing textile yarns; textile reeling or winding (including weft-winding) machines and machines for 114 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] preparing textile yarns for use on the machines of heading 8446 or 8447 433. 8446 Weaving machines (looms) 434. 8447 Knitting machines, stitch-bonding machines and machines for making gimped yarn, tulle, lace, embroidery, trimmings, braid or net and machines for tufting 435. 8448 Auxiliary machinery for use with machines of heading 8444, 8445, 8446 or 8447 (for example, dobbies, Jacquards, automatic stop motions, shuttle changing mechanisms); parts and accessories suitable for use solely or principally with the machines of this heading or of heading 8444, 8445, 8446 or 8447 (for example, spindles and spindles flyers, card clothing, combs, extruding nipples, shuttles, healds and heald frames, hosiery needles) 436. 8449 Machinery for the manufacture or finishing of felt or nonwovens in the piece or in shapes, including machinery for making felt hats; blocks for making hats 437. 8450 Household or laundry-type washing machines, including machines which both wash and dry 438. 8451 Machinery (other than machines of heading 8450) for washing, cleaning, wringing, drying, ironing, pressing (including fusing presses), bleaching, dyeing, dressing, finishing, coating or impregnating textile yarns, fabrics or made up textile articles and machines for applying the paste to the base fabric or other support used in the manufacture of floor covering such as linoleum; machines for reeling, unreeling, folding, cutting or pinking textile fabrics 439. 8453 Machinery for preparing, tanning or working hides, skins or leather or for making or repairing footwear or other articles of hides, skins or leather, other than sewing machines 440. 8454 Converters, ladles, ingot moulds and casting machines, of a kind used in metallurgy or in metal foundries 441. 8455 Metal-rolling mills and rolls therefor 442. 8456 Machine-tools for working any material by removal of material, by laser or other light or photon beam, ultrasonic, electro-discharge, electro- chemical, electron beam, ionic-beam or plasma arc processes 443. 8457 Machining centres, unit construction machines (single station) and multi-station transfer machines, for working metal 444. 8458 Lathes (including turning centres) for removing metal 445. 8459 Machine-tools (including way-type unit head machines) for drilling, boring, milling, threading or tapping by removing metal, other than lathes (including turning centres) of heading 8458 446. 8460 Machine-tools for deburring, sharpening, grinding, honing, lapping, polishing or otherwise finishing metal, or cermets by means of grinding stones, abrasives or polishing products, other than gear cutting, gear grinding or gear finishing machines of heading 8461 447. 8461 Machine-tools for planing, shaping, slotting, broaching, gear cutting, gear grinding or gear finishing, sawing, cutting-off and other machine- tools working by removing metal or cermets, not elsewhere specified or included 448. 8462 Machine-tools (including presses) for working metal by forging, hammering or die forging (excluding rolling mills); Machine-tools (including presses, slitting lines and cut-to-length lines) for working metal by bending, folding, straightening, flattening, shearing, punching, notching or nibbling (excluding draw-benches); Presses for working metal or metal carbides, not specified above 449. 8463 Other machine-tools for working metal, or cermets, without removing material 450. 8464 Machine-tools for working stone, ceramics, concrete, asbestos-cement or like mineral materials or for cold working glass 451. 8465 Machine-tools (including machines for nailing, stapling, glueing or otherwise assembling) for working wood, cork, bone, hard rubber, hard plastics or similar hard materials 452. 8466 Parts and accessories suitable for use solely or principally with the [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 115 machines of headings 8456 to 8465 including work or tool holders, self- opening dieheads, dividing heads and other special attachments for the machines; tool holders for any type of tool, for working in the hand 453. 8467 Tools for working in the hand, pneumatic, hydraulic or with self- contained electric or non-electric motor 454. 8468 Machinery and apparatus for soldering, brazing or welding, whether or not capable of cutting, other than those of heading 8515; gas-operated surface tempering machines and appliances 455. 8470 Calculating machines and pocket-size data recording, reproducing and displaying machines with calculating functions; accounting machines, postage-franking machines, ticket-issuing machines and similar machines, incorporating a calculating device; cash registers 456. 8471 Automatic data processing machines and units thereof; magnetic or optical readers, machines for transcribing data onto data media in coded form and machines for processing such data, not elsewhere specified or included 457. 8472 Other office machines (for example, hectograph or stencil duplicating machines, addressing machines, automatic banknote dispensers, coin sorting machines, coin counting or wrapping machines, pencil sharpening machines, perforating or stapling machines) [other than Braille typewriters, electric or non-electric] 458. 8473 Parts and accessories (other than covers, carrying cases and the like) suitable for use solely or principally with machines of headings 8470 to 8472 459. 8474 Machinery for sorting, screening, separating, washing, crushing, grinding, mixing or kneading earth, stone, ores or other mineral substances, in solid (including powder or paste) form; machinery for agglomerating, shaping or moulding solid mineral fuels, ceramic paste, unhardened cements, plastering materials or other mineral products in powder or paste form; machines for forming foundry moulds of sand 460. 8475 Machines for assembling electric or electronic lamps, tubes or valves or flashbulbs, in glass envelopes; machines for manufacturing or hot working glass or glassware 461. 8476 Automatic goods-vending machines (for example, postage stamps, cigarette, food or beverage machines), including money changing machines 462. 8477 Machinery for working rubber or plastics or for the manufacture of products from these materials, not specified or included elsewhere in this Chapter 463. 8478 Machinery for preparing or making up tobacco, not specified or included elsewhere in this chapter 464. 8479 Machines and mechanical appliances", "metadata": {"source": "gst_9_2025", "chunk_index": 17}}
{"id": "gst_9_2025_18", "text": "having individual functions, not specified or included elsewhere in this Chapter [other than Composting Machines] 465. 8480 Moulding boxes for metal foundry; mould bases; moulding patterns; moulds for metal (other than ingot moulds), metal carbides, glass, mineral materials, rubber or plastics 466. 8481 Taps, cocks, valves and similar appliances for pipes, boiler shells, tanks, vats or the like, including pressure-reducing valves and thermostatically controlled valves 467. 8482 Ball bearing, Roller Bearings 468. 8483 Transmission shafts (including cam shafts and crank shafts) and cranks; bearing housings and plain shaft bearings; gears and gearing; ball or roller screws; gear boxes and other speed changers, including torque converters; flywheels and pulleys, including pulley blocks; clutches and shaft couplings (including universal joints) 469. 8484 Gaskets and similar joints of metal sheeting combined with other material or of two or more layers of metal; sets or assortments of gaskets and similar joints, dissimilar in composition, put up in pouches, envelopes or similar packings; mechanical seals 470. 8485 Machines for Additive Manufacturing 116 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 471. 8486 Machines and apparatus of a kind used solely or principally for the manufacture of semiconductor boules or wafers, semiconductor devices, electronic integrated circuits or flat panel displays; machines and apparatus specified in Note 11(C) to this Chapter; parts and accessories 472. 8487 Machinery parts, not containing electrical connectors, insulators, coils, contacts or other electrical features not specified or included elsewhere in this chapter 473. 84 or 85 E-waste Explanation.- For the purpose of this entry, E-waste means electrical and electronic equipment listed in Schedule I of the E-Waste (Management) Rules, 2016 (published in the Gazette of India vide G.S.R. 338 (E) dated the 23rd March, 2016), whole or in part if discarded as waste by the consumer or bulk consumer 474. 8501 Electric motors and generators (excluding generating sets) 475. 8502 Electric generating sets and rotary converters 476. 8503 Parts suitable for use solely or principally with the machines of heading 8501 or 8502 477. 8504 Electrical transformers, static converters (for example, rectifiers) and inductors other than charger or charging station for Electrically operated vehicles 478. 8505 Electro-magnets; permanent magnets and articles intended to become permanent magnets after magnetisation; electro-magnetic or permanent magnet chucks, clamps and similar holding devices; electro-magnetic couplings, clutches and brakes; electro-magnetic lifting heads 479. 8506 Primary cells and primary batteries 480. 8507 Electric accumulators, including separators therefor, whether or not rectangular (including square) 481. 8508 Vacuum cleaners 482. 8509 Electro-mechanical domestic appliances, with self-contained electric motor, other than vacuum cleaners of heading 8508 483. 8510 Shavers, hair clippers and hair-removing appliances, with self-contained electric motor 484. 8511 Electrical ignition or starting equipment of a kind used for spark-ignition or compression-ignition internal combustion engines (for example, ignition magnetos, magneto-dynamos, ignition coils, sparking plugs and glow plugs, starter motors); generators (for example, dynamos, alternators) and cut-outs of a kind used in conjunction with such engines 485. 8512 Electrical lighting or signalling equipment (excluding articles of heading 8539), windscreen wipers, defrosters and demisters, of a kind used for cycles or motor vehicles 486. 8513 Portable electric lamps designed to function by their own source of energy (for example, dry batteries, accumulators, magnetos), other than lighting equipment of heading 8512 487. 8514 Industrial or laboratory electric furnaces and ovens (including those functioning by induction or dielectric loss); other industrial or laboratory equipment for the heat treatment of materials by induction or dielectric loss 488. 8515 Electric (including electrically heated gas), laser or other light or photo beam, ultrasonic, electron beam, magnetic pulse or plasma arc soldering, brazing or welding machines and apparatus, whether or not capable of cutting; electric machines and apparatus for hot spraying of metals or cermets 489. 8516 Electric instantaneous or storage water heaters and immersion heaters; electric space heating apparatus and soil heating apparatus; electro thermic hairdressing apparatus (for example, hair dryers, hair curlers, curling tong heaters) and hand dryers; electric smoothing irons; other electro-thermic appliances of a kind used for domestic purposes [other than solar cookers]; electric heating resistors, other than those of heading 8545 490. 8517 All goods [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 117 491. 8518 Microphones and stands therefore; loudspeakers, whether or not mounted in their enclosures; headphones and earphones, whether or not combined with a microphone, and sets consisting of a microphone and one or more loudspeakers; audio-frequency electric amplifiers; electric sound amplifier set 492. 8519 Sound recording or reproducing apparatus 493. 8521 Video recording or reproducing apparatus, whether or not incorporating a video tuner 494. 8522 Parts and accessories suitable for use solely or principally with the apparatus of headings 8519 or 8521 495. 8523 Discs, tapes, solid-state non-volatile storage devices, \"smart cards\" and other media for the recording of sound or of other phenomena, whether or not recorded, including matrices and masters for the production of discs, but excluding products of Chapter 37 496. 8524 Flat Panel Display Modules, Whether or Not Incorporating Touch-Sensitive Screens 497. 8525 Closed-circuit television (CCTV), transmission apparatus for radio- broadcasting or television, whether or not incorporating reception apparatus or sound recording or reproducing apparatus; television cameras, digital cameras and video camera recorders [other than two-way radio (Walkie talkie) used by defense, police and paramilitary forces, etc.] 498. 8526 Radar apparatus, radio navigational aid apparatus and radio remote control apparatus 499. 8527 Reception apparatus for radio-broadcasting, whether or not combined, in the same housing, with sound recording or reproducing apparatus or a clock 500. 8528 Television set (including LCD or LED television), Computer Monitors, Set top Box for Television; monitors and projectors, not incorporating television reception apparatus, reception apparatus for television, whether or not incorporating radio-broadcast receivers or sound or video recording or reproducing apparatus 501. 8529 Parts suitable for use solely or principally with the apparatus of headings 8525 to 8528 502. 8530 Electrical signalling, safety or traffic control equipment for railways, tramways, roads, inland waterways, parking facilities, port installations or airfields (other than those of heading 8608) 503. 8531 Electric sound or visual signalling apparatus (for example, bells, sirens, indicator panels, burglar or fire alarms), other than those of heading 8512 or 8530 504. 8532 Electrical capacitors, fixed, variable or adjustable (pre-set) 505. 8533 Electrical resistors (including rheostats and potentiometers), other than heating resistors 506. 8534 00 00 Printed Circuits 507. 8535 Electrical apparatus for switching or protecting electrical circuits, or for making connections to or in electrical circuits (for example, switches, fuses, lightning arresters, voltage limiters, surge suppressors, plugs and other connectors, junction boxes), for a voltage exceeding 1,000 volts 508. 8536 Electrical apparatus for switching or protecting electrical circuits, or for making connections to or in electrical circuits (for example, switches, relays, fuses, surge suppressors, plugs, sockets, lampholders, and other connectors, junction boxes), for a voltage not exceeding 1,000 volts: connectors for optical fibres, optical fibre bundles or cables 509. 8537 Boards, panels, consoles, desks, cabinets and other bases, equipped with two or more apparatus of heading 8535 or 8536, for electric control or the distribution of electricity, including those incorporating instruments or apparatus of chapter 90, and numerical control apparatus, other than switching apparatus of heading 8517 510. 8538 Parts suitable for use solely or principally with the apparatus", "metadata": {"source": "gst_9_2025", "chunk_index": 18}}
{"id": "gst_9_2025_19", "text": "of heading 8535, 8536 or 8537 511. 8539 Electrical Filament or discharge lamps including sealed beam lamp units 118 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] and ultra-violet or infra-red lamps; arc lamps 512. 8540 Thermionic, cold cathode or photo-cathode valves and tubes (for example, vacuum or vapour or gas filled valves and tubes, mercury arc rectifying valves and tubes, cathode-ray tubes, television camera tubes) 513. 8541 Semiconductor Devices (for example, Diodes, Transistors, Semiconductor Based Transducers); Photosensitive Semiconductor devices; Light-Emitting Diodes (LED), whether or not assembled with other Light-Emitting Diodes (LED); mounted piezo-electric crystals 514. 8542 Electronic integrated circuits 515. 8543 Electrical machines and apparatus, having individual functions, not specified or included elsewhere in this Chapter 516. 8544 Insulated (including enamelled or anodised) wire, cable (including co- axial cable) and other insulated electric conductors, whether or not fitted with connectors; optical fibre cables, made up of individually sheathed fibres, whether or not assembled with electric conductors or fitted with connectors 517. 8545 Carbon electrodes, carbon brushes, Lamp carbons, battery carbons and other articles of graphite or other carbon, with or without metal, of a kind used for electrical purposes 518. 8546 Electrical insulators of any material 519. 8547 Insulating fittings for electrical machines, appliances or equipment, being fittings wholly of insulating material apart from any minor components of metal (for example, threaded sockets) incorporated during moulding solely for the purposes of assembly, other than insulators of heading 8546; electrical conduit tubing and joints therefor, of base metal lined with insulating material 520. 8548 00 00 Electrical parts of machinery or apparatus, not specified or included elsewhere in Chapter 85 521. 8549 Electrical and electronic waste and scrap 522. 8601 Rail locomotives powered from an external source of electricity or by electric accumulators. 523. 8602 Other rail locomotives; locomotive tenders; such as Diesel electric locomotives, Steam locomotives and tenders thereof 524. 8603 Self-propelled railway or tramway coaches, vans and trucks, other than those of heading 8604. 525. 8604 Railway or tramway maintenance or service vehicles, whether or not self-propelled (for example, workshops, cranes, ballast tampers, track liners, testing coaches and track inspection vehicles) 526. 8605 Railway or tramway passenger coaches, not self-propelled; luggage vans, post office coaches and other special purpose railway or tramway coaches, not self-propelled (excluding those of heading 8604) 527. 8606 Railway or tramway goods vans and wagons, not self-propelled 528. 8607 Parts of railway or tramway locomotives or rolling-stock; such as Bogies, bissel-bogies, axles and wheels, and parts thereof. 529. 8608 Railway or tramway track fixtures and fittings; mechanical (including electro-mechanical) signalling, safety or traffic control equipment for railways, tramways, roads, inland waterways, parking facilities, port installations or airfields; parts of the foregoing. 530. 8609 Containers (including containers for the transport of fluids) specially designed and equipped for carriage by one or more modes of transport [including refrigerated containers] 531. 8701 Road tractors for semi-trailers of engine capacity more than 1800 cc 532. 8702 Motor vehicles for the transport of ten or more persons, including the driver [including buses for use in public transport, which exclusively run on Bio-fuels] 533. 8702 or 8703 Motor vehicles cleared as ambulances duly fitted with all the fitments, furniture and accessories necessary for an ambulance from the factory manufacturing such motor vehicles 534. 8703 21 or 8703 Petrol, Liquefied petroleum gases (LPG) or compressed natural gas 22 (CNG) driven motor vehicles of engine capacity not exceeding 1200cc and of length not exceeding 4000 mm [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 119 Explanation.- For the purposes of this entry, the specification of the motor vehicle shall be determined as per the Motor Vehicles Act, 1988 (59 of 1988) and the rules made there under. 535. 8703 31 Diesel driven motor vehicles of engine capacity not exceeding 1500 cc and of length not exceeding 4000 mm Explanation.- For the purposes of this entry, the specification of the motor vehicle shall be determined as per the Motor Vehicles Act, 1988 (59 of 1988) and the rules made there under. 536. 8703 Following motor vehicles of length not exceeding 4000 mm, namely: - (a) Petrol, Liquefied petroleum gases (LPG) or compressed natural gas (CNG) driven vehicles of engine capacity not exceeding 1200cc; and (b) Diesel driven vehicles of engine capacity not exceeding 1500 cc for persons with orthopedic physical disability, subject to the condition that an officer not below the rank of Deputy Secretary to the Government of India in the Department of Heavy Industries certifies that the said goods shall be used by the persons with orthopedic physical disability in accordance with the guidelines issued by the said Department 537. 8703 Three wheeled vehicles 538. 8703 40, 8703 60 Following Vehicles, with both spark-ignition internal combustion reciprocating piston engine and electric motor as motors for propulsion; (a) Motor vehicles cleared as ambulances duly fitted with all the fitments, furniture and accessories necessary for an ambulance from the factory manufacturing such motor vehicles (b) Three wheeled vehicles (c) Motor vehicles of engine capacity not exceeding 1200cc and of length not exceeding 4000 mm Explanation.- For the purposes of this entry, the specification of the motor vehicle shall be determined as per the Motor Vehicles Act, 1988 (59 of 1988) and the rules made there under 539. 8703 50, 8703 70 Following Vehicles, with both compression-ignition internal combustion piston engine [diesel-or semi diesel] and electric motor as motors for propulsion; (a) Motor vehicles cleared as ambulances duly fitted with all the fitments, furniture and accessories necessary for an ambulance from the factory manufacturing such motor vehicles (b) Three wheeled vehicles (c) Motor vehicles of engine capacity not exceeding 1500 cc and of length not exceeding 4000 mm Explanation.- For the purposes of this entry, the specification of the motor vehicle shall be determined as per the Motor Vehicles Act, 1988 (59 of 1988) and the rules made there under 540. 8704 Motor vehicles for the transport of goods, including Refrigerated motor vehicles 541. 8705 Special purpose motor vehicles, other than those principally designed for the transport of persons or goods (for example, breakdown lorries, crane lorries, fire fighting vehicles, concrete-mixer lorries, road sweeper lorries, spraying lorries, mobile workshops, mobile radiological unit) 542. 8706 Chassis fitted with engines, for the motor vehicles of headings 8701 to 8705 543. 8707 Bodies (including cabs), for the motor vehicles of headings 8701 to 8705 544. 8708 Parts and accessories of the motor vehicles of headings 8701 to 8705 [other than specified parts of tractors] 545. 8709 Works trucks, self-propelled, not fitted with lifting or handling equipment, of the type used in factories, warehouses, dock areas or airports for short distance transport of goods; tractors of the type used on 120 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] railway station platforms; parts of the foregoing vehicles 546. 8711 Motorcycles (including mopeds) and cycles fitted with an auxiliary motor not exceeding 350 cc, with or without side-cars; side-cars 547. 8714 Parts and accessories of vehicles of heading 8711 548. 8715 Baby carriages and parts thereof 549. 8716 Trailers and semi-trailers; other vehicles, not mechanically propelled; parts thereof [other than Self-loading or self-unloading trailers for agricultural purposes, and Hand propelled vehicles (e.g. hand carts, rickshaws and", "metadata": {"source": "gst_9_2025", "chunk_index": 19}}
{"id": "gst_9_2025_20", "text": "the like); animal drawn vehicles] 550. 8801 Balloons and dirigibles, gliders and other non-powered aircraft 551. 8804 Parachutes (including dirigible parachutes and paragliders) and rotochutes; parts thereof and accessories thereto and parts thereof 552. 8805 Aircraft launching gear, deck arrestor or similar gear; ground flying trainers and parts thereof 553. 8807 Parts of goods of heading 8801 554. 8903 Rowing boats and canoes 555. 8908 00 00 Vessels and other floating structures for breaking up 556. 9001 Optical fibres and optical fibre bundles; optical fibre cables other than those of heading 8544; sheets and plates of polarising material; prisms, mirrors and other optical elements, of any material, unmounted, other than such elements of glass not optically worked 557. 9002 Lenses, prisms, mirrors and other optical elements, of any material, mounted, being parts of or fittings for instruments or apparatus, other than such elements of glass not optically worked [other than intraocular lens] 558. 9004 Spectacles [other than corrective]; Goggles [other than corrective] 559. 9005 Binoculars, monoculars, other optical telescopes, and mountings therefor; other astronomical instruments and mountings therefor, but not including instruments for radio-astronomy 560. 9006 Photographic (other than cinematographic) cameras; photographic flashlight apparatus and flashbulbs other than discharge lamps of heading 8539 561. 9007 Cinematographic cameras and projectors, whether or not incorporating sound recording or reproducing apparatus 562. 9008 Image projectors, other than cinematographic; photographic (other than cinematographic) enlargers and reducers 563. 9010 Apparatus and equipment for photographic (including cinematographic) laboratories, not specified or included elsewhere in this Chapter; negatoscopes; projection screens 564. 9011 Compound optical microscopes, including those for photomicrography, cinephotomicrography or microprojection 565. 9012 Microscopes other than optical microscopes; diffraction apparatus 566. 9013 Lasers, other than Laser Diodes; other Optical Appliances and Instruments, not specified or included elsewhere in this Chapter 567. 9014 Direction finding compasses; other navigational instruments and appliances 568. 9015 Surveying (including photogrammetrical surveying), hydrographic, oceanographic, hydrological, meteorological or geophysical instruments and appliances, excluding compasses; rangefinders 569. 9016 Balances of a sensitivity of 5 cg or better, with or without weights 570. 9017 Drawing, marking-out or mathematical calculating instruments (for example, drafting machines, pantographs, protractors, drawing sets, slide rules, disc calculators); instruments for measuring length, for use in the hand (for example, measuring rods and tapes, micrometers, callipers), not specified or included elsewhere in this chapter 571. 9022 Apparatus based on the use of X-rays or of alpha, beta, gamma or other ionizing radiations [other than those for medical, surgical, dental or veterinary uses], including radiography or radiotherapy apparatus, X-ray tubes and other X-ray generators, high tension generators, control panels and desks, screens, examinations or treatment tables, chairs and the like [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 121 572. 9023 Instruments, apparatus and models, designed for demonstrational purposes (for example, in education or exhibitions), unsuitable for other uses 573. 9024 Machines and appliances for testing the hardness, strength, compressibility, elasticity or other mechanical properties of materials (for example, metals, wood, textiles, paper, plastics) 574. 9025 Hydrometers and similar floating instruments, thermometers, pyrometers, barometers, hygrometers and psychrometers, recording or not, and any combination of these instruments [other than thermometers for medical, surgical, dental or veterinary usage] 575. 9026 Instruments and apparatus for measuring or checking the flow, level, pressure or other variables of liquids or gases (for example, flow meters, level gauges, manometers, heat meters), excluding instruments and apparatus of heading 9014, 9015, 9028 or 9032 576. 9027 Instruments and apparatus for physical or chemical analysis (for example, polarimeters, refractometers, spectrometers, gas or smoke analysis apparatus); instruments and apparatus for measuring or checking viscosity, porosity, expansion, surface tension or the like; instruments and apparatus for measuring or checking quantities of heat, sound or light (including exposure meters); microtomes [other than instruments and apparatus for medical, surgical, dental or veterinary uses for physical or chemical analysis] 577. 9028 Gas, liquid or electricity supply or production meters, including calibrating meters therefor 578. 9029 Revolution counters, production counters, taximeters, mileometers, pedometers and the like; speed indicators and tachometers, other than those of heading 9014 or 9015; stroboscopes 579. 9030 Oscilloscopes, spectrum analysers and other instruments and apparatus for measuring or checking electrical quantities, excluding meters of heading 9028; instruments and apparatus for measuring or detecting alpha, beta, gamma, X-ray, cosmic or other ionising radiations 580. 9031 Measuring or checking instruments, appliances and machines, not specified or included elsewhere in this Chapter; profile projectors 581. 9032 Automatic regulating or controlling instruments and apparatus 582. 9033 Parts and accessories (not specified or included elsewhere in this Chapter) for machines, appliances, instruments or apparatus of Chapter 90 583. 9101 Wrist-watches, pocket-watches and other watches, including stop- watches, with case of precious metal or of metal clad with precious metal 584. 9102 Wrist-watches, pocket-watches and other watches, including stop watches, other than those of heading 9101 585. 9103 Clocks with watch movements, excluding clocks of heading 9104 586. 9104 Instrument panel clocks and clocks of a similar type for vehicles, aircraft, spacecraft or vessels 587. 9105 Other clocks 588. 9106 Time of day recording apparatus and apparatus for measuring, recording or otherwise indicating intervals of time, with clock or watch movement or with synchronous motor (for example, time-registers, time-recorders) 589. 9107 Time switches with clock or watch movement or with synchronous motor 590. 9108 Watch movements, complete and assembled 591. 9109 Clock movements, complete and assembled 592. 9110 Complete watch or clock movements, unassembled or partly assembled (movement sets); incomplete watch or clock movements, assembled; rough watch or clock movements 593. 9111 Watch cases and parts thereof 594. 9112 Clock cases and cases of a similar type for other goods of this chapter, and parts thereof 595. 9113 Watch straps, watch bands and watch bracelets, and parts thereof 596. 9114 Other clock or watch parts 122 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] 597. 9201 Pianos, including automatic pianos; harpsi-chords and other keyboard stringed instruments 598. 9202 Other string musical instruments (for example, guitars, violins, harps) 599. 9205 Wind musical instruments (for example, keyboard pipe organs, accordions, clarinets, trumpets, bagpipes), other than fairground organs and mechanical street organs 600. 9206 00 00 Percussion musical instruments (for example, drums, xylophones, cymbols, castanets, maracas) 601. 9207 Musical instruments, the sound of which is produced, or must be amplified, electrically (for example, organs, guitars, accordions) 602. 9208 Musical boxes, fairground organs, mechanical street organs, mechanical singing birds, musical saws and other musical instruments not falling within any other heading of this chapter; decoy calls of all kinds; whistles, call horns and other mouth-blown sound signalling instruments 603. 9209 Parts (for example, mechanisms for musical boxes) and accessories (for example, cards, discs and rolls for mechanical instruments) of musical instruments; metronomes, tuning forks and pitch pipes of all kinds 604. 9301 Military weapons other than revolvers, pistols 605. 9303 Other firearms and similar devices which operate by the firing of an explosive charge (for example, sporting shotguns and rifles, muzzle- loading firearms, very pistols and other devices designed to project only signal flares, pistols and revolvers for firing blank ammunition, captive- bolt humane killers, line-throwing guns) 606. 9304 Other arms (for example, spring, air or gas guns and pistols, truncheons), excluding those of heading 9307 607. 9305 Parts and accessories of", "metadata": {"source": "gst_9_2025", "chunk_index": 20}}
{"id": "gst_9_2025_21", "text": "articles of headings 9301 to 9304 608. 9306 Bombs, grenades, torpedoes, mines, missiles, and similar munitions of war and parts thereof; cartridges and other ammunition and projectiles and parts thereof, including shot and cartridge wads 609. 9307 Swords, cut lasses, bayonets, lances and similar arms and parts thereof and scabbards and sheaths therefor 610. 9401 [other than Seats (other than those of heading 9402), whether or not convertible into 9401 10 00] beds and parts thereof, including seats of a kind used for motor vehicles, other than seats of a kind used for aircraft 611. 9402 Medical, surgical, dental or veterinary furniture (for example, operating tables, examination tables, hospital beds with mechanical fittings, dentists' chairs); barbers' chairs and similar chairs, having rotating as well as both reclining and elevating movements; parts of the foregoing articles 612. 9403 Other furniture [other than furniture wholly made of bamboo, cane or rattan] and parts thereof 613. 9404 Mattress supports; articles of bedding and similar furnishing (for example, mattresses, quilts, eiderdowns, cushions, pouffes and pillows) fitted with springs or stuffed or internally fitted with any material or of cellular rubber or plastics, whether or not covered [other than coir products (except coir mattresses), products wholly made of quilted textile materials not exceeding Rs. 2500 per piece and cotton quilts not exceeding Rs. 2500 per piece] 614. 9405 Luminaires and lighting fittings including searchlights and spotlights and parts thereof, not elsewhere specified or included; illuminated signs, illuminated nameplates and the like, having a permanently fixed light source, and parts thereof not elsewhere specified or included [other than kerosene pressure lantern and parts thereof including gas mantles; hurricane lanterns, kerosene lamp, petromax, glass chimney, and parts thereof 615. 9406 Prefabricated buildings 616. 9503 Electronic Toys like tricycles, scooters, pedal cars etc. (including parts and accessories thereof) 617. 9504 Video game consoles and machines, articles of funfair, table or parlour games, including pintables, billiards, special tables for casino games and automatic bowling alley equipment [other than playing cards, ganjifa [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 123 card, chess board, carom board and other board games of 9504 90 90 like ludo, etc. 618. 9505 Festive, carnival or other entertainment articles, including conjuring tricks and novelty jokes 619. 9506 Articles and equipment for general physical exercise, gymnastics, athletics, swimming pools and padding pools [other than sports goods] 620. 9508 Travelling Circuses and Travelling Menageries; Amusement Park Rides and Water Part Amusements; Fairground Amusements, including Shooting Galleries; Travelling Theatres 621. 9602 Worked vegetable or mineral carving material and articles of these materials moulded or carved articles of wax, of stearin, of natural gums or natural resins or of modelling pastes, and other moulded or carved articles, not elsewhere specified or included; worked, unhardened gelatin (except gelatin of heading 3503) and articles of unhardened gelatin 622. 9606 21 00, 9606 22 00, 9606 Buttons, of plastics not covered with the textile material, of base metals, 29, 9606 30 buttons of coconut shell, button blanks 623. 9603 [other than 9603 10 00 Brushes (including brushes constituting parts of machines, appliances or and 9603 21 00] vehicles), hand operated mechanical floor sweepers, not motorised, mops and feather dusters; prepared knots and tufts for broom or brush making; paint pads and rollers; squeegees (other than roller squeegees) [other than brooms and brushes, consisting of twigs or other vegetable materials bound together, with or without handles, and tooth brushes including dental-plate brushes] 624. 9604 00 00 Hand sieves and hand riddles 625. 9605 Travel sets for personal toilet, sewing or shoe or clothes cleaning 626. 9608 Ball point pens; felt tipped and other porous-tipped pens and markers; fountain pens; stylograph pens and other pens; duplicating stylos; pen holders, pencil holders and similar holders; parts (including caps and clips) of the foregoing articles, other than those of heading 9609 627. 9610 00 00 Boards, with writing or drawing surface, whether or not framed 628. 9611 Date, sealing or numbering stamps, and the like (including devices for printing or embossing labels), designed for operating in the hand; hand- operated composing sticks and hand printing sets incorporating such composing sticks 629. 9612 Typewriter or similar ribbons, inked or otherwise prepared for giving impressions, whether or not on spools or in cartridges; ink-pads, whether or not inked, with or without boxes 630. 9613 Cigarette lighters and other lighters, whether or not mechanical or electrical, and parts thereof other than flints or wicks 631. 9616 Scent sprays and similar toilet sprays, and mounts and heads therefor; powder-puffs and pads for the application of cosmetics or toilet preparations 632. 9617 Vacuum flasks and other vacuum vessels, Complete; parts thereof other than glass inners 633. 9618 Tailors' dummies and other lay figures; automata and other animated displays, used for shop window dressing 634. 9620 00 00 Monopods, bipods, tripods and similar articles 635. 9801 All items of machinery including prime movers, instruments, apparatus and appliances, control gear and transmission equipment, auxiliary equipment (including those required for research and development purposes, testing and quality control), as well as all components (whether finished or not) or raw materials for the manufacture of the aforesaid items and their components, required for the initial setting up of a unit, or the substantial expansion of an existing unit, of a specified: (1) industrial plant, (2) irrigation project, (3) power project, (4) mining project, (5) project for the exploration for oil or other minerals, and (6) such other projects as the Central Government may, having regard to the economic development of the country notify in the Official Gazette in this behalf; and spare parts, other raw materials (including semi-finished materials of consumable stores) not exceeding 10% of the value of the goods specified above, provided that such spare 124 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] parts, raw materials or consumable stores are essential for the maintenance of the plant or project mentioned in (1) to (6) above. 636. 9802 Laboratory chemicals 637. Any Chapter Permanent transfer of Intellectual Property (IP) right 638. Any chapter Supply of any goods other than capital goods and cement falling under chapter heading 2523 in the first schedule to the Customs Tariff Act, 1975 (51 of 1975), by an unregistered person to a promoter for construction of the project on which tax is payable by the promoter as recipient of goods under sub- section 4 of section 9 of the Central Goods and Services Tax Act, 2017 (12 of 2017), as prescribed in notification No. 07 / 2019- Central Tax (Rate), dated 29th March, 2019, published in Gazette of India vide G.S.R. No. 254(E), dated 29th March, 2019 Explanation.- For the purpose of this entry,– (i) the term ―promoter‖ shall have the same meaning as assigned to it in in clause (zk) of section 2 of the Real Estate (Regulation and Development) Act, 2016 (16 of 2016). (ii) ―project‖ shall mean a Real Estate Project (REP) or a Residential Real Estate Project (RREP). (iii) the term ―Real Estate Project (REP)‖ shall have the same meaning as assigned to it in in clause (zn) of section 2 of the Real Estate (Regulation and Development) Act, 2016 (16 of 2016). (iv) ―Residential Real Estate Project (RREP)‖ shall mean", "metadata": {"source": "gst_9_2025", "chunk_index": 21}}
{"id": "gst_9_2025_22", "text": "a REP in which the carpet area of the commercial apartments is not more than 15 per cent. of the total carpet area of all the apartments in the REP. (v) This entry is to be taken to apply to all goods which satisfy the conditions prescribed herein, even though they may be covered by a more specific chapter/ heading/ sub heading or tariff item elsewhere in this notification. 639. Any Chapter Goods which are not specified in Schedule I, III, IV, V, VI or VII 640. 9804 All dutiable articles intended for personal use Schedule III– 20% S. No. Chapter / Heading / Sub- Description of Goods heading / Tariff item (1) (2) (3) 1. 2202 10 All goods (including aerated waters), containing added sugar or other sweetening matter or flavoured 2. 2202 91 00, 2202 99 90 Other non-alcoholic beverages [other than those specified in Schedule I of this notification] 3. 2202 99 90 Caffeinated Beverages 4. 2202 Carbonated beverages of fruit drink or carbonated beverages with fruit juice 5. 8703 Motor cars and other motor vehicles principally designed for the transport of persons (other than those of heading 8702), including station wagons and racing cars, but excluding the goods mentioned against S. Nos., 533, 534, 535, 536, 537, 538 and 539 of Schedule II. 6. 8703 40, 8703 60 Motor vehicles with both spark-ignition internal combustion reciprocating piston engine and electric motor as motors for propulsion, of engine capacity exceeding 1200cc or of length exceeding 4000 mm Explanation.- For the purposes of this entry, the specification of the motor vehicle shall be determined as per the Motor Vehicles Act, 1988 (59 of 1988) and the rules made there under. 7. 8703 50, 8703 70 Motor vehicles with both compression- ignition internal combustion [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 125 piston engine [diesel-or semi diesel] and electric motor as motors for propulsion, of engine capacity exceeding 1500 cc or of length exceeding 4000 mm Explanation.- For the purposes of this entry, the specification of the motor vehicle shall be determined as per the Motor Vehicles Act, 1988 (59 of 1988) and the rules made there under. 8. 8711 Motorcycles of engine capacity exceeding 350 cc 9. 8802 Aircrafts for personal use 10. 8903 Yachts and other vessels for pleasure or sports 11. 9302 Revolvers and pistols, other than those of heading 9303 or 9304 12. 9614 Smoking pipes (including pipe bowls) and cigar or cigarette holders, and parts thereof 13. Any Chapter Specified actionable claim; Explanation: ―specified actionable claim‖ as defined in section 2(102A) of the CGST Act, 2017 means the actionable claim involved in or by way of – (i) betting; (ii) casinos; (iii) gambling; (iv) horse racing; (v) lottery; or (vi) online money gaming; Schedule IV– 1.5% S. No. Chapter / Heading / Description of Goods Sub-heading / Tariff item (1) (2) (3) 1. 7101 Pearls, natural or cultured, whether or not worked or graded but not strung, mounted or set; pearls, natural or cultured, temporarily strung for convenience of transport 2. 7105 Dust and powder of natural or synthetic precious or semi-precious stones 3. 7106 Silver (including silver plated with gold or platinum), unwrought or in semi- manufactured forms, or in powder form 4. 7107 Base metals clad with silver, not further worked than semi-manufactured 5. 7108 Gold (including gold plated with platinum) unwrought or in semi- manufactured forms, or in powder form 6. 7109 Base metals or silver, clad with gold, not further worked than semi- manufactured 7. 7110 Platinum, unwrought or in semi-manufactured forms, or in powder form 8. 7111 Base metals, silver or gold, clad with platinum, not further worked than semi- manufactured 9. 7112 Waste and scrap of precious metal or of metal clad with precious metal; other waste and scrap containing precious metal or precious metal compounds, of a kind used principally for the recovery of precious metal. 10. 7113 Articles of jewellery and parts thereof, of precious metal or of metal clad with precious metal 11. 7114 Articles of goldsmiths' or silversmiths' wares and parts thereof, of precious metal or of metal clad with precious metal 12. 7115 Other articles of precious metal or of metal clad with precious metal 13. 7116 Articles of natural or cultured pearls, precious or semi-precious stones (natural, synthetic or reconstructed) 14. 7117 Imitation jewellery [other than bangles of lac/shellac] 15. 7118 Coin 126 THE GAZETTE OF INDIA : EXTRAORDINARY [PART II—SEC. 3(i)] Schedule V – 0.125% S. No. Chapter / Heading / Description of Goods Sub-heading / Tariff item (1) (2) (3) 1. 7102 Rough diamonds or simply sawn diamonds, industrial or non-industrial 2. 7103 Precious stones (other than diamonds) and semi-precious stones, whether or not worked or graded but not strung, mounted or set; ungraded precious stones (other than diamonds) and semi-precious stones, temporarily strung for convenience of transport 3. 7104 Synthetic or reconstructed precious or semi-precious stones [other than diamonds], whether or not worked or graded but not strung, mounted or set; ungraded synthetic or reconstructed precious or semi-precious stones [other than diamonds], temporarily strung for convenience of transport; synthetic or reconstructed diamonds, unworked or simply sawn or roughly shaped Schedule VI – 0.75% S. No. Chapter / Heading / Description of Goods Sub-heading / Tariff item (1) (2) (3) 1. 7102 Goods other than those specified against S. No. 1 in Schedule V 2. 7104 Goods other than those specified against S. No. 3 in Schedule V Schedule VII – 14% S. No. Chapter / Heading / Description of Goods Sub-heading / Tariff item (1) (2) (3) 1. 2106 90 20 Pan masala 2. 2401 Unmanufactured tobacco; tobacco refuse [other than tobacco leaves] 3. 2402 Cigars, cheroots, cigarillos and cigarettes, of tobacco or of tobacco substitutes 4. 2403 Other manufactured tobacco and manufactured tobacco substitutes; ―homogenised‖ or ―reconstituted‖ tobacco; tobacco extracts and essences (including biris) 5. 2404 11 00 Products containing tobacco or reconstituted tobacco and intended for inhalation without combustion 6. 2404 19 00 Products containing tobacco or nicotine substitutes and intended for inhalation without combustion Explanation.— For the purposes of this notification,— (a) the expressions, - (i) \"unit container\" means a package, whether large or small (for example, tin, can, box, jar, bo ttle, bag, or carton, drum, barrel, or canister) designed to hold a pre-determined quantity or number, w hich is indicated on such package; (ii) ―pre-packaged and labelled‖ means all commodities that are intended for retail sale and containing not more than 25 kg or 25 litre, which are ―pre-packed‖ as defined in clause (l) of section 2 of the Legal Metrology Act, 2009 (1 of 2010) where, the package in which the commodity is pre-packed or a label securely affixed thereto is required to bear the declarations under the provisions of the Legal Metrology Act, 2009 (1 of 2010) and the rules made thereunder; [भाग II—खण् ड 3(i)] भारत का राजपत्र : ऄसाधारण 127 (iii) \"tariff item\", \"sub-heading\", \"heading\" and \"Chapter\" shall mean respectively a tariff item, sub- heading, heading and Chapter as specified in the First Schedule to the Customs Tariff Act, 1975 (51 of 1975); (b) the rules for the interpretation of the First Schedule to the Customs Tariff Act,", "metadata": {"source": "gst_9_2025", "chunk_index": 22}}
{"id": "gst_9_2025_23", "text": "1975 (51 of 1975) including the Section and Chapter Notes and the General Explanatory Notes of the First Schedule shall, so far as may be, apply to the interpretation of this notification; (c) the words and expressions used and not defined in this notification, but defined in the Central Goods and Service Tax Act, 2017 (12 of 2017), the Integrated Goods and Services Tax Act, 2017 (13 of 2017) and the Union Territory Goods and Services Tax Act, 2017 (14 of 2017), shall have the same meanings as assigned to them in those Acts. 2. This notification shall come into force with effect from the 22nd day of September, 2025. [F. No. CBIC-190341/188/2025-TRU] DHEERAJ SHARMA, Under Secy. Uploaded by Dte. of Printing at Government of India Press, Ring Road, Mayapuri, New Delhi-110064 and Published by the Controller of Publications, Delhi-110054.", "metadata": {"source": "gst_9_2025", "chunk_index": 23}}
