{"id": "ltcg_0", "text": "Disclaimer: The contents of this document are for information purposes only. This aims to enable public to have a quick and an easy access to information and do n ot purport to be legal documents. Viewers are advised to verify the content from Government Acts/Rules/Notifications etc. TAX ON LONG-TERM CAPITAL GAINS Introduction Gain arising on transfer of capital asset is charged to tax under the head “Capital Gains”. Income from capital gains is classified as “Short Term Capital Gains” and “Long Term Capital Gains”. In this part you can gain knowledge about the provisions relating to tax on Long Term Capital Gains. Meaning of Capital Gains Profits or gains arising from transfer of a capital asset are called “Capital Gains” and are charged to tax under the head “Capital Gains”. Meaning of Capital Asset Capital asset is defined to include: a) Property of any kind, held by an assessee, whether or not connected with his business or profession; b) Any securities held by a FII which has invested in such securities in accordance with the SEBI Regulations; c) Any securities held by a Category I or Category II AIF which has invested in such securities in accordance with the SEBI or IFSC Regulations; d) Any unit linked insurance policy to which exemption under Section 10(10D) does not apply. However, the following items are excluded from the definition of “capital asset”: (i) any stock-in-trade (other than securities referred to in (b) above), consumable stores or raw materials held for the purposes of his business or profession ; (ii) personal effects, that is, movable property (including wearing apparel and furniture) held for personal use by the taxpayer or any member of his family dependent on him, but excludes— (a) jewellery; (b) archaeological collections; (c) drawings; (d) paintings; (e) sculptures; or (f) any work of art. [As amended by Finance Act, 2025] “Jewellery\" includes— a. ornaments made of gold, silver, platinum or any other precious metal or any alloy containing one or more of such precious metals, whether or not containing any precious or semi-precious stones, and whether or not worked or sewn into any wearing apparel; b. precious or semi-precious stones, whether or not set in any furniture, utensil or other article or worked or sewn into any wearing apparel; (iii) Agricultural Land in India, not being a land situated: a. Within jurisdiction of municipality, notified area committee, town area committee, cantonment board and which has a population of not less than 10,000; b. Within range of following distance measured aerially from the local limits of any municipality or cantonment board: i. not being more than 2 KMs, if population of such area is more than 10,000 but not exceeding 1 lakh; ii. not being more than 6 KMs , if population of such area is more than 1 lakh but not exceeding 10 lakhs; or iii. not being more than 8 KMs , if population of such area is more than 10 lakhs. Population is to be considered according to the figures of last preceding census of which relevant figures have been published before the first day of the year. (iv) 61/2 per cent Gold Bonds,1977 or 7 per cent Gold Bonds, 1980 or National Defence Gold Bonds, 1980 issued by the Central Government; (v) Special Bearer Bonds, 1991; (vi) Gold Deposit Bonds issued under the Gold Deposit Scheme, 1999 or deposit certificates issued under the Gold Monetisation Scheme, 2016. Following points should be kept in mind: The property being capital asset may or may not be connected with the business or profession of the taxpayer. E.g. Bus used to carry passenger by a person engaged in the business of passenger transport will be his capital asset. Any securities held by a Foreign Institutional Investor which has invested in such securities in accordance with the regulations made under the Securities and Exchange Board of India Act, 1992 will always be treated as capital asset, hence, such securities cannot be treated as stock-in-trade. Illustration Mr. Kumar purchased a residential house in January, 2021 for Rs. 84,00,000. He sold the house in April, 2025 for Rs. 90,00,000. In this case residential house is a capital asset of Mr. Kumar and, hence, the gain of Rs. 6,00,000 arising on account of sale of residential house will be charged to tax under the head “Capital Gains”. [As amended by Finance Act, 2025] Illustration Mr. Kapoor is a property dealer. He purchased a flat for resale. The flat was purchased in January, 2021 for Rs. 84,00,000 and sold in April, 2025 for Rs. 90,00,000. In this case Mr. Kapoor is dealing in properties in his normal business. Hence, flat purchased by him would form part of stock-in-trade of the business. In other words, for Mr. Kapoor flat is not a capital asset and, hence, gain of Rs. 6,00,000 arising on account of sale of flat will be charged to tax as business income and not as capital gain. Meaning of long-term capital asset and short-term capital asset For the purpose of taxation, capital assets are classified into two categories as given below : Short-Term Capital Asset Long-Term Capital Asset Any capital asset held by the taxpayer for a Any capital asset held by the taxpayer period of not more than 24 months for a period of more than 24 months immediately preceding the date of its immediately preceding the date of its transfer will be treated as short-term capital transfer will be treated as long-term asset. capital asset. However, in respect of certain assets like However, in respect of certain assets shares (equity or preference) which are like shares (equity or preference) which listed in a recognised stock exchange in are listed in a recognised stock exchange India (listing of shares is not mandatory if in India (listing of shares is not transfer of such shares took place on or mandatory if transfer of such shares before July 10, 2014), units of equity took place on or before July 10, 2014), oriented mutual funds, listed securities like units of equity oriented mutual funds, debentures and Government securities, listed securities like debentures and Units of UTI and Zero Coupon Bonds, the Government securities, Units of UTI period of holding to be considered is 12 and Zero Coupon Bonds, the period of months instead of 24 months holding to be considered is 12 months instead of 24 months Notes: 1) The period of holding shall be considered as 36 months instead of 24 months in case transfer of capital asset takes place before 23-07-2024. 2) For capital assets being unlisted shares of a company or immovable property such as land or buildings, the holding period shall be 24 months to determine whether the asset is classified as short-term or long-term, regardless of whether the transfer occurs before or after 23-07-2024. Illustration Mr. Kumar is a salaried employee. In the month of April, 2016 he purchased a piece of land and sold the same in December, 2025. In this case, land is a capital asset for Mr. Kumar. He purchased land in April, 2016 and sold in December, 2025 i.e. after holding it for a period of more than 24 months. Hence, land will be treated as long-term capital", "metadata": {"source": "ltcg", "chunk_index": 0}}
{"id": "ltcg_1", "text": "asset. [As amended by Finance Act, 2025] Illustration Mr. Raj is a salaried employee. In the month of April, 2024, he purchased a piece of land and sold the same in December, 2025. In this case land is a capital asset for Mr. Raj. He purchased land in April, 2024 and sold it in December, 2025, i.e., after holding it for a period of less than 24 months. Hence, land will be treated as short-term capital asset. Illustration Mr. Vipul is a salaried employee. In the month of July, 2018, he purchased a piece of land and sold the same in January 2025. In this case land is a capital asset for Mr. Vipul and it was sold in the Assessment Year 2025-26. He purchased land in July, 2018 and sold it in January 2025, i.e. after holding it for a period of more than 24 months. Hence land will be treated as long-term capital asset. Illustration Mr. Raj is a salaried employee. In the month of April, 2023 he purchased equity shares of SBI Ltd. (listed in BSE) and sold the same in December, 2024. In this case shares are capital assets for Mr. Raj. He purchased shares in April, 2023 and sold them in December, 2024, i.e., after holding them for a period of more than 12 months. Hence, shares will be treated as long-term capital assets. Illustration Mr. Kumar is a salaried employee. In the month of April, 2024 he purchased equity shares of SBI Ltd. (listed in BSE) and sold the same in January, 2025. In this case shares are capital assets for Mr. Kumar. He purchased shares in April, 2024 and sold them in January, 2025, i.e., after holding them for a period of less than 12 months. Hence, shares will be treated as short-term capital assets. Illustration Mr. Kumar is a salaried employee. In the month of April, 2023 he purchased un-listed shares of XYZ Ltd. and sold the same in January, 2025. In this case shares are capital assets for Mr. Raj and to determine nature of capital gain, period of holding would be considered as 24 months as shares are unlisted. He purchased shares in April, 2023 and sold them in January, 2025, i.e., after holding them for a period of less than 24 months. Hence, shares will be treated as Short Term Capital Assets. Illustration Mr. Raj is a salaried employee. In the month of April, 2014 he purchased un-listed shares of XYZ Ltd. and sold the same in December, 2024. In this case shares are capital assets for Mr. Raj and to determine nature of capital gain, period of holding would be considered as 24 month as shares are unlisted. He purchased shares in April, 2014 and sold them in December 2024, i.e., after holding them for a period of more than 24 months. Hence, shares will be treated as Long Term Capital Assets. Mr. Vikas is a salaried employee. In the month of September, 2018 he purchased unlisted shares of ABC ltd. and sold the same in May 2024. In this case, shares are sold in assessment year 2025-26. Hence, period of holding for unlisted shares to be considered as 24 months. [As amended by Finance Act, 2025] Mr. Vikas purchased shares in September 2018 and sold them May 2024, i.e. after holding them for a period of more than 24 months. Hence, shares will be treated as Long Term Capital Assets. Meaning of short-term capital gain and long-term capital gain Gain arising on transfer of short-term capital asset is termed as short-term capital gain and gain arising on transfer of long-term capital asset is termed as long-term capital gain. However, there are few exceptions to this rule like gain on depreciable asset is always taxed as short-term capital gain. Illustration In April, 2024 Mr. Raja sold his residential house property which was purchased in May, 2003. Capital gain on such sale amounted to Rs. 8,40,000. In this case the house property is a long-term capital asset and, hence, gain of Rs. 8,40,000 will be charged to tax as long-term capital gain. Illustration In April, 2024 Mr. Rahul sold his residential house property which was purchased in May, 2022. Capital gain on such sale amounted to Rs. 8,40,000. In this case the house property is a short-term capital asset and, hence, gain of Rs. 8,40,000 will be charged to tax as short-term capital gain. Reason for bifurcation of capital gains into long-term and short-term gains :– The taxability of capital gains depends on the nature of gain, i.e., whether short-term or long-term. Hence, to determine the taxability, capital gains are classified into short-term capital gain and long-term capital gain. In other words, the tax rates for long-term capital gain and short-term capital gain are different. Computation of long-term capital gains Long-term capital gain arising on account of transfer of long-term capital asset will be computed as follows : Particulars Rs. Full value of consideration (i.e., Sales consideration of asset) XXXXX Less: Expenditure incurred wholly and exclusively in connection with (XXXXX) transfer of capital asset (E.g., brokerage, commission, advertisement expenses, etc.). Net sale consideration XXXXX Less: Indexed cost of acquisition (*) (XXXXX) Less: Indexed cost of improvement if any (*) (XXXXX) Long-Term Capital Gains XXXXX [As amended by Finance Act, 2025] (*) Indexation is a process by which the cost of acquisition is adjusted against inflationary rise in the value of asset. For this purpose, Central Government has notified cost inflation index. The benefit of indexation is available only to long-term capital assets. For computation of indexed cost of acquisition following factors are to be considered:  Year of acquisition/improvement Year of transfer  Cost inflation index of the year of acquisition/improvement Cost inflation index of the year of transfer Note: The Finance (No. 2) Act, 2024 removed the indexation benefit and introduced a uniform tax rate of 12.5% on long-term capital gains. As per the amendment, no indexation benefit is allowed while computing capital gain from long-term capital assets transferred on or after 23-07-2024. However, the Government has introduced a grandfathering provision. This provision allows resident individuals and resident HUFs to still apply indexation on land or building acquired before 23-07-2024 and pay tax at the old rate of 20% if the tax under the new law (i.e., tax calculated at 12.5% without indexation benefit) results in a higher amount. Indexed cost of acquisition is computed with the help of following formula : Cost of acquisition × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of acquisition Indexed cost of improvement is computed with the help of following formula : Cost of improvement × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of improvement The Central Government has notified the following Cost Inflation Indexes:- Sl. No. Financial Year Cost Inflation Index (1) (2) (3) 1 2001-02 100 2 2002-03 105 3 2003-04 109 4 2004-05 113 5 2005-06 117 6 2006-07 122 7 2007-08 129 8 2008-09 137 9 2009-10 148 10 2010-11 167 11 2011-12 184 12 2012-13 200 13 2013-14 220 14 2014-15 240 15 2015-16 254 [As amended", "metadata": {"source": "ltcg", "chunk_index": 1}}
{"id": "ltcg_2", "text": "by Finance Act, 2025] 16 2016-17 264 17 2017-18 272 18 2018-19 280 19 2019-20 289 20 2020-21 301 21 2021-22 317 22 2022-23 331 23. 2023-24 348 24. 2024-25 363 25. 2025-26 376 Illustration Mr. Raja purchased a piece of land in May, 2006 for Rs. 84,000 and sold the same in April, 2024 for Rs. 10,10,000 (brokerage Rs. 10,000). What will be the taxable capital gain in the hands of Mr. Raja? In this case, the capital asset is transferred before 23-07-2024, therefore, the long term capital gain will be computed as per the old provisions of the Act. Computation of capital gain will be as follows : Illustration Mr. Raja purchased a piece of land in May, 2006 for Rs. 84,000 and sold the same in April, 2024 for Rs. 10,10,000 (brokerage Rs. 10,000). What will be the taxable capital gain in the hands of Mr. Raja? In this case, the capital asset is transferred before 23-07-2024, therefore, the long term capital gain will be computed as per the old provisions of the Act. Particulars Rs. Full value of consideration (i.e., Sales consideration of asset) 10,10,000 Less: Expenditure incurred wholly and exclusively in connection with 10,000 transfer of capital asset (brokerage) Net sale consideration 10,00,000 Less: Indexed cost of acquisition (*) 2,49,934 Less: Indexed cost of improvement, if any Nil Long-Term Capital Gains 7,50,066 (*) The cost inflation index notified for the year 2006-07 is 122 and for the year 2024-25 is 363. Hence, the indexed cost of acquisition, i.e., the inflated cost of acquisition will be computed as follows: [As amended by Finance Act, 2025] Cost of acquisition × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of acquisition Rs. 84,000 × 363 = Rs. 2,49,934 122 Illustration Mr. Raja purchased a piece of land in May, 2006 for Rs. 84,000 and sold the same in August, 2024 for Rs. 10,10,000 (brokerage Rs. 10,000). What will be the taxable capital gain in the hands of Mr. Raja? In the instant case, the capital asset is transferred after 23-07-2024, Mr. Raja has option to compute the capital gains as per both provisions [old and new as amended by the Finance (No. 2) Act, 2024] Computation of Long term capital Gains as per the old provisions: Particulars Rs. Full value of consideration (i.e., Sales consideration of asset) 10,10,000 Less: Expenditure incurred wholly and exclusively in connection with 10,000 transfer of capital asset (brokerage) Net sale consideration 10,00,000 Less: Indexed cost of acquisition (*) 2,49,934 Less: Indexed cost of improvement, if any Nil Long-Term Capital Gains 7,50,066 (*) The cost inflation index notified for the year 2006-07 is 122 and for the year 2024-25 is 363. Hence, the indexed cost of acquisition, i.e., the inflated cost of acquisition will be computed as follows: Cost of acquisition × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of acquisition Rs. 84,000 × 363 = Rs. 2,49,934 122 Computation as per the amended provision Particulars Rs. [As amended by Finance Act, 2025] Full value of consideration (i.e., Sales consideration of asset) 10,10,000 Less: Expenditure incurred wholly and exclusively in connection with 10,000 transfer of capital asset (brokerage) Net sale consideration 10,00,000 Less: Cost of acquisition 84,000 Less: Cost of improvement, if any Nil Long-Term Capital Gains 9,16,000 Note: Mr. Raja has option to pay tax at the rate of 20% on Rs. 7,50,066 or at the rate of 12.5% on Rs. 9,16,000, whichever is less. [Tax rates on long-term capital gains are discussed in below paragraph] Tax on long-term capital gain General provision The long-term capital gain is chargeable to tax at the rate of 12.5%. Further, the benefit of indexation shall not be available to the assessee while computing the amount of long-term capital gain. Notes: (1) The Finance (No. 2) Act, 2024 has provided a uniform tax rate of 12.5% on long-term capital gain arising from transfer of any capital asset on or after 23-07-2024. Where the long-term capital asset is transferred on or before 22-07-2024, the long-term capital gain shall be taxable at the rate of 20%. (2) The Finance (No. 2) Act, 2024 has provided that no indexation benefit shall be available in respect of the long-term capital assets transferred on or after 23-07-2024. However, a grandfathering is allowed for land or building in case of resident individual/HUF. (3) As per grandfathering provisions, if the amount of tax under the new law (i.e., the law as amended by the Finance (No. 2) Act, 2024) exceeds the amount of tax under the old law (i.e., the law as it stood immediately before the amendment by the Finance (No. 2) Act, 2024), the excess amount shall be ignored. However, this grandfathering provision applies only to resident individuals or Hindu Undivided Families (HUFs) and only for land or buildings acquired before July 23, 2024. In case of Specified listed securities If the long-term capital gain is arising from the transfer of equity shares, units of equity-oriented fund or units of business trust, it shall be chargeable to tax under Section 112A. The tax shall be levied at the rate of 12.5% (if specified securities are transferred on or before 22-07-2024, the [As amended by Finance Act, 2025] long-term capital gain shall be taxable at the rate of 10%) on the capital gains in excess of Rs. 125,000. This concessional tax rate applies if the Securities Transaction Tax (STT) is paid at the time of transfer of such securities. Further, in case of equity shares, STT should have been paid at the time of acquisition also, subject to certain exceptions. Special provision related to cost of acquisition The cost of acquisitions of a listed equity share acquired by the taxpayer before February 1, 2018, shall be deemed to be the higher of following: a) The actual cost of acquisition of such asset; or b) Lower of following: (i) Fair market value of such shares as on January 31, 2018; or (ii) Actual sales consideration accruing on its transfer. The Fair market value of listed equity share shall mean its highest price quoted on the stock exchange as on January 31, 2018. However, if there is no trading in such shares on January 31, 2018, the highest price of such share on a date immediately preceding January 31, 2018 on which trading happens in that share shall be deemed as its fair market value. In case of units which are not listed on recognized stock exchange, the net asset value of such units as on January 31, 2018 shall be deemed to be its FMV. In a case where the capital asset is an equity share in a company which is not listed on a recognised stock exchange as on 31-1-2018 but listed on the date of transfer, the cost of unlisted shares as increased by cost inflation index for the financial year 2017-18 shall be deemed to be its FMV. Further, the Finance (No. 2) Act, 2024 has also provided mechanism for computation of fair market value of unlisted shares transferred under an offer for sale to the public included in an initial public", "metadata": {"source": "ltcg", "chunk_index": 2}}
{"id": "ltcg_3", "text": "offer. In cases where equity shares were not listed on a recognized stock exchange as of January 31, 2018, or where the shares became the property of the assessee in exchange for unlisted shares as of that date (through transactions not considered as transfers under Section 47), and are subsequently listed on such an exchange after the transfer (pertaining to the sale of unlisted equity shares through an offer for sale to the public as part of an initial public offering); the FMV shall be as follows: Cost Inflation Index of 2017-18 (i.e., 272) Cost of X acquisition CII for the year in which shares were first held by the assessee or 2001-02, whichever is later In case of FPIs or specified category-III AIFs Long-term capital gain arising from transfer of securities held by foreign portfolio investor (FPI) or category-III AIF specified under Section 10(4D) is chargeable to tax at the rate of 12.5% (if securities are transferred on or before 22-07-2024, the long-term capital gain shall be taxable at the rate of 10%). [As amended by Finance Act, 2025] However, where the long-term capital gain arises from the transfer of specified securities, being equity shares, units of equity-oriented mutual fund or units of business trust, the tax shall be levied on the capital gains in excess of Rs. 1,25,000 if STT has been paid in respect of such transaction. Here, it is to be noted that the benefit of foreign currency fluctuation shall not be allowed to FPIs or specified fund while computing capital gain. Illustration Mr. Janak is a salaried employee. In the month of January, 2016 he purchased 100 shares of X Ltd. @ Rs. 1,400 per share from Bombay Stock Exchange. These shares were sold through BSE in August, 2024 @ Rs. 2,600 per share. The highest price of X Ltd. share quoted on the stock exchange on January 31, 2018 was Rs. 1,800 per share. What will be the nature of capital gain in this case? ** Shares were purchased in January, 2016 and were sold in August, 2024, i.e., sold after holding them for a period of more than 12 months and, hence, the gain will be long-term capital gain (LTCG). In the given case, shares are sold after holding them for a period of more than 12 months, shares are sold through recognised stock exchange and the transaction is liable to STT. Therefore, section 112A is applicable in this case. The cost of acquisition of X Ltd. shares shall be higher of: a) Cost of acquisition i.e., 1,40,000 (1,400 × 100); b) Lower of: a. Highest price quoted as on 31-1-2018 i.e., 1,80,000 (1,800 × 100); b. Sales consideration i.e., 2,60,000 (2,600 × 100) Thus, the cost of acquisition of shares shall be Rs. 1,80,000.Accordingly, Long-term capital gains in hands of Mr. Janak would be Rs. 80,000 (i.e., 2,60,000 – 1,80,000). Since long-term capital gains doesn’t exceed Rs. 1,25,000, nothing is taxable in hands of Mr. Janak. Illustration Mr. Saurabh is a salaried employee. In the month of July, 2017 he purchased 100 shares of XYZ Ltd. @ Rs. 2,000 per share from Bombay Stock Exchange. These shares were sold through NSE in June, 2024 @ Rs. 5,200 per share. The highest price of XYZ Ltd. share quoted on the stock exchange on January 31, 2018 was Rs. 3,800 per share. What will be the nature of capital gain in this case? ** Shares were purchased in July, 2017 and were sold in June, 2024, i.e., sold after holding them for a period of more than 12 months and, hence, the gain will be long-term capital gain (LTCG). In the given case, shares are sold after holding them for a period of more than 12 months, shares are sold through a recognised stock exchange, and the transaction is liable to STT. [As amended by Finance Act, 2025] Therefore, section 112A is applicable in this case. The cost of acquisition of XYZ Ltd. shares shall be higher of: a) Cost of acquisition i.e., 2,00,000 (2,000 × 100); b) Lower of: (i) Highest quoted price as on 31-1-2018 i.e., 3,80,000 (3,800 × 100); (ii) Sales consideration i.e., 5,20,000 (5,200 × 100) Thus from above, the cost of acquisition of shares shall be Rs. 3,80,000. Accordingly, Long-term capital gains taxable in hands of Mr. Saurabh would be Rs. 1,40,000 (i.e., 5,20,000 – 3,80,000). Since the long-term capital gains exceeds Rs. 1,25,000, hence it will be chargeable to tax under section 112A. In this case, the shares are transferred before 23-07-2024, Mr, Saurabh would be liable to pay tax at the rate of 10% on Rs. 15,000 i.e., gains exceeding Rs. 1,25,000. However, if the shares were transferred on or after 23-07-2024, Mr. Saurabh would be liable to pay tax at the rate of 12.5% on the capital gains exceeding Rs. 1,25,000. Illustration Mr. Kumar (a non-resident) purchased equity shares (listed) of Shyamal Ltd. in December 1995 for Rs. 28,100. These shares are sold (outside recognised stock exchange) in October, 2025 for Rs. 5,00,000. He does not have any other taxable income in India. What will be his tax liability. ** In this situation, the shares are transferred after 23-07-2024, accordingly, the resultant capital gain will be chargeable to tax at the rate of 12.5%. The capital gain will be computed as follows: Particulars Rs. Full value of consideration 5,00,000 Less: Cost of acquisition 28,100 Taxable Gain 4,71,900 ------ Exemption limit 1,25,000 Capital Gains liable to tax 3,46,900 Tax @ 12.5% on Rs. 4,71,900 ------ 43,362.50 From the above computation, it is clear that Mr. Kumar is liable to pay tax of 43,362.50. (excluding cess as applicable). Illustration Mr. Kumar (a non-resident) purchased a piece of land in December, 2006 for Rs. 28,100 and sold the same, in April, 2024 for Rs. 5,00,000. Can he claim the option of not availing of the indexation and paying tax @ 10% on the capital gain? [As amended by Finance Act, 2025] What if the land was sold in December 2024? ** In this situation, the capital asset is transferred before 23-07-2024, therefore, the resulting capital gain will be computed after giving indexation benefit and chargeable to tax @ 20% (plus surcharge and cess as applicable). The computation in this case will be as follows: Particulars (Rs.) Full value of consideration 5,00,000 Less: Indexed cost of acquisition (Rs. 28,100 × 363/122) 83,609 Less: Indexed cost of improvement Nil Long term capital gain 4,16,391 Tax @ 20% on Rs. 4,16,391 83,278 Add: Health & education cess @ 4% 3,331 Net tax payable 86,609 If Mr. Kumar sold the land in December 2024, the tax liability would be as follows: Since the capital asset, being a land, is sold after 23-07-2024, the amended provisions by the Finance (No.2) Act, 2024 will be applicable to Mr. Kumar. Accordingly, indexation benefit will not be available to Mr. Kumar on such capital asset and tax at the rate of 12.5% will be applicable on the computed capital gains. The Computation of the long term capital gains will be as follows: Particulars (Rs.) Full value of consideration 5,00,000 Less: Cost of acquisition 28,100 Less: Cost of improvement Nil Long term capital gain 4,71,900 Tax @ 12.5%", "metadata": {"source": "ltcg", "chunk_index": 3}}
{"id": "ltcg_4", "text": "on Rs. 4,71,900 58,988 Add: Health & education cess @ 4% 2,360 Net tax payable 61,348 [As amended by Finance Act, 2025] In this case, the capital gain will be computed only as per the amended provisions introduced by the Finance (No.2) Act, 2024. Although the capital asset being sold is a piece of land which was acquired before July 23, 2024, grandfathering provisions are not be applicable as same are applicable only to a resident individuals or HUF. Illustration Mr. Kumar, resident in India, purchased a piece of land in December, 2006 for Rs. 28,100 and sold the same, in December, 2024 for Rs. 5,00,000. What will be the tax liability? Since the capital asset, being a land, is sold after 23-07-2024, the amended provisions by the Finance (No.2) Act, 2024 will be applicable to Mr. Kumar. Accordingly, indexation benefit will not be available to Mr. Kumar on such capital asset and tax at the rate of 12.5% will be applicable on the computed capital gains. The computation of the long term capital gains will be as follows: Particulars (Rs.) Full value of consideration 5,00,000 Less: Cost of acquisition 28,100 Less: Cost of improvement Nil Long term capital gain 4,71,900 Tax @ 12.5% on Rs. 4,71,900 58,988 Add: Health & education cess @ 4% 2,360 Net tax payable 61,348 In this case, the capital asset being sold is a piece of land which was acquired before July 23, 2024, and Mr. Kumar is a resident individual. Therefore, the grandfathering provisions apply. If the tax computed under the new law (i.e., the law as amended by the Finance (No. 2) Act, 2024) exceeds the amount of tax under the old law (i.e., the law as it stood immediately before the amendment by the Finance (No. 2) Act, 2024), the excess amount shall be ignored. The capital gains as per the old provisions will be computed as follows: Particulars (Rs.) Full value of consideration 5,00,000 Less: Indexed cost of acquisition (Rs. 28,100 × 363/122) 83,609 Less: Indexed cost of improvement Nil [As amended by Finance Act, 2025] Long term capital gain 4,16,391 Tax @ 20% on Rs. 4,16,391 83,278 Add: Health & education cess @ 4% 3,331 Net tax payable 86,609 In this case, the tax liability is lower under the old law. Therefore, Mr. Kumar can pay the tax calculated under the old law, and the additional tax computed under the new law shall be ignored. Adjustment of LTCG against the basic exemption limit Basic exemption limit means the level of income up to which a person is not required to pay any tax. The basic exemption limit applicable in case of an individual for the financial year 2025-26 will be Rs. 3,00,000. However, where an individual chooses to opt out from the default tax regime under section 115BAC is as follows :  For resident individual of the age of 80 years or above, the exemption limit is Rs. 5,00,000.  For resident individual of the age of 60 years or above but below 80 years, the exemption limit is Rs. 3,00,000.  For resident individual of the age of below 60 years, the exemption limit is Rs. 2,50,000. For non-resident individual, irrespective of the age of the individual, the exemption limit is Rs. 2,50,000. For HUF, the exemption limit is Rs. 2,50,000. Illustration: Basic exemption limit Mr. Kapoor (resident and age 25 years) is a salaried employee earning a salary of Rs. 1,84,000 per annum. Apart from salary income, he has earned interest on fixed deposit of Rs. 6,000. He does not have any other income. What will be his tax liability for the year 2025-26? ** The basic exemption limit for an individual is Rs. 3,00,000. However, For resident individual of age of below 60 years, the basic exemption limit is Rs. 2,50,000 if he chooses to opt out of the default tax regime under section 115BAC. In this case the taxable income of Mr. Kapoor is Rs. 1,90,000 (Rs. 1,84,000 + Rs. 6,000), which is below the basic exemption limit, hence, his tax liability will be nil. Illustration: Basic exemption limit Mr. Viren (resident and age 62 years) is a businessman. His taxable income for the year 2025-26 is Rs. 2,25,200. He does not have any other income. What will be his tax liability for the year 2025-26? ** [As amended by Finance Act, 2025] The basic exemption limit for an individual is Rs. 3,00,000 (Rs. 2,50,000 if he chooses to opt out of the default tax regime under section 115BAC). In this case, the taxable income of Mr. Viren is Rs. 2,25,200, which is below the basic exemption limit, hence, his tax liability will be nil. Illustration: Basic exemption limit Mrs. Raj (resident and age 82 years) is a doctor. Her taxable income for the year 2025-26 is Rs. 4,84,000. She does not have any other income. What will be her tax liability for the year 2025-26? ** The basic exemption limit for an individual is Rs. 3,00,000. However, for resident individual of the age of 80 years and above, the basic exemption limit is Rs. 5,00,000, if he chooses to opt out of the default tax regime under section 115BAC. In this case, the taxable income of Mrs. Raj is Rs. 4,84,000, which is below the basic exemption limit of Rs. 5,00,000, hence, her tax liability will be nil. Illustration: Basic exemption limit Mr. Raj (a non-resident and age 82 years) is a retired person. He is residing in Canada. He owns a house in Mumbai which is given on rent. The taxable rental income for the year 2025-26 amounts to Rs. 1,84,000. What will be his tax liability for the year 2025- 26? ** For non-resident individual, irrespective of the age, the basic exemption limit is Rs. 3,00,000 (Rs. 2,50,000 if he chooses to opt out of the default tax regime under section 115BAC). In this case the taxable income of Mr. Raj is Rs. 1,84,000, which is below the basic exemption limit, hence, his tax liability will be nil. Adjustment of LTCG against the basic exemption limit In the preceding illustrations we observed that if the income is below the basic exemption limit, then there will be no tax liability. Now a question arises that can an individual adjust the basic exemption limit against long-term capital gain? The answer will depend on the residential status of the individual (i.e., resident or non-resident). The provisions in this regard are as follows : Only a resident individual/HUF can adjust the exemption limit against LTCG. Thus, a non-resident individual and non-resident HUF cannot adjust the exemption limit against LTCG. A resident individual can adjust the LTCG but such adjustment is possible only after making adjustment of other income. In other words, first income other than LTCG is to be adjusted against the exemption limit and then the remaining limit (if any) can be adjusted against LTCG. Illustration Mr. Kapoor (age 67 years and resident) is a retired person. He purchased a piece of land in December, 2014 and sold the same in April, 2025. Taxable long-term capital gain on such sale amounted to Rs. 1,84,000. Apart from gain on sale of land, he is not", "metadata": {"source": "ltcg", "chunk_index": 4}}
{"id": "ltcg_5", "text": "having any other income. What will be his tax liability for the year 2025-26? * [As amended by Finance Act, 2025] For resident individual of the age of 60 years and above but below 80 years, the basic exemption limit is Rs. 3,00,000. Further, a resident individual can adjust the basic exemption limit against LTCG. In this case, LTCG of Rs. 1,84,000 can be adjusted against the basic exemption limit. In other words, Mr. Kapoor can adjust the LTCG on sale of land against the basic exemption limit. Considering the above discussion, the tax liability of Mr. Kapoor for the year 2025-26 will be nil. Illustration Mr. Kapoor (age 67 years and non-resident) is a retired person. He purchased a piece of land (at Delhi) in December, 2014 and sold the same in April, 2025. Taxable long-term capital gain on such sale amounted to Rs. 1,84,000. Apart from gain on sale of land, he is not having any other income. What will be his tax liability for the year 2025-26? * For non-resident individual of any age, the basic exemption limit is Rs. 3,00,000 (Rs. 2,50,000 if opts out of the default tax regime). Further, a non-resident individual cannot adjust the basic exemption limit against LTCG. Hence, in this case the exemption limit cannot be adjusted against LTCG. In other words, Mr. Kapoor cannot adjust the LTCG on sale of land against the basic exemption limit. Thus, LTCG of Rs. 1,84,000 will be charged to tax @ 20% (plus health & education cess @ 4%). Thus, the tax liability will come to Rs. 38,272. Illustration Mr. Kapoor (age 67 years and resident) is a retired person earning a monthly pension of Rs. 5,000. He purchased gold in December, 2013 and sold the same in April, 2025. Taxable LTCG amounted to Rs. 3,70,000. Apart from pension income and gain on sale of gold he is not having any other income. What will be his tax liability for the year 2025- 26? Assume, Mr. Kapoor has opted out from default new tax regime (section 115BAC). * For resident individual of the age of 60 years and above but below 80 years, the basic exemption limit is Rs. 3,00,000. Further, a resident individual can adjust the basic exemption limit against LTCG. However, such adjustment is possible only after adjusting income other than LTCG. In this case, he is having pension income of Rs. 60,000 (Rs. 5,000 × 12) and LTCG on gold of Rs. 3,70,000. Thus, first we have to adjust the pension income against the exemption limit and the balance limit will be adjusted against LTCG. The basic exemption limit in this case is Rs. 3,00,000, after adjustment of pension income of Rs. 60,000 from the exemption limit of Rs. 3,00,000 the balance limit available will come to Rs. 2,40,000. The balance of Rs. 2,40,000 will be adjusted against LTCG. Total LTCG on gold is Rs. 3,70,000 and the available limit is Rs. 2,40,000, hence, the balance LTCG left after adjustment of Rs. 2,40,000 will come to Rs. 1,30,000. The gain of Rs. 1,30,000 will be charged to tax @ 20% (plus health & education cess @ 4%). Thus, the tax liability before cess will come to Rs. 26,000 and after deducting rebate of Rs. 12,500 as per section 87A, he would be liable to pay tax of Rs. 14,040 (including health & education cess @ 4%). [As amended by Finance Act, 2025] Illustration Mr. Gagan (age 67 years and non-resident) is a retired person earning a monthly pension of Rs. 5,000 from Indian employer. He purchased a piece of land in Delhi in December, 2013 and sold the same in April, 2025. Taxable LTCG amounted to Rs. 2,20,000. Apart from pension income and gain on sale of land he is not having any other income. What will be his tax liability for the year 2025-26? * For non-resident individuals, irrespective of age, the basic exemption limit is Rs. 3,00,000 (Rs. 2,50,000 if opts out from the default tax regime). Further, a non-resident individual cannot adjust the basic exemption limit against LTCG covered under section 112. In other words, Mr. Gagan can adjust the pension income against the basic exemption limit but the remaining exemption limit cannot be adjusted against LTCG on sale of land. The basic exemption limit in this case will be adjusted against pension income of Rs. 60,000. The balance limit cannot be adjusted against LTCG. Hence, in this case Mr. Gagan has to pay tax @ 20% (plus health & education cess @ 4%) on LTCG of Rs. 2,20,000. Thus, the tax liability will come to Rs. 45,760. Deductions under sections 80C to 80U and LTCG No deduction under sections 80C to 80U is allowed from long-term capital gains. Illustration Mr. Kapoor (age 57 years and resident) is a retired person. He purchased a piece of land in December, 2013 and sold the same in April, 2025. Taxable LTCG on such sale amounted to Rs. 6,00,000. Apart from gain on sale of land he is not having any income. He deposited Rs. 1,00,000 in Public Provident Fund (PPF) and Rs. 50,000 in NSC. He wants to claim deduction under section 80C on account of Rs. 1,50,000 deposited in PPF and NSC. Can he do so? ** Deduction under sections 80C to 80U cannot be claimed from long-term capital gains. Hence, Mr. Kapoor cannot claim deduction under section 80C of Rs. 1,50,000 from LTCG of Rs. 6,00,000. The taxable income of Mr. Kapoor will be computed as follows : Particulars Rs. Long-Term Capital Gains 6,00,000 Gross Total Income 6,00,000 Less: Deduction under sections 80C to 80U Nil Total Income or Taxable Income 6,00,000 He can claim basic exemption of Rs. 2,50,000 (being resident individual) and has to pay LTCG on remaining Rs. 3,50,000 @ 20% (+HEC). Thus, his tax liability before cess will come to Rs. 70,000 and he would be liable to pay tax of Rs. 72,800 (including cess @ [As amended by Finance Act, 2025] 4%). [As amended by Finance Act, 2025] MCQ ON TAX ON LONG-TERM CAPITAL GAINS Q1. Any securities held by a Foreign Institutional Investor which has invested in such securities in accordance with the regulations made under the Securities and Exchange Board of India Act, 1992 will always be treated as capital asset, hence, such securities cannot be treated as stock-in-trade. (a) True (b) False Correct answer : (a) Justification of correct answer : Any securities held by a Foreign Institutional Investor which has invested in such securities in accordance with the regulations made under the Securities and Exchange Board of India Act, 1992 will always be treated as capital asset, hence, such securities cannot be treated as stock-in-trade. Thus, the statement given in the question is true and hence, option (a) is the correct option. Q2. Listed equity shares will be treated as long-term capital assets if they are held by the taxpayer for a period of more than months immediately preceding the date of its transfer. (a) 12 (b) 24 (c) 36 (d) 48 Correct answer : (a) Justification of correct answer : Any capital asset held by the taxpayer for a period of more than 24 months immediately preceding the", "metadata": {"source": "ltcg", "chunk_index": 5}}
{"id": "ltcg_6", "text": "date of its transfer will be treated as long-term capital asset. However, in respect of certain capital assets like shares (equity or preference) which are listed in a recognised stock exchange in India, units of equity oriented mutual funds, listed debentures, zero coupon bonds and Government securities the period of holding will be 12 months instead of 24 months. Thus, option (a) is the correct option. Q3. In computing indexed cost of acquisition is not required. (a) Cost of acquisition (b) Cost inflation index of the year of improvement of capital asset (c) Cost inflation index of the year of acquisition of capital asset (d) Cost inflation index of the year of transfer of capital asset Correct answer : (b) Justification of correct answer : [As amended by Finance Act, 2025] Indexed cost of acquisition is computed with the help of following formula: Cost of acquisition × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of acquisition Thus, option (b) is the correct option. Q4. Indexed cost of improvement is computed with the help of following formula: Cost of improvement × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of improvement (a) True (b) False Correct answer : (a) Justification of correct answer : Indexed cost of improvement is computed with the help of following formula: Cost of improvement × Cost inflation index of the year of transfer of capital asset Cost inflation index of the year of improvement Thus, the statement given in the question is true and hence, option (a) is the correct option. Q5. As per section , long-term capital gain arising in excess of Rs. 1,25,000 on transfer of equity shares or units of equity oriented mutual fund or units of business trust is chargeable to tax @ 12.5% in the hands of any person, if specific conditions are satisfied in this regard. a) 10(38) b) 112 c) 112A d) 115 Correct answer : (c) Justification of correct answer : As per section 112A, long-term capital gain arising in excess of Rs. 1,25,000 on transfer of equity shares or units of equity oriented mutual fund or units of business trust is chargeable to tax @ 12.5% in the hands of any person, if specific conditions are satisfied in this regard. Q6. Generally, long-term capital gain is charged to tax under section 112 @ (plus surcharge and cess as applicable) if the asset is transferred before 23-07-2024. (a) 10% (b) 15% (c) 20% (d) 30% Correct answer : (c) Justification of correct answer : [As amended by Finance Act, 2025] Generally, long-term capital gain is charged to tax @ 20% (plus surcharge and cess as applicable) under section 112, if the asset is transferred before 23-07-2024. However, if the asset is transferred on or after 23-07-2024, the long-term capital gains will be chargeable to tax at the rate of 12.5%. Thus, option (c) is the correct option. Q7. A resident as well as a non-resident individual and HUF can adjust the exemption limit against long-term capital gains. (a) True (b) False Correct answer : (b) Justification of correct answer : Only a resident individual and resident HUF can adjust the exemption limit against LTCG. Thus, a non-resident individual/HUF cannot adjust the exemption limit against LTCG. Thus, the statement given in the question is false and hence, option (b) is the correct option. Q8. No deduction under sections 80C to 80U is allowed from long-term capital gains. (a) True (b) False Correct answer : (a) Justification of correct answer : No deduction under sections 80C to 80U is allowed from long-term capital gains. Thus, the statement given in the question is true and hence, option (a) is the correct option. [As amended by Finance Act, 2025]", "metadata": {"source": "ltcg", "chunk_index": 6}}
