{"id": "presumptive_0", "text": "PPRREESSUUMMPPTTIIVVEE TTAAXXAATTIIOONN Income Tax Department Central Board of Direct Taxes 1 What is Presumptive Taxation? To give relief to small taxpayers from the tedious job of maintenance of books of account and getting the books of account audited, the Income tax Act has framed the Presumptive Taxation Scheme under sections 44AD, 44ADA and 44AE of the Income Tax Act, 1961. The taxpayer adopting the Presumptive Taxation scheme can declare income at a prescribed rate instead. 2 Who is eligible for Presumptive Taxation u/s 44AD? Category of assessees eligible for Presumptive Taxation u/s section 44AD: An Individual, Hindu undivided family or a partnership firm, who is a resident, but not a limited liability partnership firm as defined under clause (n) of sub-section (1) of section 2 of the Limited Liability Partnership Act, 2008 (6 of 2009). The eligible assessee must be carrying on any business except the business of plying, hiring or leasing goods carriages referred to in section 44AE; and whose total turnover or gross receipts in the previous year does not exceed an amount of two crore rupees. Category of Persons not eligible for Presumptive Taxation u/s 44AD. (i) Non residents; (ii) Persons who have made any claims towards deductions under any of the section 10A, 10AA, 10B, 10BA or deduction under any provisions of Chapter VIA under the heading “C- deductions in respect of certain incomes” in the relevant year; (iii) a person carrying on any agency business; (iv) a person carrying on profession as referred to in sub-section (1) of section 44AA; (v) a person earning income in the nature of Commission or Brokerage/ Insurance Agents; (vi) Companies & LLPs. 3 Who is eligible for Presumptive Taxation u/s 44ADA? A person resident in India and engaged in following professions- a. Legal b. Medical c. Engineering d. Architecture e. Accountancy f. Technical consultancy g. Interior Decoration or h. Other professions notified by CBDT, whose gross receipts/turnover during the financial year does not exceed Rs. 50 Lakh. Note: The Finance Act, 2021 has amended provisions of section 44ADA to define eligible assessee. W.e.f. Assessment Year 2021-22, the benefit of section 44ADA is eligible only in case of assessee who is an Individual or a Partnership firm other than a Limited Liability Partnership as defined under clause (n) of sub-section (1) of section 2 of Limited Liability Partnership Act, 2008, who is a resident in India. A person who claims that his profits and gains from the profession are lower than the profits and gains specified (i.e. less than 50%) and whose total income exceeds the maximum amount which is not chargeable to tax, then he is required to maintain the books of account as per the provisions of section 44AA and has to get his accounts audited as per section 44AB. 4 Who is eligible for Presumptive Taxation u/s 44AE? Any Person (i.e. an individual, HUF, firm, company, etc) engaged in the business of plying, hiring or leasing of goods carriages and who does not own more than 10 goods carriages at any time during the year. ; 5 What are the benefits of disclosing income under the Presumptive Taxation Scheme? (i) No need to maintain books of accounts or carry out Income Tax audit of accounts as prescribed under section 44AA or 44AB as the case may be. (ii) Any person opting for the Presumptive Taxation scheme is liable to pay whole amount of advance tax on or before 15 March of the previous year. In other words, it is not necessary for such persons to pay due instalments of Advance tax on 15th June, 15th of September and 15th of December of the previous year, as applicable to other taxpayers not covered under this scheme. (iii) Income tax returns (ITRs) can be filed in simpler and shorter form ITR-4 (Sugam). (iv) Reduces compliance burden and facilitates ease of doing business. 6 How to compute Income under Presumptive Taxation Scheme? (i) Sec 44AD: 8% of the turnover or gross receipts of the eligible business during the financial year is deemed to be the total (taxable) income. In order to promote digital transactions and to encourage small unorganized business to accept digital payments, income shall be computed at the rate of 6% instead of 8% for turnover/gross receipts which are received by account payee cheque or account payee bank draft or use of electronic clearing system through a bank account during the previous year or before the due date for filing of Return of income. (ii) Sec 44DA: 50% of the total gross receipts. (iii) Sec 44AE: For heavy goods vehicles-@ Rs. 1,000 per ton of gross vehicle weight for every month or part of a month. For other vehicles - @ Rs. 7,500 for every month or part of a month. (iv) The Presumptive income computed as per the prescribed rate is the final income and no further deductions/expenditure for business/ profession/ income are allowed. (v) Option to declare income at higher rate than the prescribed rate. 7 Deductions available under Presumptive Taxation scheme (i) Under the normal provisions of the Income-tax Act, taxable business/professional income will be computed after allowing deduction in respect of expenses which are deductible as per the Income- tax Act. (ii) However, in the case of a person who is opting for the Presumptive Taxation Scheme, the presumptive income computed as per the prescribed rate is the final income and no further deductions/expenditure for business/ profession/ income are allowed. The only exception is for partnership firm, claiming benefits of Presumptive Taxation Scheme under section 44AE, the firm can claim deduction on account of remuneration and interest paid to partners as allowable under Income Tax Act. (iii) No separate deduction on account of depreciation is available. However, the written down value of any asset used in such business shall be calculated as if depreciation as per section 32 is claimed and has been actually allowed. 8 Consequences if a person opts out from the Presumptive Taxation scheme u/s 44 AD. If a person opts for presumptive taxation scheme, then he is also required to follow the same scheme for the next 5 years. If he fails to do so, then presumptive taxation scheme will not be available to him for the next 5 years. ihleD weN ,esrevinU gntinirP lecxE :yb detnirP dna dengiseD 2202 ,yraunaJ Further, he would be required to keep and maintain books of account and he will also be liable for Income Tax audit from the AY in which he opts out from the presumptive taxation scheme, if his total income exceeds the minimum taxable limit. 9 Can a higher or lower income be declared under Presumptive Taxation? (i) A person may voluntarily disclose his business income at rates more than those prescribed under section 44AD, 44ADA and 44AE. (ii) A person can declare his income at a rate lower than those prescribed under section 44AD, 44ADA and 44AE. However, then he is required to maintain the books of account and to get his accounts audited as prescribed under section 44AA or 44AB as the case may be. incometaxindiaofficial IncomeTaxIndia IncomeTaxIndia.Official Income Tax India DIRECTORATE OF INCOME-TAX (Public Relations, Publications & Publicity) 6th Floor, Mayur Bhawan, New Delhi This Brochure should", "metadata": {"source": "presumptive", "chunk_index": 0}}
{"id": "presumptive_1", "text": "not be construed as an exhaustive statement of the law. For details reference should always be made to the relevant provisions in the Acts and the Rules www.incometax.gov.in", "metadata": {"source": "presumptive", "chunk_index": 1}}
