{"id": "stcg_0", "text": "Disclaimer: The contents of this document are for information purposes only. This aims to enable public to have a quick and an easy access to information and do n ot purport to be legal documents. Viewers are advised to verify the content from G overnment Acts/Rules/Notifications etc. TAX ON SHORT-TERM CAPITAL GAINS Introduction Gain arising on transfer of capital asset is charged to tax under the head “Capital Gains”. Income from capital gains is classified as “Short Term Capital Gains” and “Long Term Capital Gains”. In this part you can gain knowledge about the provisions relating to tax on Short Term Capital Gains. Meaning of Capital Gains Profits or gains arising from transfer of a capital asset are called “Capital Gains” and are charged to tax under the head “Capital Gains”. Meaning of Capital Asset Capital asset is defined to include: a) Property of any kind, held by an assessee, whether or not connected with his business or profession; b) Any securities held by a FII which has invested in such securities in accordance with the SEBI Regulations; c) Any securities held by a Category I or Category II AIF which has invested in such securities in accordance with the SEBI or IFSC Regulations; d) Any unit linked insurance policy to which exemption under Section 10(10D) does not apply. However, the following items are excluded from the definition of “capital asset”: i. any stock-in-trade (other than securities referred to in (b) above), consumable stores or raw materials held for the purposes of his business or profession ; ii. personal effects, that is, movable property (including wearing apparel and furniture) held for personal use by the taxpayer or any member of his family dependent on him, but excludes— (a) jewellery; (b) archaeological collections; (c) drawings; (d) paintings; [As amended by Finance Act, 2025] (e) sculptures; or (f) any work of art. “Jewellery\" includes— (a) ornaments made of gold, silver, platinum or any other precious metal or any alloy containing one or more of such precious metals, whether or not containing any precious or semi-precious stones, and whether or not worked or sewn into any wearing apparel; (b) precious or semi-precious stones, whether or not set in any furniture, utensil or other article or worked or sewn into any wearing apparel; iii. Agricultural Land in India, not being a land situated: a. Within jurisdiction of municipality, notified area committee, town area committee, cantonment board and which has a population of not less than 10,000; b. Within range of following distance measured aerially from the local limits of any municipality or cantonment board: i. not being more than 2 KMs, if population of such area is more than 10,000 but not exceeding 1 lakh; ii. not being more than 6 KMs , if population of such area is more than 1 lakh but not exceeding 10 lakhs; or iii. not being more than 8 KMs , if population of such area is more than 10 lakhs. Population is to be considered according to the figures of last preceding census of which relevant figures have been published before the first day of the year. iv. 6.5 per cent Gold Bonds,1977 or 7 per cent Gold Bonds, 1980 or National Defence Gold Bonds, 1980 issued by the Central Government; v. Special Bearer Bonds, 1991; vi. Gold Deposit Bonds issued under the Gold Deposit Scheme, 1999 or deposit certificates issued under the Gold Monetisation Scheme, 2015. Following points should be kept in mind: The property being capital asset may or may not be connected with the business or profession of the taxpayer. E.g. Bus used to carry passenger by a person engaged in the business of passenger transport will be his capital asset. Any securities held by a Foreign Institutional Investor which has invested in such securities in accordance with the regulations made under the Securities and Exchange Board of India Act, 1992 will always be treated as capital asset, hence, such securities cannot be treated as stock-in-trade. Illustration Mr. Kumar purchased a residential house in January, 2024 for Rs. 84,00,000. He sold the house in April, 2025 for Rs. 90,00,000. In this case residential house is a capital asset for Mr. Kumar and, hence, the gain of Rs. 6,00,000 arising on account of sale of residential house will be treated as capital gains and will be charged to tax under the head “Capital Gains”. Illustration [As amended by Finance Act, 2025] Mr. Kapoor is a property dealer. He purchased a flat for resale. The flat was purchased in January, 2024 for Rs. 84,00,000 and sold in August, 2025 for Rs. 90,00,000. In this case, Mr. Kapoor is dealing in properties is his ordinary business. Hence, flat so purchased by him would form part of stock-in-trade of the business. In other words, for Mr. Kapoor flat is not a capital asset and, hence, gain of Rs. 6,00,000 arising on account of sale of flat will be charged to tax as business income and not as capital gains. Meaning of short-term capital asset and long-term capital asset For the purpose of taxation, capital assets are classified into two categories as given below: Short-Term Capital Asset Long-Term Capital Asset Any capital asset held by the taxpayer for Any capital asset held by the taxpayer a period of not more than 24 months for a period of more than 24 months immediately preceding the date of its immediately preceding the date of its transfer will be treated as short-term transfer will be treated as long-term capital asset. capital asset. However, in respect of certain assets like However, in respect of certain assets like shares (equity or preference) which are shares (equity or preference) which are listed in a recognised stock exchange in listed in a recognised stock exchange in India (listing of shares is not mandatory if India (listing of shares is not mandatory transfer of such shares took place on or if transfer of such shares took place on or before July 10, 2014), units of equity before July 10, 2014), units of equity oriented mutual funds, listed securities oriented mutual funds, listed securities like like debentures and Government debentures and Government securities, securities, Units of UTI and Zero Units of UTI and Zero Coupon Bonds, the Coupon Bonds, the period of holding to period of holding to be considered is 12 be considered is 12 months instead of 24 months instead of 24 months months Notes: 1) The period of holding shall be considered as 36 months instead of 24 months in case transfer of capital asset takes place before 23-07-2024. 2) For capital assets being unlisted shares of a company or immovable property such as land or buildings, the holding period shall be 24 months to determine whether the asset is classified as short-term or long-term, regardless of whether the transfer occurs before or after 23-07-2024. Illustration (1) Mr. Kumar is a salaried employee. In the month of April, 2024 he purchased gold and sold the same in December, 2025. In this case gold is capital asset for Mr. Kumar. He purchased gold in April, 2024 and sold it in December, 2025, i.e., after holding it for a period of less than 24 months. Hence, gold", "metadata": {"source": "stcg", "chunk_index": 0}}
{"id": "stcg_1", "text": "will be treated as Short Term Capital Asset. Illustration [As amended by Finance Act, 2025] (2) Mr. Raj is a salaried employee. In the month of April, 2021 he purchased gold and sold the same in August, 2025. In this case gold is capital asset for Mr. Raj. He purchased gold in April, 2021 and sold it in August, 2025, i.e., after holding it for a period of more than 24 months. Hence, gold will be treated as Long Term Capital Asset. Illustration (3) Mr. Kumar is a salaried employee. In the month of April, 2025 he purchased equity shares of SBI Ltd. (listed in BSE) and sold the same in January, 2026. In this case share are capital assets for Mr. Kumar. He purchased shares in April, 2025 and sold them in January, 2026, i.e., after holding them for a period of less than 12 months. Hence, shares will be treated as Short Term Capital Assets. Illustration (4) Mr. Raj is a salaried employee. In the month of April, 2025 he purchased equity shares of SBI Ltd. (listed in BSE) and sold the same in December, 2026. In this case shares are capital assets for Mr. Raj. He purchased shares in April, 2025 and sold them in December 2026, i.e., after holding them for a period of more than 12 months. Hence, shares will be treated as Long Term Capital Assets. Illustration (5) Mr. Vikas is a salaried employee. In the month September, 2022 he purchased unlisted shares of ABC ltd. and sold the same in May 2025. In this case, Mr. Vikas purchased shares in September 2022 and sold them in May 2025, i.e. after holding them for a period of less than 24 months. Hence, shares will be treated as Short Term Capital Assets. Illustration (6) Mr. Kumar is a salaried employee. In the month September, 2022 he purchased a house and sold the same in May 2025. Mr. Vikas sold house after holding them for a period of less than 24 months. Hence, house will be treated as Short Term Capital Assets. Meaning of short-term capital gain and long-term capital gain Capital gain arising on sale of short-term capital asset is termed as short-term capital gain and capital gain arising on transfer of long-term capital asset is termed as long-term capital gain. However, there are a few exceptions to this rule, like gain on depreciable asset is always taxed as short-term capital gain. Illustration In January, 2025 Mr. Raja sold his residential house property which was purchased in May, 2005. Capital gain on such sale amounted to Rs. 8,40,000. In this case the house is sold after holding it for a period of more than 24 months and, hence, capital gain of Rs. 8,40,000 will be charged to tax as Long Term Capital Gain. [As amended by Finance Act, 2025] Illustration In April, 2025 Mr. Rahul sold his residential house property which was purchased in May, 2023. Capital gain on such sale amounted to Rs. 8,40,000. In this case the house property is sold after holding for a period of less than 24 months and, hence, gain of Rs. 8,40,000 will be charged to tax as Short Term Capital Gain. Reason for bifurcation of capital gains into long-term and short-term The taxability of capital gains depends on the nature of gain, i.e., whether short-term or long-term. Hence, to determine the taxability, capital gains are to be classified into short- term and long-term. In other words, the tax rates for long-term capital gain and short-term capital gain are different. Computation of Short-Term Capital Gains Short-term capital gain arising on account of transfer of short-term capital asset is computed as follows : Particulars Rs. Full value of consideration (i.e., Sales value of the asset) XXXXX Less: Expenditure incurred wholly and exclusively in connection with (XXXXX) transfer of capital asset (E.g., brokerage, commission, etc.). Net Sale Consideration XXXXX Less: Cost of acquisition (i.e., the purchase price of the capital asset) (XXXXX) Less: Cost of improvement (i.e., post purchases capital expenses on (XXXXX) improvement of capital asset ) Short-Term Capital Gains XXXXX Illustration Mr. Kaushal is a salaried employee. In the month of December, 2024 he purchased gold worth Rs. 8,40,000 and sold the same in August, 2025 for Rs. 9,00,000. At the time of sale of gold, he paid brokerage of Rs. 10,000. What is the amount of taxable capital gain? ** Gold was purchased in December, 2024 and sold in August, 2025, i.e., sold after holding it for a period of less than 24 months and, hence, the gain will be short-term capital gain. The gain will be computed as follows : Particulars Rs. Full value of consideration (i.e., Sales consideration) 9,00,000 Less: Expenditure incurred wholly and exclusively in connection with (10,000) transfer of capital asset (i.e., brokerage) Net sale consideration 8,90,000 Less: Cost of acquisition (i.e., the purchase price of the capital asset) (8,40,000) [As amended by Finance Act, 2025] Less: Cost of improvement (i.e., post purchases capital expenses on Nil improvement of capital asset ) Short-Term Capital Gains 50,000 [As amended by Finance Act, 2025] Short-Term Capital Gains (STCG) arising on account of sale of equity shares listed in a recognised stock exchange, units of equity oriented mutual fund and units of business trust i.e., STCG covered under section 111A Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds (*) or units of business trust, which are transferred on or after 1-10-2004 through a recognised stock exchange and such transaction is liable to securities transaction tax (STT). (*) Equity oriented mutual fund means a mutual fund specified under section 10(23D) and 65% of its investible funds, out of total proceeds are invested in equity shares of domestic companies. If the conditions of section 111A as given above are satisfied, then the STCG is termed as STCG covered under section 111A. Such gain is charged to tax at 20%. Note 1: STCG covered under section 111A is charged to tax at 15% for any transfer which takes place before 23-07-2024. Note 2: The benefit of concessional tax rate of 20 % shall be available even where STT is not paid, provided that - transaction is undertaken on a recognised stock exchange located in any International Financial Service Centre, and - consideration is paid or payable in foreign currency Illustration Mr. Janak is a salaried employee. In the month of December, 2024 he purchased 100 equity shares of X Ltd. @ Rs. 1,400 per share from Bombay Stock Exchange. These shares were sold in BSE in August, 2025 @ Rs. 2,000 per share (securities transaction tax was paid at the time of sale). What will be the nature of capital gain in this case? ** Shares were purchased in December, 2024 and were sold in August, 2025, i.e., sold after holding them for a period of less than 12 months and, hence, the gain will be short term capital gain. Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds or units of business trust which are transferred on or after 1-10-2004 through a recognised stock exchange", "metadata": {"source": "stcg", "chunk_index": 1}}
{"id": "stcg_2", "text": "and such transaction is liable to securities transaction tax. If the conditions of section 111A are satisfied then the STCG is termed as STCG covered under section 111A. Such gain is charged to tax at 20% (plus surcharge and cess as applicable). In the given case shares were sold after holding them for less than 12 months, shares were sold through a recognised stock exchange and the transaction was liable to STT, hence, the STCG can be termed as STCG covered under section 111A. Further, the transfer is made in August 2025, thus, STCG will be charged to tax at 20% (plus surcharge and cess as applicable). [As amended by Finance Act, 2025] Illustration Mr. Saurabh is a salaried employee. In the month of December, 2024 he purchased 100 units of ABC Mutual fund @ Rs. 100 per unit. The mutual fund is an equity oriented mutual fund. These units were sold in BSE in August, 2025 @ Rs. 125 per unit (securities transaction tax was paid at the time of sale). What will be the nature of capital gain in this case? ** Units were purchased in December, 2024 and were sold in August, 2025, i.e., sold after holding them for a period of less than 12 months and, hence, the gain will be short-term capital gain. Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-fund or units of business trust which were transferred on or after 1-10-2004 through a recognised stock exchange and such transaction was liable to securities transaction tax. If the conditions of section 111A are satisfied then the STCG is termed as STCG covered under section 111A. Such a gain is charged to tax @ 20% (plus surcharge and cess as applicable). In the given case, mutual fund is an equity oriented mutual fund, the units are sold after holding them for less than 12 months, units are sold through recognised stock exchange and the transaction is liable to STT, hence, the STCG can be termed as STCG covered under section 111A. Further, the transfer is made in August 2025, such STCG will be charged to tax at 20% (plus surcharge and cess as applicable).. Illustration Mr. Poddar is a salaried employee. In the month of December 2024 he purchased 100 equity share of ABC ltd. @ 70 USD per share. These shares were sold in August 2025 @ 85 USD per share. No security transaction tax (STT) was payable on transfer of shares as same were listed in recognised stock exchange located in an International Financial Services Centre. ** Section 111A is applicable in case of STCG arising on transfer of equity shares through recognised stock exchange and such transaction is liable to securities transaction tax. STCG covered under section 111A is charged to tax @ 20% (plus surcharge and cess as applicable). The benefit of concessional tax rate of 20% shall be available even where STT is not paid, provided that - transaction is undertaken on a recognised stock exchange located in any International Financial Service Centre, and - consideration is paid or payable in foreign currency In the given case, Mr. Poddar sold shares of ABC Ltd. which were listed in recognised stock exchange located in an International Financial Services Centre (IFSC). Further, consideration is paid in foreign currency. [As amended by Finance Act, 2025] Shares were purchased in December 2024 and sold in August 2025, i.e. sold after holding them for a period of less than 12 months. Hence, the gain will be short-term capital gain. Since the shares were sold through recognised stock exchange located in an IFSC and consideration was paid in foreign currency (i.e., USD). Hence, the STCG can be termed as STCG covered under section 111A even if transaction of sale wasn’t chargeable to STT. Such STCG will be charged to tax @ 20% (plus surcharge and cess as applicable). Illustration Mr. Raja is a salaried employee. In the month of December, 2024 he purchased 100 preference shares of ABC Ltd. @ Rs. 100 per share. These shares were sold in August, 2025 @ Rs. 125 per share. Can the capital gain be termed as STCG covered under section 111A? ** Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds or units of business trust, which were transferred on or after 1-10-2004 through a recognised stock exchange and such transaction is liable to securities transaction tax. In the given case the shares are preference shares and, hence, the provisions of section 111A are not applicable and such gain will be treated as normal STCG. In other words, STCG on sale of preference shares cannot be termed as STCG covered under section 111A. In this case, the STCG is normal and, hence, will be charged to normal tax rate depending on the total income of Mr. Raja. Illustration Mr. Rahul is a salaried employee. In the month of December, 2024 he purchased 100 units of debt oriented mutual fund @ Rs. 100 per unit. These units were sold in August, 2025 @ Rs. 125 per unit. Can the capital gain be termed as STCG covered under section 111A? ** Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds or units of business trust, which were transferred on or after 1-10-2004 through a recognised stock exchange and such transaction is liable to securities transaction tax. In the given case the mutual fund is a debt oriented mutual fund (i.e., not equity oriented mutual fund) and, hence, the provisions of section 111A are not applicable and such gain will be treated as normal STCG. In other words, STCG on sale of units of non-equity oriented mutual funds cannot be termed as STCG covered under section 111A. In this case, the STCG is normal and, hence, will be charged to normal tax rate depending on the total income of Mr. Rahul. Illustration Mr. Jay is a salaried employee. In the month of August, 2024 he purchased 100 shares of ABC Ltd. @ Rs. 100 per share. These shares were sold in August, 2025 @ Rs. 125 per [As amended by Finance Act, 2025] share to his friend. The shares are not listed in any recognised stock exchange. Can the capital gain be termed as STCG covered under section 111A? ** Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds or units of business trust, which were transferred on or after 1-10-2004 through a recognised stock exchange and such transaction is liable to securities transaction tax. In the given case the shares are not listed in a recognised stock exchange and, hence, the provisions of section 111A are not applicable and such gain will be treated as normal STCG. In other words, STCG on sale of unlisted shares cannot be termed as STCG covered under section 111A. In this case, the STCG is normal and, hence, will be charged to normal tax rate depending on the total income of Mr. Jay. Tax on short-term capital gain For the", "metadata": {"source": "stcg", "chunk_index": 2}}
{"id": "stcg_3", "text": "purpose of determination of tax rate, short-term capital gains are classified as follows : Short-term capital gains covered under section 111A. Short-term capital gains other than covered under section 111A. Illustration : STCG covered under section 111A Examples of STCG covered under section 111A : STCG arising on sale of equity shares listed in a recognised stock exchange, which is chargeable to STT. STCG arising on sale of units of equity oriented mutual fund sold through a recognised stock exchange which is chargeable to STT. STCG arising on sale of units of a business trust STCG arising on sale of equity shares, units of equity oriented mutual fund or units of a business trust through a recognised stock exchange located in any International Financial Services Centre and consideration is paid or payable in foreign currency even if transaction of sale is not chargeable to securities transaction tax (STT). Illustration : STCG other than covered under section 111A Examples of STCG not covered under section 111A : STCG arising on sale of equity shares other than through a recognised stock exchange. STCG arising on sale of shares other than equity shares. STCG arising on sale of units of non-equity oriented mutual fund (debt oriented mutual funds). STCG on debentures, bonds and Government securities. [As amended by Finance Act, 2025] STCG on sale of assets other than shares/units like STCG on sale of immovable property, gold, silver, etc. Tax rates of STCG STCG covered under section 111A is charged to tax at the rate of 20%. Note : It was charged to tax at 15% for any transfer which takes place before 23-07-2024. Normal STCG, i.e., STCG other than covered under section 111A is charged to tax at normal rate of tax which is determined on the basis of the total taxable income of the taxpayer. Illustration : Tax rate of STCG covered under section 111A Mr. Kumar sold equity shares of SBI Ltd. Through Bombay Stock Exchange after holding them for a period of 8 months. What will be the tax rate applicable on the STCG? ** The STCG in this case is covered under section 111A and, hence, will be charged to tax at the rate of 15% (if capital asset is transferred before 23-07-2024) or 20% (if capital asset is transferred on or after 23-07-2024). Illustration : Tax rate of STCG covered under section 111A Mr. Kumar sold units of an equity oriented mutual fund in Bombay Stock Exchange after holding them for a period of 8 months. What will be the tax rate applicable on the STCG? ** The STCG in this case is covered under section 111A and, hence, will be charged to tax at the rate of 15% (if capital asset is transferred before 23-07-2024) or 20% (if capital asset is transferred on or after 23-07-2024). Illustration : Tax rate of STCG other than STCG covered under section 111A Mr. Kumar sold units of debt fund after holding them for a period of 8 months. What will be the tax rate applicable on the STCG? ** The gain in this case is not covered under section 111A and is normal STCG and, hence, will be charged to tax at normal rate applicable to Mr. Kumar. The normal rate applicable to Mr. Kumar will be determined on the basis of his total income. Illustration : Tax rate of STCG other than STCG covered under section 111A Mr. Kamal sold his residential house after holding it for a period of 18 months. What will be the tax rate applicable on the STCG? [As amended by Finance Act, 2025] ** The gain in this case is not covered under section 111A and, hence, will be charged to tax at normal rate applicable to Mr. Kamal. The normal rate applicable to Mr. Kamal will be determined on the basis of his total income. Illustration : Tax on STCG Mr. Ramesh (resident and age 56 years) is a salaried employee working in SM Ltd. at an annual salary of Rs. 8,40,000 (after standard deduction). In December 2024, he purchased 10,000 equity shares of A Ltd. at Rs. 100 per share and sold the same in October 2025 at Rs. 125 per share (brokerage Re. 1 per share). The shares were sold through Bombay Stock Exchange and securities transaction tax was paid. What will be the tax liability of Mr. Ramesh (assuming he chooses to opt out from the default tax regime under section 115BAC)? ** First we have to compute the taxable income of Mr. Ramesh and then we will compute the tax liability. The computation of taxable income will be as follows : Particulars Rs. Salary income 8,40,000 Short-Term Capital Gains (*) 2,40,000 Gross Total Income 10,80,000 Less: Deduction under section 80C to 80U Nil Total Income or Taxable Income 10,80,000 Tax on total income ** 1,28,500 Add: Health & education cess @ 4% 5,140 Total tax liability for the year 1,33,640 (*) Computation of STCG : Particulars Rs. Full value of consideration (i.e., Sales consideration ,i.e., Rs. 12,50,000 125 × 10,000 shares) Less: Expenditure incurred wholly and exclusively in (10,000) connection with transfer of capital asset (i.e., brokerage) [As amended by Finance Act, 2025] Net sale consideration 12,40,000 Less: Cost of acquisition (i.e., purchase price, i.e., Rs. 100 × (10,00,000) 10,000 shares) Less: Cost of improvement (i.e., post purchases capital Nil expenses on improvement of capital asset ) Short-Term Capital Gains 2,40,000 ** STCG is covered under section 111A, thus the resultant capital gain will be charged to tax at the rate of 20%. Salary income being normal income will be charged to tax at normal rate. The normal tax rates for the financial year 2025-26 applicable to a resident individual below the age of 60 years are as follows : Nil up to income of Rs. 2,50,000 5% for income above Rs. 2,50,000 but up to Rs. 5,00,000 20% for income above Rs. 5,00,000 but up to Rs. 10,00,000 30% for income above Rs. 10,00,000. Apart from above, health & education cess @ 4% will be levied on the amount of tax. Applying the above normal tax rates, tax on salary income will come to Rs. 80,500 and tax on STCG @ 20% will come to Rs. 48,000 (i.e. 20% of Rs. 2,40,000). Total tax will be Rs. 1,28,500. Health and education cess will apply @ 4% on the total amount of tax. Illustration : Tax on STCG Mr. Kumar (resident and age 40 years) is a salaried employee working in SM Ltd. at an annual salary of Rs. 8,40,000 (after standard deduction). In December, 2024 he purchased a plot of land for Rs. 10,00,000 and sold the same in August, 2025 for Rs. 12,10,000 (brokerage Rs. 10,000). What will be the tax liability of Mr. Kumar (assuming Mr. Kumar chooses to opt out of the default tax regime under section 115BAC)? ** First we have to compute the taxable income of Mr. Kumar and then we will compute the tax liability. The computation of taxable income will be as follows : Particulars Rs. Salary income 8,40,000 Short-Term Capital Gains (*) 2,00,000 Gross Total Income 10,40,000 [As amended by Finance Act, 2025] Less: Deduction under section 80C to", "metadata": {"source": "stcg", "chunk_index": 3}}
{"id": "stcg_4", "text": "80U Nil Total Income or Taxable Income 10,40,000 Tax on total income ** 1,24,500 Add: Health and Education cess @ 4% 4,980 Total tax liability for the year 1,29,480 (*) Computation of STCG : Particulars Rs. Full value of consideration (i.e., Sales consideration) 12,10,000 Less: Expenditure incurred wholly and exclusively in connection (10,000) with transfer of capital asset (i.e., brokerage) Net sale consideration 12,00,000 Less: Cost of acquisition (i.e., purchase price) (10,00,000) Less: Cost of improvement (i.e., post purchases capital expenses on Nil improvement of capital asset ) Short-Term Capital Gains 2,00,000 ** The STCG is normal, i.e., not covered under section 111A, hence, STCG of Rs. 2,00,000 will be added to the salary income and will be charged to tax at normal rates. The normal tax rates for the financial year 2025-26 applicable to a resident individual below the age of 60 years are as follows : Nil up to income of Rs. 2,50,000 5% for income above Rs. 2,50,000 but up to Rs. 5,00,000 20% for income above Rs. 5,00,000 but up to Rs. 10,00,000 30% for income above Rs. 10,00,000. Apart from above, health & education cess @ 4% will be levied on the amount of tax. Applying the above normal rates, tax on total income of Rs. 10,40,000 will come to Rs. 1,24,500 plus health & education cess @ 4% on the amount of tax will be levied and the total tax liability will come to Rs. 1,29,480. Adjustment of STCG against the basic exemption limit Basic exemption limit means the level of income up to which a person is not required to pay any tax. The basic exemption limit applicable in case of an individual is Rs. 4,00,000. However, in case where such individual chooses to opt out from the default tax regime, the basic exemption limit for the financial year 2025-26 is as follows : [As amended by Finance Act, 2025] For resident individual of the age of 80 years or above, the exemption limit is Rs. 5,00,000. For resident individual of the age of 60 years or above but below 80 years, the exemption limit is Rs. 3,00,000. For resident individual of the age below 60 years, the exemption limit is Rs. 2,50,000. For non-resident individual irrespective of the age of the individual, the exemption limit is Rs. 2,50,000. For HUF, the exemption limit is Rs. 2,50,000. Illustration: Mr. Kapoor (resident, age 25 years) is a salaried employee earning taxable salary of Rs. 1,84,000 per annum. Apart from salary income he has earned interest on fixed deposit of Rs. 6,000. He does not have any other income. What will be his tax liability for the year 2025-26? ** For resident individual of the age below 60 years, the basic exemption limit is Rs. 2,50,000. In this case, the taxable income of Mr. Kapoor is Rs. 1,90,000 (Rs. 1,84,000 + Rs. 6,000), which is below the basic exemption limit of Rs. 2,50,000, hence, his tax liability will be NIL. However, if Mr. Kapoor chooses for default tax regime under section 115BAC, the basic exemption limit will be Rs. 4,00,000. Illustration: Mr. Viren (resident and age 62 years) is a businessman. His taxable income for the financial year 2025-26 is Rs. 2,75,200. He does not have any other income. What will be his tax liability for the financial year 2025-26? ** For resident individual of the age of 60 years and above but below 80 years, the basic exemption limit is Rs. 3,00,000. In this case, the taxable income of Mr. Viren is Rs. 2,75,200, which is below the basic exemption limit of Rs. 3,00,000, hence, his tax liability will be NIL. Illustration: Mrs. Raj (resident and age 82 years) is a doctor. Her taxable income for the financial year 2025- 26 is Rs. 4,84,000. She does not have any other income. What will be her tax liability for the year 2025-26? ** For resident individual of the age of 80 years and above, the basic exemption limit is Rs. 5,00,000. In this case, the taxable income of Mrs. Raj is Rs. 4,84,000, which is below the basic exemption limit of Rs. 5,00,000, hence, her tax liability will be NIL. However, if Mrs. Raj chooses for default tax regime under section 115BAC, the basic exemption limit [As amended by Finance Act, 2025] will be Rs. 4,00,000. Illustration: Mr. Raj (a non-resident and age 82 years) is a retired person. He is residing in Canada. He owns a house in Mumbai which is given on rent and the taxable rental income for the year amounts to Rs. 1,84,000. What will be his tax liability for the financial year 2025- 26? ** For non-resident individual, irrespective of the age, the basic exemption limit is Rs. 2,50,000. In this case, the taxable income of Mr. Raj is Rs. 1,84,000, which is below the basic exemption limit of Rs. 2,50,000, hence, his tax liability will be NIL. However, if Mr. Raj chooses for default tax regime under section 115BAC, the basic exemption limit will be Rs. 4,00,000. Adjustment of STCG against the basic exemption limit In the preceding illustrations we observed that if the income of the taxpayer is below the basic exemption limit then there will be no tax liability. Now a question arises, can taxpayer adjust the basic exemption limit against short-term capital gain? The provisions in this regard are as follows : STCG covered under section 111A Only a resident individual and resident HUF can adjust the exemption limit against STCG covered under section 111A. Thus, a non-resident individual/HUF cannot adjust the exemption limit against STCG covered under section 111A. A resident individual/HUF can adjust the STCG covered under section 111A against the basic exemption limit but such adjustment is possible only after making adjustment of other income. In other words, first income other than STCG covered under section 111A is to be adjusted against the exemption limit and then the remaining limit (if any) can be adjusted against STCG covered under section 111A. Illustration Mr. Kapoor (age 67 years and resident) is a retired person. He purchased equity shares of SBI Ltd. in March, 2025 and sold the same in May, 2025 (sold in Bombay Stock Exchange and STT is levied). Taxable STCG amounted to Rs. 1,20,000. Apart from gain on sale of shares he is not having any income. What will be his tax liability for the financial year 2025-26? * For resident individual of the age of 60 years and above but below 80 years, the basic exemption limit is Rs. 3,00,000. Further, a resident individual can adjust the basic exemption limit against STCG covered under section 111A. In this case, STCG of Rs. 1,20,000 is covered under section 111A, hence, the adjustment of such gain against the exemption limit is allowed only to a resident. In this case, Mr. Kapoor is a resident and, [As amended by Finance Act, 2025] hence, he can adjust the STCG of Rs. 1,20,000 against the exemption limit. Considering the above discussion, the tax liability of Mr. Kapoor for the financial year 2025-26 will be NIL. Illustration Mr. Krunal (age 59 years and resident) is a retired person earning a monthly pension of Rs. 5,000. He purchased", "metadata": {"source": "stcg", "chunk_index": 4}}
{"id": "stcg_5", "text": "shares of SBI Ltd. in December, 2024 and sold the same in April, 2025 (sold in Bombay Stock Exchange and STT is levied). Taxable STCG amounted to Rs. 2,20,000. Apart from pension income and gain on sale of shares he is not having any other income. What will be his tax liability for the financial year 2025-26 assuming Mr. Krunal chooses to opt out from the default tax regime under section 115BAC? * The basic exemption limit in this case is Rs. 2,50,000, after adjustment of pension income of Rs. 60,000 from the exemption limit of Rs. 2,50,000 the balance will come to Rs. 1,90,000. The balance of Rs. 1,90,000 will be adjusted against STCG. Total STCG on sale of shares is Rs. 2,20,000 and the available exemption limit (after adjustment of pension income) is Rs. 1,90,000, hence, the balance STCG left after adjustment of Rs. 1,90,000 will come to Rs. 30,000. The gain of Rs. 30,000 will be charged to tax @ 20% (plus cess @ 4%). Thus, the tax liability before cess will come to Rs. 6,000. Since the total income of Mr Krunal is up to Rs. 5,00,000, he shall be eligible for rebate available under section 87A. Rebate shall be limited to tax payable or Rs. 12,500, whichever is less. Illustration Mr. Gagan (age 59 years and non-resident) is a retired person earning a monthly pension of Rs. 5,000 from Indian employer. He purchased shares of SBI Ltd. in December, 2024 and sold the same in April, 2025 (sold in Bombay Stock Exchange and STT was levied). Taxable STCG amounted to Rs. 2,20,000. Apart from pension income and gain on sale of shares he is not having any other income. What will be his tax liability for the financial year 2025- 26? * For non-resident individual irrespective of the age, the basic exemption limit is Rs. 2,50,000. Further, a non-resident individual cannot adjust the basic exemption limit against STCG covered under section 111A. In other words, Mr. Gagan can adjust the pension income against the basic exemption limit but the remaining exemption limit cannot be adjusted against STCG on sale of shares. The basic exemption limit in this case is Rs. 2,50,000, and the same will be adjusted against pension income of Rs. 60,000. The balance limit of Rs. 1,90,000 (i.e., Rs. 2,50,000 less Rs. 60,000) cannot be adjusted against STCG covered under section 111A. In the instant case, the shares are transferred in April 2025, therefore, Mr. Gagan has to pay tax @ 20% (plus cess 4%) on STCG of Rs. 2,20,000. Thus, the tax liability will [As amended by Finance Act, 2025] come to Rs. 45,760. Deductions under section 80C to 80U and STCG No deduction under sections 80C to 80U is allowed on short-term capital gains referred to in section 111A. However, such deductions can be claimed from STCG other than covered under section 111A. Illustration Mr. Kapoor (age 57 years and resident) is a retired person. He purchased a piece of land worth Rs. 8,84,000 in March, 2024 and sold the same in April, 2025 for Rs. 12,84,000. Apart from gain on sale of land he is not having any other income. He deposited Rs. 1,00,000 in Public Provident Fund (PPF) and Rs. 50,000 in NSC . He wants to claim deduction under section 80C on account of Rs. 1,50,000 deposited in PPF and NSC. Can he do so? ** Deduction under section 80C to 80U can be claimed on short-term capital gains other than STCG covered under section 111A. In this case, the gain is on sale of land and, hence, is not covered under section 111A. Hence, Mr. Kapoor can claim deduction of Rs. 1,50,000 under section 80C from STCG of Rs. 4,00,000. The taxable income of Mr. Kapoor will be computed as follows : Particulars Rs. Short-Term Capital Gains (Rs. 12,84,000 less Rs. 8,84,000) 4,00,000 Gross Total Income 4,00,000 Less: Deduction under section 80C to 80U (1,50,000) Total Income or Taxable Income 2,50,000 Illustration Mr. Kapoor (age 57 years and resident) is a retired person. He purchased equity shares of SBI Ltd. in March, 2025 and sold the same in April, 2025 (sold in Bombay Stock Exchange and STT is levied). Taxable STCG amounted to Rs. 2,20,000. Apart from gain on sale of shares he is not having any other income. He deposited Rs. 1,50,000 in Public Provident Fund (PPF). He wants to claim deduction under section 80C on account of Rs. 1,50,000 deposited in PPF. Can he do so? ** No deduction under sections 80C to 80U is allowed on short-term capital gains referred to in section 111A. In this case, the STCG of Rs. 2,20,000 arising on account of sale of shares is STCG covered under section 111A and, hence, Mr. Kapoor cannot claim any [As amended by Finance Act, 2025] deduction under section 80C to 80U from such gain. Considering the above provisions, Mr. Kapoor cannot claim deduction of Rs. 1,50,000 under section 80C from the STCG of Rs. 2,20,000. The taxable income of Mr. Kapoor will be computed as follows : Particulars Rs. Short-Term Capital Gains 2,20,000 Gross Total Income 2,20,000 Less: Deduction under section 80C to 80U Nil Total Income or Taxable Income 2,20,000 [As amended by Finance Act, 2025] MCQ ON TAX ON SHORT-TERM CAPITAL GAINS Q1. \"Capital asset\" includes stock-in-trade held for the purposes of business or profession. (a) True (b) False Correct answer:(b) Justification of correct answer: Capital asset is defined to include: (a) Any kind of property held by an assesse, whether or not connected with business or profession of the assesse. (b) Any securities held by a FII which has invested in such securities in accordance with the regulations made under the SEBI Act, 1992. However, the following items are excluded from the definition of “capital asset”: (i) anystock-in-trade, consumable stores or raw materials held for the purposes of his business or profession; (ii) personal effects, that is, (including wearing apparel and furniture) held for personal use by the tax payer or any member of his family dependent on him, but excludes— a) jewellery; b) archaeological collections; c) drawings; d) paintings; e) sculptures; or f) any work of art (ii) agricultural land in India situated in rural area; (iv) 6.5 percent Gold Bonds, 1977 or 7 percent Gold Bonds, 1980 or National Defence Gold Bonds, 1980 issued by the Central Government; (v) Special Bearer Bonds, 1991; (vi) Gold Deposit Bonds issued under the Gold Deposit Scheme, 1999 or deposit certificates issued under the Gold Monetisation Scheme, 2015. Thus, the statement given in the question is false and hence, option (b) is the correct option. Q2. Capital assets like equity shares which are listed in a recognised stock exchange in India will be treated as short-term capital assets if they are held by the taxpayer for a period of not more than months immediately preceding the date of its transfer. [As amended by Finance Act, 2025] (a) 12 (b) 24 (c) 36 (d) 48 Correct answer:(a) Justification of correct answer: Any capital asset held by the taxpayer for a period of not more than 24 months immediately preceding the date of its transfer will be treated as short-term capital asset.", "metadata": {"source": "stcg", "chunk_index": 5}}
{"id": "stcg_6", "text": "However, in respect of certain assets like shares (equity or preference) which are listed in a recognised stock exchange in India (listing of shares is not mandatory if transfer of such shares took place on or before July 10, 2014), units of equity oriented mutual funds, listed securities like debentures and Government securities, Units of UTI and Zero Coupon Bonds, the period of holding to be considered is 12 months instead of 24 months. Thus, option (a) is the correct option. Q3. Section 111A is applicable in case of STCG arising on transfer of which security that are transferred on or after 1-10-2004 in a recognised stock exchange and such transaction is liable to securities transaction tax(STT). (a) Preference shares (b) Units of debt oriented mutual fund (c) Units of business trust (d) Zero coupon bonds Correct answer:(c) Justification of correct answer: Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds or units of business trust which are transferred on or after 1- 10-2004 in a recognised stock exchange and such transaction is liable to securities transaction tax(STT). With effect from Assessment Year 2018-18, benefit of concessional tax rate of 15% or 20%, as the case may be, shall be available even where STT is not paid, provided that - transaction is undertaken on a recognised stock exchange located in any International Financial Service Centre, and - consideration is paid or payable in foreign currency Thus, option(c) is the correct option. Q4. Short-term capital gain covered under section 111A is charged to tax at _. (a) 10% (b) 15% (c) 15% or 20% (d) Normal rate of tax which is determined on the basis of the total taxable income of the taxpayer Correct answer:(c) Justification of correct answer: [As amended by Finance Act, 2025] Short-term capital gains covered under section 111A is charged to tax @15% (plus surcharge and cess as applicable) if the capital asset is transferred before 23-07-2024. In case capital asset is transferred on or after 23-07-2024, the capital gains shall be chargeable to tax at the rate of 20%. Thus, the statement given in the question is true and hence, option (c) is the correct option. Q5. Short-term capital gain arising on sale of equity shares outside recognised stock exchange is covered under section111A. (a) True (b) False Correct answer:(b) Justification of correct answer: Section 111A is applicable in case of STCG arising on transfer of equity shares or units of equity oriented mutual-funds or units of business trust which are transferred on or after 1-10- 2004 in a recognized stock exchange and such transaction is liable to securities transaction tax (STT). In other words, short-term capital gain arising on sale of equity shares outside recognised stock exchange is treated as STCG other than STCG covered under section 111A. With effect from Assessment Year 2018-19, benefit of concessional tax rate shall be available even where STT is not paid, provided that - transaction is undertaken on a recognised stock exchange located in any International Financial Service Centre, and - consideration is paid or payable in foreign currency Thus, the statement given in the question is false and hence, option (b) is the correct option. Q6. Short-term capital gain other than covered under section 111A is charged to tax at _. (a) 10% (b) 15% (c) 20% (e) Normal rate of tax which is determined on the basis of the total taxable income of the taxpayer Correct answer:(d) Justification of correct answer: Normal short-term capital gain, i.e., short-term capital gain other than covered under section 111A is charged to tax at normal rate of tax which is determined on the basis of the total taxable income of the taxpayer. Thus, option(d) is the correct option. Q7. A resident as well as a non-resident individual and HUF can adjust the exemption limit against short-term capital gain other than covered under section111A. (a) True (b) False Correct answer:(a) Justification of correct answer: [As amended by Finance Act, 2025] A resident as well as non-resident individual and HUF can adjust the exemption limit against STCG other than covered under section111A. Thus, the statement given in the question is true and hence, option(a) is the correct option. Q8. A resident as well as a non-resident individual and HUF can adjust the exemption limit against short-term capital gain covered under section111A. (a) True (b) False Correct answer:(b) Justification of correct answer: Only a resident individual and resident HUF can adjust the exemption limit against STCG covered under section 111A. Thus, a non-resident individual/HUF cannot adjust the exemption limit against STCG covered under section 111A. Thus, the statement given in the question is false and hence, option(b) is the correct option. Q9. Deduction under sections 80C to 80U is allowed from short-term capital gains referred to in section 111A. (a) True (b) False Correct answer:(b) Justification of correct answer: No deduction under sections 80C to 80U is allowed from short-term capital gains referred to in section111A. Thus, the statement given in the question is false and hence, option (b) is the correct option. Q10. Deduction under sections 80C to 80U is allowed from short-term capital gains other than short-term capital gains covered under section111A. (a) True (b) False Correct answer:(a) Justification of correct answer: No deduction under sections 80C to 80U is allowed from short-term capital gains referred to in section 111A. However, such deductions can be claimed from STCG other than covered under section 111A. Thus, the statement given in the question is true and hence, option (a) is the correct option. [As amended by Finance Act, 2025]", "metadata": {"source": "stcg", "chunk_index": 6}}
